Àº§ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿ¿¹¦ÿ¾¸¥ÿ½·¤ÿ¾¸¥ÿ¾¸¥ÿ¿¹¦ÿ¿¹¦ÿÀº§ÿÀº§ÿÀº§ÿÁ»¨ÿÀº§ÿ¿¹¦ÿ¿¹¦ÿ¾¸¥ÿ¾¸¥ÿ¿¹¦ÿ¿¹¦ÿÀº§ÿ¾¸¥ÿ¿¹¦ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÀº§ÿÁ»¨ÿÂº©ÿÂº©ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÂº©ÿÁ¹¨ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÂº©ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ½µ¤ÿ½µ¤ÿ¼µ¢ÿ½¶£ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ¾·¤ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ½¶£ÿ¼µ¢ÿÀ¸§ÿ¾¶¥ÿ½µ¤ÿ½µ¤ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿÁ»¨ÿÁ»¨ÿ¾¸¥ÿ¿¹¦ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÀº§ÿÁ»¨ÿÂº©ÿÂº©ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÂº©ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¾·¤ÿ¾·¤ÿ¾·¤ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿÂº©ÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¿·¦ÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ½µ¤ÿ½µ¤ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÂ¼©ÿÂ¼©ÿÂ¼©ÿÂ¼©ÿÂ¼©ÿÂ¼©ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿ¿¹¦ÿ¿¹¦ÿ¾¸¥ÿÂ¼©ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÁ»¨ÿÁ»¨ÿÂ¼©ÿ¾¸¥ÿÀº§ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÀº§ÿÁ»¨ÿÃ»ªÿÂº©ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÂº©ÿÃ»ªÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ½¶£ÿ½¶£ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÄ¼«ÿÂº©ÿÀ¸§ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ½µ¤ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÁ»¨ÿÁ»¨ÿÂ¼©ÿÂ¼©ÿÂ¼©ÿÂ¼©ÿÁ»¨ÿÁ»¨ÿÂ¼©ÿÂ¼©ÿÂ¼©ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿÁ»¨ÿÁ»¨ÿ¾¸¥ÿÀº§ÿÁ»¨ÿÂ¼©ÿÁ»¨ÿÀº§ÿÁ»¨ÿÁ»¨ÿÃ»ªÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÂº©ÿÂº©ÿÂº©ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÂ»¨ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ¾·¤ÿÄ¼«ÿÂº©ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº©ÿÁº©ÿÂ»ªÿÂ»ªÿÂ»ªÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº©ÿ¿¸§ÿÀ¹¨ÿÂ»ªÿÂ»ªÿÁº©ÿÀ¹¨ÿÁº©ÿÂ»ªÿÂ»ªÿÂ»ªÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÂ»ªÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¾¶¥ÿ¿·¦ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿÂº©ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº©ÿÂ»ªÿÂ»ªÿÂ»ªÿÂ»ªÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÂ»ªÿÂ»ªÿ¿¸§ÿÀ¹¨ÿÂ»ªÿÂ»ªÿÁº©ÿÁº©ÿÁº©ÿÂ»ªÿÂ»ªÿÂ»ªÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÃ¼«ÿÃ¼«ÿÂ»ªÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÃ»ªÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¾¶¥ÿ¿·¦ÿÁ¹¨ÿÂº©ÿÂº©ÿÂº©ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÂº©ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿÁ¹¨ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÂ¾¬ÿÂ¾¬ÿÁ½«ÿÀ¼ªÿÀ¼ªÿÀ¼ªÿÀ¼ªÿÀ¼ªÿ¿»©ÿ¿»©ÿ¿»©ÿ¿»©ÿ¿»©ÿ¿»©ÿ¿»©ÿ¿»©ÿÀ¼ªÿÀ¼ªÿ¿»©ÿ¿»©ÿ¿»©ÿ¿»©ÿÀ¼ªÿÀ¼ªÿ½¹§ÿ¿»©ÿÀ¼ªÿÀ¼ªÿ¿»©ÿ¿»©ÿ¿»©ÿÀ¼ªÿÃ¼«ÿÂ»ªÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÂ»ªÿÂ»ªÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÂ»ªÿÂ»ªÿÂ»ªÿÂ»ªÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿÁº©ÿÃ¼«ÿÁº©ÿÀ¹¨ÿ¿¸§ÿÀ¹¨ÿÁº©ÿÁº©ÿÀ¹¨ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿÅÁ¯ÿÄÀ®ÿÃ¿­ÿÂ¾¬ÿÂ¾¬ÿÁ½«ÿÂ¾¬ÿÂ¾¬ÿÂ¾¬ÿÂ¾¬ÿÂ¾¬ÿÁ½«ÿÁ½«ÿÀ¼ªÿÀ¼ªÿÀ¼ªÿ¿»©ÿ¿»©ÿ¾º¨ÿ¾º¨ÿ¾º¨ÿ¾º¨ÿ¿»©ÿ¿»©ÿ½¹§ÿ¿»©ÿÀ¼ªÿÀ¼ªÿÀ¼ªÿ¿»©ÿ¿»©ÿÀ¼ªÿÃ¼«ÿÂ»ªÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÂ»ªÿÃ¼«ÿÄ½¬ÿÃ¼«ÿÃ¼«ÿÂ»ªÿÂ»ªÿÂ»ªÿÂ»ªÿÂ»ªÿÂ»ªÿÁº©ÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÂ»ªÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÁº©ÿÀ¹¨ÿ¿¸§ÿ¾·¦ÿ¿¸§ÿÀ¹¨ÿÁº©ÿÂ»ªÿÃ¼«ÿÂ»ªÿÁº©ÿÀ¹¨ÿ¿¸§ÿ¾·¦ÿ¾·¦ÿ¾·¦ÿÅ¾­ÿÃ¼«ÿÁº©ÿÀ¹¨ÿÁº©ÿÁº©ÿÀ¹¨ÿ¿¸§ÿÂ»ªÿÂ»ªÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº©ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿÁ»¨ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿÁº§ÿÁº§ÿ¿¸¥ÿ»´¡ÿ»´¡ÿ¿¸¥ÿÁº§ÿÁº§ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ½µ¤ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ½¶£ÿ¼µ¢ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ¿µ£ÿÁ·¥ÿÂ¸¦ÿÁ·¥ÿÀ¶¤ÿ¿µ£ÿ¿µ£ÿÀ¶¤ÿ¾´¢ÿ¾´¢ÿ¾´¢ÿÀ¶¤ÿÂ¸¦ÿÃ¹§ÿÁ·¥ÿÀ¶¤ÿ¿¸¥ÿ¾·¤ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÃ¹§ÿÂ¸¦ÿÁ·¥ÿ¿µ£ÿ¾´¢ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿ¾´¢ÿ¿µ£ÿ¿µ£ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ¾·¤ÿÀ¹¦ÿÀ¹¦ÿ¾·¤ÿ¾·¤ÿÀ¹¦ÿÀ¹¦ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ½¶£ÿ½¶£ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ½¶£ÿÀ¶¤ÿÁ·¥ÿÂ¸¦ÿÁ·¥ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿÁ·¥ÿÀ¶¤ÿ¿µ£ÿ¾´¢ÿ¿µ£ÿÀ¶¤ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÃ¹§ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ½¶£ÿ¿¸¥ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿ¿¸¥ÿ½¶£ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÁ¹¨ÿÁ¹¨ÿ¿·¦ÿ¾¶¥ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¾¶¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ½¶£ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¾·¤ÿ½¶£ÿ½¶£ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÀ¶¤ÿ¿µ£ÿ¿µ£ÿÀ¶¤ÿÂ¸¦ÿÃ¹§ÿÁ·¥ÿ¿µ£ÿ¾´¢ÿ¿µ£ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ½¶£ÿ¼µ¢ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÂ»¨ÿÂ»¨ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿÂ¸¦ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÂ¸¦ÿÃ¹§ÿÅ»©ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ¾·¤ÿ¾·¤ÿÀ¹¦ÿÂ»¨ÿÂ»¨ÿÀ¹¦ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿ¾¶¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¾·¤ÿ¾·¤ÿ½¶£ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÀ¶¤ÿ¾´¢ÿ¿µ£ÿÁ·¥ÿÃ¹§ÿÄº¨ÿÂ¸¦ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ½¶£ÿ½¶£ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿÄº¨ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁº§ÿ¿¸¥ÿ¿¸¥ÿÁº§ÿÁº§ÿ¿¸¥ÿ¿¸¥ÿÁº§ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÁ¹¨ÿÂº©ÿÁ¹¨ÿ¿·¦ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¾·¤ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÀ¶¤ÿ¿µ£ÿ¿µ£ÿÂ¸¦ÿÄº¨ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÂ¸¦ÿÃ¹§ÿÃ¹§ÿÁ·¥ÿ¿µ£ÿ½¶£ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ¾·¤ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÁ·¥ÿÂ¸¦ÿÃ¹§ÿÄº¨ÿÃ¹§ÿÂ¸¦ÿÀ¶¤ÿ¿µ£ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÃ¹§ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÃ¼©ÿ¿¸¥ÿ¾·¤ÿÀ¹¦ÿÀ¹¦ÿ¾·¤ÿ¿¸¥ÿÃ¼©ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÂº©ÿÂº©ÿÁ¹¨ÿÀ¸§ÿÂº©ÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿÃ¹§ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÀ¶¤ÿÀ¶¤ÿÂ¸¦ÿÄº¨ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÃ¹§ÿÄº¨ÿÄº¨ÿÂ¸¦ÿÀ¶¤ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ½¶£ÿ½¶£ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿ½³¡ÿ¿µ£ÿÂ¸¦ÿÄº¨ÿÅ»©ÿÄº¨ÿÂ¸¦ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿ¿µ£ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÂ¸¦ÿÃ¹§ÿÃ¹§ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÂ¼©ÿ¾¸¥ÿ½·¤ÿÁ»¨ÿÁ»¨ÿ½·¤ÿ¾¸¥ÿÂ¼©ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿÀº§ÿÀº§ÿÀº§ÿ¾·¦ÿ¾·¦ÿ¾·¦ÿ¿¸§ÿÁº©ÿÂ»ªÿÁº©ÿ¿¸§ÿÁº©ÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿÁ»¨ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿ¿¹¦ÿ¿¹¦ÿÀº§ÿÀº§ÿÀº§ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÂ»¨ÿÁº§ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿ¾´¢ÿ¿µ£ÿÁ·¥ÿÂ¸¦ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÂ¼©ÿ½·¤ÿ½·¤ÿÂ¼©ÿÂ¼©ÿ½·¤ÿ½·¤ÿÂ¼©ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿ¾·¦ÿ¾·¦ÿ¾·¦ÿ¿¸§ÿÁº©ÿÂ»ªÿÁº©ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÁº©ÿÁ»¨ÿÁ»¨ÿÀº§ÿÀº§ÿÀº§ÿÀº§ÿ¿¹¦ÿÀº§ÿÀº§ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¿¹¦ÿ¾¸¥ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÂ»¨ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÀ¹¦ÿ¾·¤ÿ¾·¤ÿÀ¹¦ÿÂ»¨ÿÃ¼©ÿÄ½ªÿÄ½ªÿÂ»¨ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÂ»¨ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÀ¶¤ÿ¿µ£ÿÁ·¥ÿÃ¹§ÿÃ¹§ÿÁ·¥ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÂ¶¤ÿÀ´¢ÿÆ¸¦ÿÅ·¥ÿÂ´¢ÿÂ´¢ÿÇ¹§ÿÈº¨ÿÅ·¥ÿÄ¶¤ÿÄ¶¤ÿÅ·¥ÿÅ·¥ÿÅ·¥ÿÅ·¥ÿÄ¶¤ÿÂ¶¤ÿÂ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿ¿µ£ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÄº¨ÿÀ¹¦ÿ¾·¤ÿ¿¸¥ÿÁº§ÿÂ»¨ÿÀ¹¦ÿ¾·¤ÿ¾·¤ÿÀ¹¦ÿÁº§ÿÁº§ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÃ¼©ÿÁº§ÿÁº§ÿÁ¹¨ÿÁº§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÂ¹«ÿÂº©ÿÂ¹«ÿÂº©ÿÂ¹«ÿÂ¹«ÿÀ¸«ÿÀ¸«ÿÀ¸«ÿÁ¹¬ÿÁ¹¬ÿÁ¹¬ÿÂº­ÿÂº­ÿ¿¶©ÿÂ¹¬ÿÅ¼¯ÿÅ¼¯ÿÂ¹¬ÿÀ·ªÿÀ·ªÿÁ¸«ÿÀ¹ªÿ¿º«ÿÁº«ÿ¿º«ÿÀ¹ªÿ¾¹ªÿÂ»¬ÿÁ¼­ÿÀ¹ªÿ¾¹ªÿ¾¹ªÿ¾¹ªÿ¿º«ÿ¿º«ÿ¿º«ÿ¿º«ÿ¾¶©ÿÂ»¬ÿÃ»®ÿÀ¹ªÿÀ¸«ÿÃ¼­ÿÂº­ÿ¾·¨ÿÁº«ÿÀ»¬ÿÄ½®ÿÃ¾¯ÿÄ½®ÿÁ¼­ÿÀ¹ªÿ½·ªÿÁ·¥ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿ¾´¢ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÄ¶¤ÿÇ¹§ÿÆ¸¦ÿÃµ£ÿÃµ£ÿÆ¸¦ÿÆ¸¦ÿÃµ£ÿÄ¶¤ÿÄ¶¤ÿÄ¶¤ÿÅ·¥ÿÅ·¥ÿÄ¶¤ÿÄ¶¤ÿÂ¶¤ÿÂ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁº§ÿÀ¹¦ÿ¾·¤ÿ¿¸¥ÿÁº§ÿÂ»¨ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿÀ¹¦ÿÂ»¨ÿÃ¼©ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ·©ÿÀ·ªÿÀ·ªÿÁ¸«ÿÁ¸«ÿÂ¹¬ÿÂ¹¬ÿÂ¹¬ÿ¿¶©ÿÂ¹¬ÿÄ»®ÿÃº­ÿÁ¸«ÿÀ·ªÿÀ·ªÿÁ¸ªÿ¾·¦ÿ¿¸§ÿ¿¸§ÿ¾·¦ÿ½¶¥ÿ½¶¥ÿ¿¸§ÿÀ¹¨ÿ¾·¦ÿ¾·¦ÿ¾·¦ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿ½¶§ÿÁº«ÿÂ»¬ÿÀ¹ªÿÀ¹ªÿÂ»¬ÿÁº«ÿ½¶§ÿ¿¸©ÿÀ¹ªÿÀ¹ªÿÁº«ÿÂ»¬ÿÂ»¬ÿÃ¼­ÿÃ¼­ÿÀ¶¤ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÅ·¥ÿÇ¹§ÿÆ¸¦ÿÄ¶¤ÿÃµ£ÿÅ·¥ÿÅ·¥ÿÃµ£ÿÃµ£ÿÃµ£ÿÄ¶¤ÿÄ¶¤ÿÄ¶¤ÿÄ¶¤ÿÃµ£ÿÁµ£ÿÂ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÂ»¨ÿÁº§ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÀ·©ÿÀ·©ÿÀ·©ÿÁ¸ªÿÁ¸ªÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÀ·©ÿÁ¸ªÿÂ¹«ÿÂ¹«ÿÀ·©ÿ¿¶¨ÿÀ·©ÿÁ¸ªÿ¾·¦ÿ¿¸§ÿ¿¸§ÿ¾·¦ÿ½¶¥ÿ½¶¥ÿ¾·¦ÿ¿¸§ÿ¾·¦ÿ¾·¦ÿ¾·¦ÿ¾·¦ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¾·¨ÿÀ¹ªÿÁº«ÿÀ¹ªÿÀ¹ªÿÁº«ÿÀ¹ªÿ¾·¨ÿÀ¹ªÿ¿¸©ÿ¿¸©ÿ¿¸©ÿ¿¸©ÿÁº«ÿÂ»¬ÿÃ¼­ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÃ·¥ÿÆ¸¦ÿÅ·¥ÿÄ¶¤ÿÄ¶¤ÿÄ¶¤ÿÄ¶¤ÿÄ¶¤ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÁµ£ÿ¿µ£ÿÀ¶¤ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿ¿¸¥ÿÀ¹¦ÿÂ»¨ÿÃ¼©ÿÂ»¨ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÁ¸ªÿÁ¸ªÿÁ¸ªÿÁ¸ªÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÃº¬ÿÂ¹«ÿÂ¹«ÿÁ¸ªÿÁ¸ªÿÀ·©ÿÀ·©ÿÁ¸ªÿÁ¸ªÿÁº©ÿÁº©ÿÁº©ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿÁº©ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿ¿¸©ÿÀ¹ªÿÁº«ÿÀ¹ªÿÀ¹ªÿÁº«ÿÀ¹ªÿ¿¸©ÿÁº«ÿÁº«ÿÀ¹ªÿÀ¹ªÿ¿¸©ÿ¿¸©ÿ¿¸©ÿ¿¸©ÿÀ¶¤ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÄ¸¦ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿ¿µ£ÿÀ¶¤ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÃ¼©ÿÂ»¨ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÂº©ÿÃ»ªÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÃ»ªÿÃ»ªÿÂº©ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÃ»ªÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÂº©ÿÀ¹ªÿÀ¹ªÿÀ¹ªÿÁº«ÿÁº«ÿÀ¹ªÿÀ¹ªÿÀ¹ªÿÀ¹ªÿÀ¹ªÿÂ»¬ÿÂ»¬ÿÂ»¬ÿÀ¹ªÿ¿¸©ÿ¾·¨ÿÀ¶¤ÿÁ·¥ÿÃ¹§ÿÂ¸¦ÿÁ·¥ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÂ¶¤ÿÀ´¢ÿÁµ£ÿÄ¸¦ÿÄ¸¦ÿÃ·¥ÿÃ·¥ÿÅ¹§ÿÄ¸¦ÿÄ¸¦ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÄ¸¦ÿÄ¸¦ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿ¿¸¥ÿÁº§ÿÂ»¨ÿÂ»¨ÿÁº§ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÃ»ªÿÂº©ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÃ»ªÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÀ¸§ÿ¿·¦ÿ¿·¦ÿÀ¸§ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁº«ÿÀ¹ªÿÀ¹ªÿÂ»¬ÿÂ»¬ÿÀ¹ªÿÀ¹ªÿÁº«ÿ¼µ¦ÿ¾·¨ÿÁº«ÿÃ¼­ÿÃ¼­ÿÃ¼­ÿÁº«ÿÀ¹ªÿ¿µ£ÿÁ·¥ÿÃ¹§ÿÂ¸¦ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÃ·¥ÿÁµ£ÿÁµ£ÿÅ¹§ÿÅ¹§ÿÂ¶¤ÿÁµ£ÿÄ¸¦ÿÃ·¥ÿÃ·¥ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÃ·¥ÿÃ·¥ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ½¶£ÿ¿¸¥ÿÀ¹¦ÿÀ¹¦ÿ¾·¤ÿ½¶£ÿ¾·¤ÿÀ¹¦ÿ¾·¤ÿÀ¹¦ÿÂ»¨ÿÂ»¨ÿÀ¹¦ÿ¿¸¥ÿ¿¸¥ÿ¿¸¥ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿÂ»¨ÿÂ»¨ÿÂ»¨ÿÁº§ÿÁº§ÿÂ»¨ÿÃ¼©ÿÃ¼©ÿÁº§ÿ¾·¤ÿÁ·¦ÿÂ¸§ÿÂ¸§ÿÁ·¦ÿÀ¶¥ÿÀ¶¥ÿÂ¸§ÿÃ¹¨ÿÁ·¦ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÃ¹¨ÿÃ¹¨ÿÁ¹¨ÿÂ»ªÿ¿¸§ÿ¿¸§ÿÂ»ªÿÂ»ªÿ¿¸§ÿ¿¸§ÿÂ»ªÿ¾·¦ÿ¾·¦ÿÀ¹¨ÿÁº©ÿÂ»ªÿÂ»ªÿÁº©ÿÁº©ÿ¾´¢ÿÀ¶¤ÿÂ¸¦ÿÂ¸¦ÿÀ¶¤ÿ¿µ£ÿÀ¶¤ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÅ¹§ÿÂ¶¤ÿÂ¶¤ÿÅ¹§ÿÅ¹§ÿÀ´¢ÿÀ´¢ÿÂ¶¤ÿÁµ£ÿÁµ£ÿÀ´¢ÿÀ´¢ÿÀ´¢ÿÀ´¢ÿÁµ£ÿ¿µ£ÿÀ¶¤ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿ¿µ£ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿ½¶£ÿ¿¸¥ÿÁº§ÿÀ¹¦ÿ¾·¤ÿ½¶£ÿ¾·¤ÿÀ¹¦ÿ½¶£ÿ¿¸¥ÿÁº§ÿÁº§ÿÀ¹¦ÿ¿¸¥ÿ¾·¤ÿ¿¸¥ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÀ¸§ÿÂ»¨ÿÂ»¨ÿÂ»¨ÿÂ»¨ÿÃ¼©ÿÃ¼©ÿÄ½ªÿÄ½ªÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÂ»¨ÿÄ½ªÿÃ¼©ÿÀ¹¦ÿ½¶£ÿÂ¸§ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÂ¸§ÿÂ¸§ÿÄº©ÿÅ»ªÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÃ»ªÿ¾·¦ÿ¾·¦ÿÂ»ªÿÂ»ªÿ¾·¦ÿ¾·¦ÿÂ»ªÿÂ»ªÿÁº©ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿÀ·­ÿÀº¯ÿÂ¼±ÿÁ½²ÿÃ¼³ÿÂ½´ÿÃ½¶ÿÂ¿·ÿÁ½¸ÿÀ½¸ÿÀ½¸ÿÀ½¹ÿÀ½¹ÿÀ½¹ÿ¾½¹ÿ¾½¹ÿ¼½¹ÿ½¾ºÿ¿À¼ÿ¾Â½ÿ¿ÂÀÿ½ÂÀÿ¼ÁÀÿºÀ¿ÿ¾ÃÄÿ½ÄÇÿ½ÄÇÿ¼ÅÉÿ¾ÇËÿ¿ÈÌÿÀÈÏÿ¿ÉÐÿÁÈÑÿ¾ÇÑÿ¾ÄÏÿ»ÄÎÿ½ÃÎÿ»ÄÎÿ¼ÅÏÿ¼ÅÏÿ¹ÂÌÿºÃÍÿ¼ÅÏÿ¾ÇÑÿ¿ÈÒÿ¿ÈÒÿ¿ÈÒÿ¾ÇÑÿÃÍ×ÿÀÊÔÿ½ÆÓÿ»ÅÏÿ¼ÅÒÿ¼ÆÐÿ¼ÅÒÿ¼ÆÐÿºÂÏÿºÃÍÿ¼ÄÑÿ½ÆÐÿ½ÅÒÿ¼ÅÏÿ»ÃÐÿ»ÄÎÿ¶¿Éÿ¸ÁÊÿºÃÌÿ¹ÂËÿ¸¿Èÿ¶½Æÿ·¾Çÿ¸¿Èÿ¸¿Èÿ¹ÀÉÿ»ÀÉÿ»ÀÉÿ»ÀÉÿº¿Èÿ¹¾Çÿ¹¾Çÿ½ÃÊÿºÂÉÿºÀÇÿ·¿Æÿ¸ÀÇÿºÂÉÿ½ÅÌÿ¿ÇÎÿ¿ÇÎÿ¾ÆÍÿ¾ÆÍÿ½ÅÌÿ¼ÄËÿ¼ÄËÿ»ÃÊÿ½ÃÈÿ¼ÂÇÿ¾ÂÇÿ½ÁÆÿ½ÁÆÿ¼ÀÅÿ¼ÀÅÿ¼ÀÅÿ»¿ÄÿÀÄÉÿ¾ÂÇÿ½ÁÆÿ½ÁÆÿ¿ÃÈÿ¿ÃÈÿ¾ÂÇÿ¼ÀÅÿÂÆËÿ¾ÄÉÿ¾ÂÇÿ¼ÂÇÿ¾ÂÇÿ¼ÂÇÿ½ÁÆÿºÀÅÿ½ÁÆÿ½ÁÆÿ½ÁÆÿ¾ÂÇÿ¾ÂÇÿ¾ÂÇÿ¾ÂÇÿ¾ÂÇÿÂº­ÿÃ»®ÿÂ¼¯ÿÃ½°ÿÃ½²ÿÃ½²ÿÁ¼³ÿÂ½´ÿÀ½µÿÀ½µÿÁ½¸ÿÀ½¸ÿÀ½¹ÿÁ¾ºÿÁ¾ºÿ¿¾ºÿÃÂ¾ÿÂÂ¼ÿÀ¿»ÿ¾¿»ÿ¾¿»ÿ¿ÂÀÿÂÅÃÿÂÇÆÿÂÇÆÿÂÆÇÿÂÇÈÿÂÇÈÿ¿ÇÇÿ¾ÅÈÿ½ÄÇÿ½ÃÈÿ¾ÄÉÿ¾ÄËÿ¾ÄËÿ¾ÄËÿ¾ÄËÿ¿ÅÌÿ¿ÅÌÿÀÆÍÿÁÇÎÿÁÇÎÿÁÇÎÿÁÇÎÿÁÇÎÿÀÆÍÿ¾ÄËÿ¼ÄËÿ¿ÆÏÿ¼ÅÎÿ»ÄÍÿºÃÌÿ¼ÅÎÿ½ÆÏÿ¾ÇÐÿ¾ÇÐÿ¿ÆÏÿ¿ÆÏÿ¿ÆÏÿ¿ÆÏÿ¾ÅÎÿ¾ÅÎÿ½ÄÍÿ½ÅÌÿ»ÁÈÿ½ÃÊÿ¾ÄËÿ½ÃÊÿ½ÀÈÿ¼¿Çÿ¼¿Çÿ½ÀÈÿ½ÀÈÿ½ÀÈÿ¿ÁÉÿ¿ÁÉÿ¾ÀÈÿ¾ÀÈÿ½¿Çÿ½ÀÅÿ¾ÃÆÿ¾ÃÆÿ¾ÃÆÿ¾ÃÆÿ¾ÃÆÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÁÂÿ¿ÁÂÿ¿ÁÂÿ¿ÁÂÿ¿ÁÂÿ¿ÁÂÿÀÂÃÿÀÂÃÿ¾ÀÁÿ¿ÁÂÿÀÂÃÿÀÂÃÿÁÃÄÿÂÄÅÿÂÄÅÿÃÅÆÿ¾ÂÃÿ¾ÂÃÿ¾ÂÃÿ¿ÃÄÿÁÅÆÿÂÆÇÿÂÆÇÿÂÆÇÿÀÄÅÿÀÄÅÿÀÄÅÿÀÄÅÿÀÄÅÿÀÄÅÿÀÄÅÿÀÄÅÿÂ½®ÿÂ½®ÿÂ¼¯ÿÂ¼¯ÿÃ½°ÿÃ½°ÿÀ¼±ÿ¿»°ÿÂ½´ÿÀ¾´ÿÁ¾¶ÿÁ¾¶ÿÂ¾¹ÿÃ¿ºÿÃ¿ºÿÃÀ»ÿÆÃ¾ÿÅÃ»ÿÃÀ»ÿÃÀ»ÿÄÁ¼ÿÅÄÀÿÈÇÃÿÈÉÇÿÄÅÃÿÂÄÄÿÃÅÅÿÂÄÄÿ¿ÄÃÿ¾ÂÃÿ½ÁÂÿ¼ÀÁÿ½ÁÂÿ¾ÂÃÿÀÄÅÿÁÅÆÿÂÆÇÿÂÆÇÿÂÆÇÿÂÆÇÿÅÉÊÿÅÉÊÿÄÈÉÿÃÇÈÿÂÆÇÿÁÅÆÿÀÄÅÿ¾ÃÄÿ¿ÄÇÿ¾ÅÈÿ¿ÆÉÿ¿ÆÉÿ¿ÆÉÿÀÇÊÿÃÈËÿÄÉÌÿÄÉÌÿÄÉÌÿÂÇÊÿÁÆÉÿÁÆÉÿÀÅÈÿÁÄÈÿÁÄÈÿ¿ÂÆÿÁÅÆÿÂÆÇÿÁÅÆÿÀÄÅÿ¿ÃÄÿÁÃÄÿÁÃÄÿÁÃÄÿÁÃÄÿÂÄÅÿÂÄÅÿÃÂÄÿÃÂÄÿÂÁÃÿÂÁÃÿ¿ÁÁÿÀÂÂÿÂÄÄÿÃÅÅÿÃÅÅÿÁÃÃÿ¿ÁÁÿ½¿¿ÿ¾ÀÀÿ¾ÀÀÿ¾ÀÀÿ¿ÁÁÿÀÂÂÿÀÂÂÿÁÃÃÿÁÃÃÿÁ¿¾ÿÂÀ¿ÿÂÀ¿ÿÃÁÀÿÃÁÀÿÄÂÁÿÄÂÁÿÄÂÁÿÁ¿¾ÿÃÁÀÿÄÂÁÿÄÂÁÿÄÂÁÿÄÂÁÿÅÃÂÿÇÅÄÿÀÁ¿ÿÁÂÀÿÃÄÂÿÄÅÃÿÅÆÄÿÆÇÅÿÇÈÆÿÈÉÇÿÅÆÄÿÅÆÄÿÅÆÄÿÄÅÃÿÄÅÃÿÄÅÃÿÄÅÃÿÅÆÄÿÁ¼­ÿÁ¼­ÿÀº­ÿÁ»®ÿÃ½°ÿÃ½°ÿÀ¼±ÿ¾º¯ÿÂ½´ÿÂ½´ÿÃ¾µÿÂ¿·ÿÅ¿¸ÿÃÀ¸ÿÆÀ»ÿÆÀ¹ÿÅ¿¸ÿÆÁ¸ÿÈÃºÿÉÄ»ÿÈÅ½ÿÇÄ¼ÿÅÂ½ÿÄÁ¼ÿÀ¿»ÿÀ¿»ÿ¿¾ºÿÀ¿»ÿ¾¿½ÿ¿À¾ÿÀÁ¿ÿÁÂÀÿ¿À¾ÿÁÂÀÿÃÄÂÿÅÆÄÿÆÇÅÿÅÆÄÿÄÅÃÿÄÅÃÿÄÅÃÿÄÅÃÿÄÅÃÿÅÆÄÿÅÆÄÿÅÆÄÿÅÆÄÿÅÆÄÿÄÇÅÿÃÈÆÿÄÉÈÿÃÈÆÿÃÅÅÿÁÄÂÿÁÃÃÿÂÅÃÿÄÆÆÿÃÆÄÿÁÃÃÿÀÃÁÿÁÁÁÿÁÂÀÿÂÂÂÿÃÄÂÿÃÄÂÿÃÄÂÿÄÅÃÿÄÅÃÿÃÄÂÿÃÄÂÿÄÂÁÿÄÂÁÿÄÂÁÿÄÂÁÿÅÃÂÿÅÃÂÿÆÂÁÿÆÂÁÿÅÁÀÿÄÁ½ÿÂÁ½ÿÃÃ½ÿÄÃ¿ÿÅÅ¿ÿÄÃ¿ÿÂÂ¼ÿ¿¾ºÿ¾¾¸ÿ¾½¹ÿ¿¿¹ÿ¿¾ºÿÀÀºÿÀ¿»ÿÁÁ»ÿÁÀ¼ÿÁÁ»ÿÃ¿ºÿÃ¿ºÿÃ¿ºÿÃ¿ºÿÄÀ»ÿÄÀ»ÿÄÀ»ÿÄÀ»ÿÅÁ¼ÿÅÁ¼ÿÆÂ½ÿÅÁ¼ÿÄÀ»ÿÃ¿ºÿÄÀ»ÿÅÁ¼ÿÃÀ»ÿÅÂ½ÿÆÃ¾ÿÆÃ¾ÿÅÂ½ÿÄÁ¼ÿÅÂ½ÿÅÂ½ÿÇÄ¿ÿÇÄ¿ÿÆÃ¾ÿÆÃ¾ÿÅÂ½ÿÅÂ½ÿÆÃ¾ÿÆÃ¾ÿÀ»¬ÿ¿º«ÿ¿º«ÿÁ¼­ÿÃ¾¯ÿÃ¾¯ÿÂ¼¯ÿÁ»®ÿÄ¾³ÿÄ¾³ÿÅ¿´ÿÃ¾µÿÆ¿¶ÿÅÀ·ÿÇ¿¸ÿÇÀ·ÿÇ¾´ÿÈ¿µÿÉÀ¶ÿÉÀ¶ÿÇÀ·ÿÆ¿¶ÿÂ¼µÿÁ»´ÿÂ¼µÿÁ»´ÿ½¹´ÿ½¹´ÿ¾ºµÿÁ½¸ÿÃÀ¼ÿÅÂ½ÿÂ¾¹ÿÄÁ¹ÿÆÃ»ÿÇÄ¼ÿÇÄ¼ÿÆÃ»ÿÅÂºÿÄÁ¹ÿÃÀ¸ÿÃÀ¸ÿÄÁ¹ÿÅÂºÿÆÃ»ÿÇÄ¼ÿÇÄ¼ÿÇÅ½ÿÅÆ½ÿÆÇ¾ÿÆÆÀÿÅÆ½ÿÄÁ¼ÿÂÀ¸ÿÁ¾¹ÿÁ¿·ÿÂ¿ºÿÂÀ¸ÿÁ¾¹ÿÀ¾¶ÿÁ½¸ÿÂ¿·ÿÃ¿ºÿÄÁ¹ÿÃÀ¸ÿÃÀ¸ÿÄÁ¹ÿÄÁ¹ÿÄÁ¹ÿÄÁ¹ÿÃÀ¸ÿÂ¿·ÿÂ¿·ÿÃÀ¸ÿÅ¿¸ÿÅ¿¸ÿÅ¿¸ÿÄ¾·ÿÃ½¶ÿÃ½¶ÿÃÁ·ÿÃÁ¶ÿÃÁ·ÿÂÀµÿÁ¿µÿÀ¾³ÿ¿½³ÿ¿½²ÿÀ¾´ÿÀ¾³ÿÀ¾´ÿÀ¾³ÿÀ¾´ÿÀ¾³ÿ¿½³ÿ¿½²ÿÄ¾³ÿÄ¾³ÿÃ½²ÿÃ½²ÿÃ½²ÿÂ¼±ÿÂ¼±ÿÂ¼±ÿÅ¿´ÿÄ¾³ÿÃ½²ÿÃ½²ÿÄ¾³ÿÄ¾³ÿÃ½²ÿÂ¼±ÿÁ½²ÿÃ¿´ÿÄÀµÿÃ¿´ÿÁ½²ÿÀ¼±ÿÀ¼±ÿÀ¼±ÿÄÀµÿÃ¿´ÿÂ¾³ÿÂ¾³ÿÂ¾³ÿÂ¾³ÿÂ¾³ÿÃ¿´ÿ¾¹ªÿ¾¹ªÿ¿º«ÿÀ»¬ÿÂ½®ÿÂ½®ÿÂ¼¯ÿÁ»®ÿÃ½°ÿÃ½²ÿÃ½²ÿÄ¾³ÿÆ½³ÿÄ¾³ÿÆ½´ÿÆ½³ÿÉÀ³ÿÇ¾°ÿÄ»®ÿÂ¹¬ÿÂ¹¬ÿÂº­ÿÄ»±ÿÄ¾³ÿÇ¾´ÿÃ½²ÿÁº±ÿ¿¸¯ÿ¿¸¯ÿ¿º±ÿÂ¼µÿÅÀ·ÿÃ¼³ÿÄ¾³ÿÅ¿´ÿÆÀµÿÆÀµÿÅ¿´ÿÃ½²ÿÂ¼±ÿÃ½²ÿÃ½²ÿÄ¾³ÿÄ¾³ÿÄ¾³ÿÄ¾³ÿÃ½²ÿÁ½²ÿÀ¾³ÿÀ¾³ÿÂ¾³ÿÁ½²ÿÁ½²ÿÀ¼±ÿÀ¼±ÿÁ½²ÿ¿»°ÿ¿»°ÿÁ»°ÿÁ»°ÿÁ»°ÿÂ¼±ÿÂ¼±ÿÃ½²ÿÂ¼±ÿ¿»°ÿÁ»°ÿÂ¼±ÿÃ½²ÿÃ½²ÿÂ¼±ÿÁ»°ÿÁ»°ÿÁ»°ÿÂ¼±ÿÂ¼±ÿÃº°ÿÁ»°ÿÂ¹¯ÿÀº¯ÿÃ½°ÿÂ½®ÿÁ¼­ÿÀ»¬ÿÀ»¬ÿÀ»¬ÿÁ¼­ÿÂ½®ÿÂ½®ÿÂ½®ÿÂ½®ÿÁ¼­ÿÁ¼­ÿÀ»¬ÿÀ»¬ÿÀ»¬ÿÂ»¬ÿÁº«ÿÂ¹«ÿÀ¹ªÿÁ¸ªÿ¿¸©ÿÀ·©ÿ¿¸©ÿÁ¸ªÿ¾·¨ÿ¿¶¨ÿ¿¸©ÿÃº¬ÿÃ¼­ÿÃº¬ÿÁº«ÿ¾·¨ÿ½¸©ÿÀ¹ªÿ¾¹ªÿÀ¹ªÿ¾¹ªÿÀ¹ªÿ¿º«ÿÁº«ÿ¿º«ÿÀ¹ªÿ½¸©ÿ¿¸©ÿ¾¹ªÿÀ¹ªÿÁ¹¬ÿ¿»©ÿ¿»©ÿÁ½«ÿÁ½«ÿÃ¼«ÿÂ»ªÿÂ»¬ÿÂ»¬ÿÄ½®ÿÃ»®ÿÃ»®ÿÃ»®ÿÄ»®ÿÂº­ÿÃ¹¯ÿÃº­ÿÆ½¯ÿÆ¼«ÿÄ¹«ÿÂ·©ÿÂ·©ÿÂ¹«ÿÄ»®ÿÅ½°ÿÅ¼¯ÿÃ»®ÿÂ¹¯ÿÂ¹¯ÿÁ¸®ÿÀº¯ÿÁ»°ÿÁ»®ÿÂº­ÿÂ»¬ÿÃ¼­ÿÃ¼­ÿÃ¼­ÿÃ¼­ÿÂ»¬ÿÂ»¬ÿÂ»¬ÿÂ»¬ÿÂ»¬ÿÃ¼­ÿÂ»¬ÿÁº«ÿÀ¹ªÿ¿¸©ÿÀº­ÿ½º¬ÿ¾¸«ÿ¾¸«ÿ¿¹¬ÿÀº­ÿÁ»®ÿÁ»®ÿ¿¹¬ÿ¿¹¬ÿÂº­ÿÂº­ÿÂº­ÿÁ¹¬ÿÁ¹¬ÿÀ¸«ÿÁº«ÿ¾¹ªÿÀ¹ªÿÁº«ÿÃ¼­ÿÃ¼­ÿÂ»¬ÿÀ¹ªÿÁº«ÿÁº«ÿÁº«ÿÁº«ÿÂ¹«ÿÁº«ÿÁ¸ªÿ¿¸©ÿÀ¹¨ÿÀ¹¨ÿ¿¸§ÿ¿¸§ÿ¿¸§ÿÀ¹¨ÿÁº©ÿÂ»ªÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÁº©ÿÀ¹¨ÿÁ¹¨ÿÀ¸§ÿÀ¸§ÿÂ¸§ÿÀ¸§ÿÂ¸§ÿÀ¸§ÿÂ¸§ÿ¿·¦ÿÀ¶¥ÿ¾¶¥ÿÀ¶¥ÿ¿·¦ÿÃ¹¨ÿÁ¹¨ÿÄº©ÿÂº©ÿ¿·¦ÿ½¶¥ÿ¾¶¥ÿ¾·¦ÿÀ¸§ÿÀ¹¨ÿÂº©ÿÁº©ÿÀ¸§ÿ¿¸§ÿ¿·¦ÿ½¶¥ÿ¾¶¥ÿ¾·¦ÿÀ¸§ÿÁ¹¨ÿ¿»©ÿÁ½«ÿÂ¾¬ÿÁ½«ÿÂ»ªÿÀ¹¨ÿÀ¹ªÿÁº«ÿÂ»¬ÿÂ»¬ÿÃº¬ÿÂ¹¬ÿÁ¸«ÿÁ¸«ÿÀ·ªÿÀ·©ÿÁ·¦ÿÂ¸§ÿÄº©ÿÆ¼«ÿÇ½¬ÿÆ¼«ÿÄ¼«ÿÃ»ªÿ¿¶¨ÿÀ·©ÿÂ¹«ÿÃº¬ÿÂº­ÿÂ»¬ÿÁ¹¬ÿÀ¹ªÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÂº©ÿÃ»ªÿÃ»ªÿÃ»ªÿÄ¼«ÿÀ¸§ÿÁ¹¨ÿÂº©ÿÃ»ªÿÃ»ªÿÂº©ÿÁ¹¨ÿÀ¸§ÿÅ¾¯ÿÀ»¬ÿÀ¹ªÿ¿¸©ÿÀ¹ªÿÂ»¬ÿÃ¼­ÿÃ¼­ÿÁº«ÿÂ»¬ÿÃº¬ÿÃº¬ÿÃº¬ÿÁ¸ªÿ¿¶¨ÿ¾µ§ÿÂ»ªÿÀ¹¨ÿ¿¸§ÿÁº©ÿÄ¼«ÿÅ½¬ÿÃ»ªÿÁ¹¨ÿÂº©ÿÂº©ÿÃ»ªÿÃ»ªÿÃ»ªÿÂº©ÿÁ¹¨ÿÁ¹¨ÿ½¶£ÿ¾·¤ÿ¾·¤ÿ¿¸¥ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÁº§ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÃ¹§ÿÃ¹§ÿÄº¨ÿÄº¨ÿÄº¨ÿÃ¹§ÿÄº¨ÿÅ»©ÿÄº¨ÿÂ¸¦ÿÁ·¥ÿÂ¸¦ÿÃ¹§ÿÃ¼©ÿÂ»¨ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÃ¼©ÿÃ¼©ÿÂ»¨ÿÂ»¨ÿÁº§ÿÀ¹¦ÿÀ¹¦ÿÀ¹¦ÿÁº§ÿÂ»¨ÿÃ¼©ÿ¾ÂÇÿ¾ÃÆÿÀÃÈÿÀÃÇÿÀÃÈÿÁÄÈÿÁÄÉÿÁÄÈÿÂÅÊÿ¾ÁÅÿ¼¿Ãÿ¿ÂÆÿ¿ÂÆÿ¼¿Ãÿ½ÀÄÿÁÄÈÿ¿ÂÆÿÀÃÇÿÁÄÈÿÀÃÇÿ¿ÂÆÿ½ÀÄÿ½ÀÅÿ¾ÁÆÿÅÈÍÿÁÅÊÿ¿ÃÈÿ¾ÂÇÿ¿ÃÈÿÀÄÉÿÁÅÊÿÀÄÉÿ¿ÅÌÿÀÆÍÿÁÇÎÿÁÇÎÿÁÇÎÿÁÇÎÿÀÆÍÿ½ÅÌÿÁÇÎÿ¾ÇËÿ½ÅÌÿ¼ÅÉÿ¼ÄËÿ¼ÅÉÿ½ÅÌÿ¿ÅÊÿÀÂÊÿÁÄÉÿÄÃÌÿÄÇÌÿÄÆÎÿÃÆËÿÁÄÌÿÀÄÉÿ¿ÅÌÿÀÆÍÿÀÆÍÿ¾ÆÍÿ¾ÄËÿ»ÃÊÿ¼ÄËÿ½ÅÌÿ¿ÇÎÿ½ÇÎÿ¿ÇÎÿ¿ÇÎÿ¿ÇÎÿ¾ÆÍÿ½ÆÊÿ¼ÅÉÿ¼ÂÇÿ¾ÅÈÿ¿ÄÇÿ¾ÂÃÿÀÂÃÿÂÄÄÿÂÂÂÿ¾¾¾ÿÀÀÀÿÀÀÀÿÁ¿¿ÿÁ¿¾ÿÃ¿¾ÿÂ¿»ÿÂ½ºÿÂ¾¹ÿÅ¿ºÿÄ¾·ÿÄ½´ÿÃ¼³ÿÄ»±ÿÄ»±ÿÅ»±ÿÅ»±ÿ¿·ªÿÀ¸«ÿÂº­ÿÄ»®ÿÄ»®ÿÄ»­ÿÂ¹«ÿÁ¸ªÿÂ·©ÿÂ¸§ÿÂ¸§ÿÃ¶¦ÿÃ¶¦ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÁµ£ÿÀ¶¤ÿÂ¶¤ÿÂ¶¤ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÄµ¥ÿÄµ¥ÿÅ¶¦ÿÃ¶¦ÿÅÇÈÿÄÆÇÿÃÅÆÿÂÄÅÿÁÃÄÿÀÂÃÿ¿ÁÂÿ¾ÀÁÿÁÃÄÿ¾ÀÁÿ½¿ÀÿÀÂÃÿÁÃÄÿ¾ÀÁÿ¿ÁÂÿÃÅÆÿ¿ÁÂÿÀÂÃÿÂÄÅÿÁÃÄÿÀÂÃÿ¿ÁÂÿÀÂÃÿÀÂÃÿÂÄÅÿÂÄÅÿÂÄÅÿÂÄÅÿÂÄÅÿÂÄÅÿÁÃÄÿ¾ÂÃÿ¿ÂÆÿ¾ÃÆÿ¾ÃÆÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¿ÄÇÿ¾ÃÆÿ½ÂÅÿ¾ÃÆÿ¾ÃÆÿ¿ÄÇÿÀÅÈÿÀÅÈÿÁÆÉÿÂÅÉÿÃÄÈÿÅÄÈÿÄÂÈÿÄÂÈÿÄÂÈÿÁÁÇÿÁÁÇÿ¿ÂÇÿÁÄÉÿÀÄÉÿÁÄÌÿ¿ÅÌÿ¾ÄËÿ¾ÄËÿ¿ÅÌÿ½ÅÌÿ¿ÇÎÿ¿ÇÎÿ¿ÇÎÿ¿ÇÎÿ¿ÇÎÿ¾ÆÍÿ½ÆÊÿ¼ÅÉÿ½ÄÇÿ¾ÅÈÿ¿ÄÅÿ¾ÂÃÿÁÃÃÿÃÅÅÿÃÄÂÿ¿À¾ÿ¿À¾ÿ¿À¾ÿÁ¿¾ÿÀ¿»ÿÂ¿»ÿÁ¾¹ÿÂ¾¹ÿÁ¾¶ÿÃ½¶ÿÂ½´ÿÃ½²ÿÁ»°ÿÂº­ÿÂº­ÿÃº­ÿÄ»®ÿÁ¸ªÿÁ¸ªÿÂ¹«ÿÃº¬ÿÄ»­ÿÃº¬ÿÃ»ªÿÂº©ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÁ·¦ÿÁ·¥ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÀ¶¤ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÂ¶¤ÿÂ¶¤ÿÄ¶¤ÿÄ¶¤ÿÅ·¥ÿÃ·¥ÿÉÇÆÿÈÆÅÿÇÅÄÿÅÃÂÿÄÂÁÿÂÀ¿ÿÁ¿¾ÿÀ¾½ÿÂÀ¿ÿÀ¾½ÿÁ¿¾ÿÄÂÁÿÅÃÂÿÄÂÁÿÄÂÁÿÆÄÃÿÂÀ¿ÿÃÁÀÿÄÂÁÿÄÂÁÿÃÁÀÿÃÁÀÿÃÁÀÿÄÂÁÿÁ¿¾ÿÃÁÀÿÄÂÁÿÅÃÂÿÄÂÁÿÃÁÀÿÁ¿¾ÿ¿À¾ÿÀÀÀÿ¾ÀÀÿ¾ÀÀÿ¾ÀÀÿ¾ÀÀÿ¿ÁÁÿ¿ÁÁÿÀÂÂÿ¿ÁÁÿÀÂÂÿÁÃÃÿÁÃÃÿÂÄÄÿÂÄÄÿÂÄÄÿÁÃÃÿÅÄÆÿÆÃÅÿÅÁÆÿÁÀÄÿÁÀÄÿ¿ÀÄÿÀÁÅÿ¿ÂÆÿÀÃÇÿ¿ÄÇÿ¿ÃÈÿ¿ÃÈÿÀÄÉÿ¿ÅÊÿ¿ÅÊÿ¿ÅÊÿ½ÆÊÿ½ÆÊÿ½ÆÊÿ½ÆÊÿ¾ÇËÿ¾ÇËÿ¾ÄÉÿ¾ÄÉÿ½ÄÇÿ¾ÅÈÿ¿ÄÅÿ¾ÂÃÿÁÃÃÿÃÆÄÿÃÄÂÿ¿À¾ÿÀ¾½ÿÀ¿»ÿÁ¾ºÿÁ¾ºÿÀ½¹ÿÀ½¸ÿÀ¼·ÿÂ¼µÿÃ¼³ÿÂ¼±ÿÂ¹¯ÿÁ¹¬ÿÁ¸«ÿÁ¸«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÃº¬ÿÃ»ªÿÃ»ªÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÀ¶¤ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÁ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÅ·¥ÿÃ·¥ÿÅÁ¼ÿÅÁ¼ÿÅÁ¼ÿÅÁ¼ÿÅÁ¼ÿÅÁ¼ÿÅÁ¼ÿÄÀ»ÿÃ¿ºÿÃ¿ºÿÅÁ¼ÿÇÃ¾ÿÇÃ¾ÿÆÂ½ÿÆÂ½ÿÆÂ½ÿÃ¿ºÿÅÁ¼ÿÅÁ¼ÿÅÁ¼ÿÃ¿ºÿÃ¿ºÿÃ¿ºÿÄÀ»ÿÀ¼·ÿÂ¾¹ÿÃ¿ºÿÃ¿ºÿÂ¾¹ÿÀ¼·ÿÀ¼·ÿÀ½¸ÿÂ¿»ÿÀ¿»ÿ¿¾ºÿ¿¾ºÿ¿¾ºÿÀ¿»ÿÂÁ½ÿÃÂ¾ÿÄÃ¿ÿÃÂ¾ÿÂÁ½ÿÀ¿»ÿÀ¿»ÿ¿¾ºÿÀ¿»ÿÀ¿»ÿÃ¾¿ÿÃ¾¿ÿÃ¾¿ÿÁ¿¿ÿÂ¿ÁÿÁÀÂÿÂÁÃÿÁÃÄÿÃÅÆÿÀÃÇÿ¿ÂÆÿ¾ÃÆÿÀÄÉÿÁÅÊÿÁÅÊÿ¾ÄÉÿ½ÃÈÿ»ÄÈÿ»ÄÈÿ¼ÅÉÿ¼ÅÉÿ¼ÅÉÿ½ÃÈÿ¼ÃÆÿ¼ÃÆÿÀÅÆÿÀÄÅÿ¾ÃÂÿÁÄÂÿÃÆÄÿÃÄÂÿ¿À¼ÿ¿¾ºÿÁ¾¹ÿÀ½¸ÿ¿¼·ÿ¿¼·ÿ¿¼´ÿÁ»´ÿÁ¼³ÿÁ»°ÿÀº­ÿÁ¹¬ÿÀ¸«ÿÁ¸«ÿÀ·©ÿÁ¸ªÿÁ¸ªÿÃº¬ÿÂ¹«ÿÁ¸ªÿÁ¸ªÿÁ¸ªÿÂ¹«ÿÃ»ªÿÄ¼«ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÁ·¥ÿÂ¶¤ÿÂ¶¤ÿÃ·¥ÿÃ·¥ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÅ·¥ÿÃ·¥ÿÂ»²ÿÂ»²ÿÃ¼³ÿÃ¼³ÿÄ½´ÿÅ¾µÿÅ¾µÿÅ¾µÿÅ¾µÿÆ¿¶ÿÇÀ·ÿÇÀ·ÿÇÀ·ÿÇÀ·ÿÆ¿¶ÿÄ½´ÿÅ¿´ÿÅ¿´ÿÅ¿´ÿÄ¾³ÿÂ¼±ÿÁ»°ÿÁ»°ÿÂ¼±ÿÂ¼±ÿÃ½²ÿÃ½²ÿÁ»°ÿÀº¯ÿÀº¯ÿÁ»°ÿÁ½²ÿÁ¼³ÿ¿½³ÿ¾¼²ÿ¾¼²ÿ¾¼²ÿÀ¾´ÿÁ¿µÿÂÀ¶ÿÂÀ¶ÿÀ¾´ÿ½»±ÿ»¹¯ÿº¸®ÿ»¹¯ÿ½»±ÿ¾»³ÿ»¶³ÿ½¸·ÿÀ»ºÿÂ¾½ÿÅÀÁÿÄÂÂÿÄÂÂÿÂÂÂÿÅÅÅÿÂÄÅÿÀÂÃÿ¾ÂÃÿÀÃÇÿÁÄÈÿÁÄÈÿ¿ÄÇÿ¿ÄÇÿ½ÄÇÿ½ÄÇÿ¾ÅÈÿ¾ÅÈÿ¾ÅÈÿ½ÄÇÿ¼ÃÆÿ¾ÃÆÿ¿ÄÅÿ¿ÃÄÿ½ÂÁÿÀÃÁÿÄÅÃÿÂÃ¿ÿÀ¿»ÿÀ½¸ÿÁ¾¶ÿÀ½µÿ¿¼´ÿ¾»³ÿÀ»²ÿÀ»²ÿÂ¼±ÿÂ¹¯ÿÂº­ÿÂ¹¬ÿÁ¸ªÿÁ¸ªÿÁ¹¨ÿÃ¹¨ÿÃ¹¨ÿÃº¬ÿÂ¹«ÿÁ¸ªÿÁ¸ªÿÁ¸ªÿÂ¹«ÿÄ¼«ÿÄ¼«ÿÂº©ÿÂº©ÿÂº©ÿÂº©ÿÄº©ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÄº¨ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÁ·¥ÿÃ·¥ÿÂ¶¤ÿÄ¸¦ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÃ·¥ÿÄ¸¦ÿÁ¹¬ÿÁ¹¬ÿÂ¸®ÿÁ¹¬ÿÂ¸®ÿÁ¹¬ÿÂ¸®ÿÁ¹¬ÿÄº°ÿÅ½°ÿÆ¼²ÿÃ»®ÿÄº°ÿÄ¼¯ÿÅ»±ÿÁ¹¬ÿÄ»®ÿÃ¼­ÿÄ»­ÿÁº«ÿÀ·©ÿ¾·¨ÿÀ·©ÿ¿¸©ÿÄ»­ÿÃ¼­ÿÂ¹«ÿÀ¹ªÿÀ·©ÿÀ¹ªÿÂ¹«ÿÃ¼­ÿ¾¸«ÿ¾¸«ÿ¾¸«ÿ¾¸«ÿ¿¹¬ÿ¿¹¬ÿÀº­ÿÀº­ÿÁ»®ÿ¿¹¬ÿ½·ªÿ¼¶©ÿ¼¶©ÿ¾¸«ÿÁ»®ÿÃ½²ÿ»µ®ÿ¾¸³ÿÂ¼·ÿÅÁ¼ÿÈÃÀÿÈÅÁÿÈÅÁÿÅÃÂÿÆÄÃÿÃÃÃÿÂÂÂÿÀÂÂÿÁÃÄÿÀÄÅÿÃÅÆÿÁÅÆÿÂÅÉÿÁÆÇÿÁÆÉÿ¿ÇÇÿÂÇÊÿÀÈÈÿÀÅÈÿÀÅÆÿ¾ÃÄÿÀÅÄÿ¿ÄÃÿ¿ÂÀÿÁÂÀÿÃÄÀÿÁÂ¾ÿ¾¾¸ÿÁ¾¶ÿÀ¾´ÿ¿½³ÿÀ¼±ÿ¿º±ÿ¿»°ÿÂ¼±ÿÂ¼¯ÿÂº­ÿÂ»¬ÿÃº¬ÿÂº©ÿÂº©ÿÂº©ÿÄº©ÿÄº©ÿÃº¬ÿÂ¹«ÿÂ¹«ÿÁ¸ªÿÂ¹«ÿÂ¹«ÿÃ»ªÿÄ¼«ÿÂº©ÿÂº©ÿÂº©ÿÂº©ÿÄº©ÿÄº©ÿÄº©ÿÄº©ÿÄº¨ÿÄº¨ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÃ·¥ÿÃ·¥ÿÅ¹§ÿÄ¸¦ÿÄ¸¦ÿÃ·¥ÿÃ·¥ÿÄ¸¦ÿÄ¸¦ÿÅ¹§ÿÂ¹«ÿÂ¹«ÿÃ·«ÿÁ¸ªÿÃ·«ÿÀ·©ÿÂ¶ªÿÀ·©ÿÂ¶ªÿÃº¬ÿÅ¹­ÿÀ·©ÿÂ¶ªÿÃº¬ÿÆº®ÿÁ¸ªÿÃ¹¨ÿÂº©ÿÄº©ÿÁ¹¨ÿÁ·¦ÿ¿·¦ÿÂ¸§ÿÁ¹¨ÿÅ»ªÿÂº©ÿÃ¹¨ÿÁ¹¨ÿÃ¹¨ÿÁ¹¨ÿÃ¹¨ÿÁ¹¨ÿÀ·©ÿÀ¹ªÿÀ¹ªÿÁº«ÿÁº«ÿÁº«ÿÀ¹ªÿÀ¹ªÿÁº«ÿÁº«ÿÁº«ÿÁº«ÿÂ»¬ÿÃ¼­ÿÄ½®ÿÄ¼¯ÿÀ¹°ÿÂº³ÿÅ½¶ÿÆÀ¹ÿÉÃ¾ÿÈÄ¿ÿÉÅÀÿÈÅÁÿÅÂ¾ÿÃÁÀÿÃÁÀÿÂÃÁÿÂÂÂÿÂÄÄÿÆÆÆÿÆÈÈÿÄÈÉÿÄÉÈÿÄÈÉÿÃÉÈÿÄÈÉÿÂÈÇÿÂÆÇÿÁÆÅÿÀÅÄÿÃÅÅÿÂÄÄÿÁÂÀÿÁÂÀÿÄÃ¿ÿÂÁ½ÿÀ½¸ÿÀ¾´ÿÂ¾³ÿÁ½²ÿÁ»®ÿÁ»°ÿÁ»®ÿÃ»®ÿÄ½®ÿÃº¬ÿÃº¬ÿÃº¬ÿÃ»ªÿÄº©ÿÄº¨ÿÄº¨ÿÄº©ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÃº¬ÿÃº¬ÿÃº¬ÿÁ¸ªÿÁ¸ªÿÁ¹¨ÿÂº©ÿÂº©ÿÂº©ÿÂº©ÿÂº©ÿÄº¨ÿÄº¨ÿÄº¨ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÂ¸¦ÿÃ¹§ÿÃ¹§ÿÄ¸¦ÿÄ¸¦ÿÄ¸¦ÿÄ¸¦ÿÅ¹§ÿÅ¹§ÿÄ¹«ÿÄ¹«ÿÄ¹«ÿÄ¹«ÿÄ¹«ÿÄ¹«ÿÅº¬ÿÅº¬ÿÁ¶¨ÿÄ¹«ÿÃ¸ªÿÀµ§ÿÁ¶¨ÿÆ»­ÿÇ¼®ÿÅ»ªÿÃ¹¨ÿÄº¨ÿÄº¨ÿÄº¨ÿÃ¹§ÿÄº¨ÿÅ»©ÿÇ½«ÿÄº¨ÿÃ¹§ÿÃ¹§ÿÅ»©ÿÆ¼ªÿÅ»©ÿÃ¹§ÿÀ¶¤ÿÂº©ÿÃ»ªÿÄ¼«ÿÅ½¬ÿÅ½¬ÿÄ¼«ÿÃ»ªÿÂº©ÿÂº©ÿÃ»ªÿÄ¼«ÿÅ½¬ÿÅ½¬ÿÄ¼«ÿÂº©ÿÀ·©ÿÃº°ÿÁ»°ÿÂ»²ÿÄ½´ÿÆ¿¶ÿÅ¿¸ÿÇÁºÿÆÂ½ÿÃ¿ºÿÃÀ¼ÿÄÁ½ÿÃÂ¾ÿÄÂÁÿÄÅÃÿÊÈÇÿÊËÉÿÆÉÇÿÆÉÇÿÆÉÇÿÆÉÇÿÆÉÇÿÃÈÆÿÄÆÆÿÃÆÄÿÃÅÅÿÆÇÅÿÅÆÄÿÄÃ¿ÿÃÂ¾ÿÇÄ¿ÿÄÁ¼ÿÁ¾¶ÿÂ¾³ÿÄ¾±ÿÂ¼¯ÿÁ»®ÿÁ»®ÿÁ»®ÿÃ¼­ÿÄ½®ÿÃº¬ÿÃº¬ÿÃ»ªÿÃ»ªÿÅ»©ÿÅ»©ÿÄº¨ÿÄº¨ÿÁ¸ªÿÂ¹«ÿÂ¹«ÿÃº¬ÿÃº¬ÿÃº¬ÿÃº¬ÿÂ¹«ÿÀ·©ÿÀ·©ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÁ¹¨ÿÂº©ÿÄº¨ÿÄº¨ÿÄº¨ÿÃ¹§ÿÃ¹§ÿÃ¹§ÿÂ¸¦ÿÂ¸¦ÿÄº¨ÿÄº¨ÿÅ¹§ÿÅ¹§ÿÅ¹§ÿÅ¹§ÿÆº¨ÿÆº¨ÿÄ·§ÿÁ¶¨ÿÀµ§ÿÁ¶¨ÿÂ·©ÿÂ·©ÿÁ¶¨ÿÀµ§ÿÁ¶¨ÿÀ·©ÿ¿¶¨ÿ¾µ§ÿ¿¶¨ÿÂ¹«ÿÉÀ²ÿÎÆ¹ÿÇ¿¸ÿÅ¿ºÿÇ¾ºÿÅ¿¸ÿÇ¾ºÿÅ¿¸ÿÇ¾ºÿÅ¿¸ÿÆÀ»ÿÈÂ½ÿÊÄ¿ÿËÅÀÿÊÃÀÿÉÂ¿ÿÈÁ¾ÿÇÂ¿ÿÃ¿¾ÿÄÀ¿ÿÅÁÀÿÃ¿¾ÿÀ½¹ÿ¿¼¸ÿÁ¾ºÿÃÀ¼ÿÃ¾»ÿÅÀ½ÿÈÃÀÿÇÃ¾ÿÅÀ½ÿÄÀ»ÿÆÁ¾ÿÆÃ¿ÿÂÀ¿ÿÀÀÀÿÀÀÀÿÁÁÁÿÂÂÂÿÃÃÃÿÅÅÅÿÆÆÆÿÃÃÃÿÀÂÂÿÂÂÂÿ¿ÁÁÿÁÁÁÿÀÂÂÿÂÂÂÿÃÃÃÿÂÃÁÿÂÃÁÿÃÄÂÿÀÃÁÿÁÂÀÿ¾Á¿ÿÂÃÁÿÃÄÂÿÆÇÅÿÃÄÂÿ¾¾¾ÿ¾¼¼ÿ¾¼¼ÿ¿½½ÿÀ¾¾ÿÁ¿¿ÿÄ¿ÀÿÂ½¾ÿ¾¼¼ÿ½»»ÿ»º¼ÿ½¼¾ÿÀ¿ÁÿÂÁÃÿ¿¾ÂÿÂÁÅÿÅÄÆÿÆÅÇÿÅÂÄÿÂ¿ÁÿÁ¾ÀÿÃ¾¿ÿÆ¾¾ÿÈ¼ºÿÅº¶ÿÄ¹µÿÄº³ÿÄ»²ÿÃº±ÿÂ¹°ÿÂ¹°ÿÆ½´ÿÇ¾µÿÄº³ÿÄº³ÿÇ¼¸ÿÇ»·ÿÁ¶²ÿÀ¸±ÿ¾¸±ÿ¿·°ÿ¾¶¯ÿ¾·®ÿ¾·®ÿ¾¸­ÿ¾¸­ÿ»²¨ÿ¾¶©ÿÂ¹¬ÿÃº­ÿÂ¹¬ÿÂ¹¬ÿÂ¹«ÿÃº¬ÿÄ·§ÿÁ·¦ÿÀ¶¥ÿÁ·¦ÿÂ¸§ÿÂ¸§ÿÁ·¦ÿÀ¶¥ÿÁ·¦ÿÁ·¦ÿÀ¶¥ÿ¿µ¤ÿ¾´£ÿÁ·¦ÿÆ¼«ÿÈ¿±ÿÈ¿¶ÿÅ½¶ÿÃ»´ÿÂ»²ÿÃ¼³ÿÄ½´ÿÆ¿¶ÿÇÀ·ÿÃ¾µÿÄ¿¶ÿÆÀ¹ÿÆÀ¹ÿÅ¿ºÿÄ¾¹ÿÅ¿ºÿÆ¿¼ÿÁ¼¹ÿÂ¿»ÿÃ¿¾ÿÃÀ¼ÿÁ¾ºÿÀ½¹ÿÂ¿»ÿÃÀ¼ÿÃ¾»ÿÅÀ½ÿÇÃ¾ÿÇÃ¾ÿÅÁ¼ÿÄÀ»ÿÅÁ¼ÿÆÃ¿ÿÃÁÀÿÂÂÂÿÃÃÃÿÄÄÄÿÄÄÄÿÄÄÄÿÃÃÃÿÃÃÃÿÂÄÄÿÁÃÃÿÀÂÂÿ¿ÁÁÿ¿ÁÁÿ¿ÁÁÿ¿ÁÁÿ¿ÁÁÿÁ¿¾ÿÂÀ¿ÿÁÂÀÿÀÁ¿ÿ¿À¾ÿ¾¿½ÿ¿À¾ÿÀÁ¿ÿ¿À¾ÿ½¾¼ÿ¾¼¼ÿ¿½½ÿÂ½¾ÿÄ¿ÀÿÄ¿ÀÿÄÀ¿ÿÅÁÀÿÅÁÀÿÂÀÀÿÁ¿¿ÿÁ¾Àÿ¿¾ÀÿÀ¿ÁÿÀ¿ÁÿÁÂÆÿÃÄÈÿÈÇÉÿÈÇÉÿÅÄÆÿÂÁÃÿÃÀÂÿÄ¿ÀÿÅ½½ÿÇ»¹ÿÅº¶ÿÅ»´ÿÆ½´ÿÇ¾´ÿÇ¾´ÿÆ½³ÿÄ»±ÿÇ¾´ÿÇ¾µÿÄ»²ÿÄº³ÿÇ¼¸ÿÇ»·ÿÃ¸´ÿ¾¶¯ÿ¼¶¯ÿ¼¶¯ÿ»µ®ÿ¾·®ÿ¾·®ÿ¿¹®ÿÀº¯ÿ¿¶¬ÿÀ¸«ÿÂ¹¬ÿÂ¹«ÿÁ¸ªÿÀ·©ÿÁ¹¨ÿÃ»ªÿÄ·§ÿÁ·¦ÿÀ¶¥ÿÁ·¦ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÀ¶¥ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÀ¶¥ÿ¿µ¤ÿÀ¶¥ÿÂ¸§ÿÂ¹«ÿÄ»±ÿÃº±ÿÂ¹°ÿÁ¸®ÿÁ¸®ÿÃº°ÿÃ½²ÿÄ¾³ÿÁ»°ÿÂ¼±ÿÂ»²ÿÂ»²ÿÁ¹²ÿÁ¹²ÿÃ»´ÿÂ¼·ÿÀ¼·ÿÂ¾¹ÿÄ¿¼ÿÅÁ¼ÿÄÀ»ÿÄÀ»ÿÄ¿¼ÿÅÀ½ÿÃ¾»ÿÅÀ½ÿÇÂ¿ÿÇÂ¿ÿÆÁ¾ÿÅÀ½ÿÆÁ¾ÿÆÃ¿ÿÄÂÁÿÆÄÃÿÇÅÄÿÈÆÅÿÆÇÅÿÄÅÃÿÂÃÁÿÀÁ¿ÿÄÅÃÿÃÄÂÿÂÃÁÿÁÂÀÿ¾Á¿ÿ¾Á¿ÿ¾Á¿ÿ¾Á¿ÿÁ¿¿ÿÂÀÀÿÂÂÂÿÂÂÂÿÀÀÀÿ¿¿¿ÿ¼¿½ÿ¼¿½ÿ»¼ºÿ»¼ºÿ½¾¼ÿ¿À¾ÿÄÂÁÿÄÂÁÿÅÁÀÿÃ¿¾ÿÄÀ¿ÿÄÁ½ÿÅÁÀÿÄÂÁÿÄÂÂÿÄÂÂÿÂÁÃÿÁÀÂÿÂÁÃÿÄÃÅÿÆÅÇÿÆÅÇÿÇÅÅÿÅÃÃÿÄÂÂÿÆÁÂÿÇÀ½ÿÇ¾ºÿÅ¼¸ÿÄ¼µÿÅ¾µÿÆÀµÿÆÀµÿÅ¿²ÿÄ¾±ÿÆÀ³ÿÅ¿´ÿÃ¼³ÿÃ¼³ÿÅ½¶ÿÈ¾·ÿÆ¼µÿÁ¹²ÿ¿¹²ÿ¿¹²ÿÀº³ÿÃ¼³ÿÄ½´ÿÅ¾µÿÆÀµÿÅ¼²ÿÄ¼¯ÿÄ»®ÿÂ¹¬ÿÀ·©ÿÀ·©ÿÂ¹«ÿÃ»ªÿÂ¸§ÿÁ·¦ÿÁ·¦ÿÁ·¦ÿÂ¸§ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÅ»ªÿÅ»ªÿÄº©ÿÄº©ÿÃ¹¨ÿÂ¸§ÿÂ¸§ÿÂ·©ÿÀ·ªÿ¿·ªÿ¿·ªÿÀ¸«ÿÁ¹¬ÿÁº«ÿÁº«ÿ¿º«ÿ¿º«ÿ¿¹¬ÿ¿¹¬ÿ¾¸«ÿ½·¬ÿ¾¸­ÿÁº±ÿÃ»´ÿÃ½¶ÿÃÀ¸ÿÅÁ¼ÿÆÂ½ÿÆÂ½ÿÆÂ½ÿÅÀ½ÿÄ¿¼ÿÅÀ½ÿÆÁ¾ÿÇÂ¿ÿÇÂ¿ÿÇÂ¿ÿÇÂ¿ÿÇÂ¿ÿÆÂÁÿÆÂÁÿÄÂÁÿÅÃÂÿÆÄÃÿÅÃÂÿÂÃÁÿÀÁ¿ÿ¿À¾ÿÂÃÁÿÁÂÀÿÁÂÀÿÀÁ¿ÿÀÁ¿ÿ¾Á¿ÿ¿ÂÀÿÁÂÀÿÁÁÁÿÅÃÃÿÆÆÆÿÆÆÆÿÄÄÄÿÂÂÂÿ¿ÁÁÿ¾Á¿ÿÀÁ¿ÿÀÁ¿ÿÁÂÀÿÂÃÁÿÅÃÂÿÄÃ¿ÿÄÀ¿ÿÂ¿»ÿÂ¿»ÿÃÀ¼ÿÄÀ¿ÿÅÁÀÿÆÁÂÿÅÃÃÿÆÃÅÿÄÃÅÿÁÀÂÿÂÁÃÿÃÂÄÿÄÄÄÿÆÄÄÿÅÃÃÿÅÃÃÿÇÃÂÿÆÁ¾ÿÆÀ»ÿÄ¾·ÿÂ½´ÿÄ½´ÿÂ¾³ÿÃ½°ÿÁ»®ÿÄ¾±ÿÄ¾±ÿÄ¾³ÿÄ¾³ÿÅ¾µÿÆ¿¶ÿÈÀ¹ÿÈÀ¹ÿÆ¾·ÿÄ¾·ÿÄ¾·ÿÄ¾·ÿÇÀ·ÿÉÂ¹ÿÊÃºÿÊÃºÿËÂ¸ÿÉÀ¶ÿÆ½°ÿÃº­ÿÁ¸ªÿÂ¹«ÿÃº¬ÿÄ»­ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÁ·¦ÿÂ¸§ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÄº©ÿÄº©ÿÄº©ÿÄº©ÿÄº©ÿÄº©ÿÃ¹¨ÿÂ¸§ÿ¿¶¨ÿ¿¶¨ÿ¿¶¨ÿÀ·©ÿÁ¸ªÿÀ¹¨ÿÀ¹¨ÿÀ¹¨ÿÁº©ÿÁº«ÿÁº«ÿÀ¹ªÿ¿·ªÿÀ¸«ÿÃº°ÿÄ¾³ÿÄ¿¶ÿÅÀ·ÿÆÀ¹ÿÇÁºÿÈÂ»ÿÇÁºÿÅ¿ºÿÃ½¸ÿÄ¿¼ÿÄ¿¼ÿÅÀ¿ÿÅÀ¿ÿÅÁÀÿÅÁÀÿÅÁÀÿÄÀ¿ÿÃ¿¾ÿÃ¿¾ÿÃ¿¾ÿÁ¿¾ÿÁ¿¾ÿÁ¿¾ÿÁ¿¾ÿÁ¿¾ÿÁ¿¾ÿÁ¿¾ÿÁ¿¾ÿ¿À¾ÿÀÁ¿ÿÁÂÀÿÂÃÁÿÃÄÂÿÄÄÄÿÆÅÇÿÈÇÉÿÉÈÊÿÇÆÈÿÅÅÅÿÂÄÄÿÁÃÃÿÇÈÆÿÅÆÄÿÃÄÀÿÃÄÀÿÅÄÀÿÅÅ¿ÿÅÂ¾ÿÄÁ¼ÿÇÃ¾ÿÆÂ½ÿÅÀ½ÿÄÁ½ÿÄÀ¿ÿÄÂÁÿÅÃÃÿÆÄÄÿÅÃÃÿÅÃÃÿÅÃÃÿÅÃÃÿÇÂÃÿÇÃÂÿÆÂÁÿÅÂ¾ÿÄÀ»ÿÂ¿·ÿÀ½µÿ¿½³ÿÁ¼³ÿ¾¼±ÿ¿¼®ÿ¾»­ÿÁ¾°ÿÀ½¯ÿÁ¾°ÿÂ¿±ÿÄÀµÿÅÁ¶ÿÆÁ¸ÿÊÃºÿÈÀ¹ÿÇ¿¸ÿÇ¿¸ÿÇ¿¸ÿÇÀ·ÿÈÁ¸ÿÊÁ¸ÿËÂ¹ÿÍÄºÿÊÁ·ÿÆ½°ÿÃº­ÿÂ¹¬ÿÃº­ÿÄ»®ÿÄ»­ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÂ¸§ÿÃ¹¨ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÁ·¦ÿÁ·¦ÿÁ·¦ÿÂ¸§ÿÃ¹¨ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÁ¸ªÿÀ¸§ÿ¿·¦ÿ¾¶¥ÿ¾¶¥ÿÀ¸§ÿÂ»¨ÿÂ¼©ÿÁº©ÿÂ»ªÿÂ»ªÿÁº©ÿÁº«ÿÂ»¬ÿÄ¼¯ÿÇ¿²ÿÅ¿´ÿÃ¾µÿÅ¾µÿÄ¿¶ÿÅ¿¸ÿÅ¿¸ÿÃ½¸ÿÁ»¶ÿÃ¾»ÿÂ½ºÿÂ½¼ÿÃ¾½ÿÄÀ¿ÿÄÀ¿ÿÃ¾¿ÿÁ¼½ÿÂ¾½ÿÁ½¼ÿÁ½¼ÿÀ¼»ÿÀ¼»ÿ¿½¼ÿÀ¾½ÿÁ¿¾ÿ¿½¼ÿ¿½¼ÿÀ¾½ÿÀ¾½ÿÂÀ¿ÿÁÂÀÿÅÃÂÿÄÅÃÿÄÃÅÿÆÅÇÿÇÆÈÿÇÆÈÿÆÅÇÿÄÃÅÿÂÄÄÿÂÅÃÿÇÈÆÿÅÆÂÿÂÃ¿ÿÁÃ½ÿÄÄ¾ÿÅÅ¿ÿÈÅÀÿÇÄ¿ÿËÇÂÿÊÆÁÿÇÂ¿ÿÅÀ½ÿÃ¿¾ÿÄÀ¿ÿÅÀÁÿÄÂÂÿÈÆÆÿÅÃÃÿÃÁÁÿÂÀ¿ÿÃ¿¾ÿÂ¾½ÿÁ½¼ÿ¿¼¸ÿ¿¼·ÿ½»³ÿ½º²ÿ¾»³ÿ¿½³ÿÀ¾³ÿ¿½²ÿ¾½¯ÿ¾¼±ÿ¿¼®ÿÀ¼±ÿÃ¿´ÿÅÁ¶ÿÃ¿´ÿÄ¿¶ÿÆÁ¸ÿÇ¿¸ÿÆ¾·ÿÆ¾·ÿÅ½¶ÿÅ¾µÿÅ¾µÿÈ¿¶ÿÈ¿¶ÿÊÁ·ÿÇ¾´ÿÃº­ÿÂ¹¬ÿÂ¹¬ÿÃº­ÿÃº­ÿÂ¹¬ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÂ¸§ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÁ·¦ÿÂ¸§ÿÀ¶¥ÿ¿µ¤ÿÀ¶¥ÿÂ¸§ÿÃ¹¨ÿÂ¸§ÿÀ¶¥ÿÄº©ÿÃ¹¨ÿÂ¸§ÿÁ·¥ÿÁ·¥ÿÀ¹¦ÿÂ»¨ÿÃ¼©ÿÁº§ÿÂ»¨ÿÃ»ªÿÃ»ªÿÃº¬ÿÃº¬ÿÅ¼®ÿÆ¾±ÿÅ½°ÿÂ¼±ÿÃº°ÿÂ¼±ÿÅ¾µÿÆ¿¶ÿÃ½¶ÿÁ»´ÿÅ¿ºÿÄ½ºÿÁ¼»ÿÂ½¼ÿÄ¾¿ÿÅ¿ÀÿÂ½¾ÿÀ»¼ÿÃ¾½ÿÃ¾»ÿÃ¾»ÿÃ¾»ÿÃ¾»ÿÂ¿»ÿÂ¿»ÿÁ¾ºÿÁ¾ºÿÁ¾ºÿÂ¿»ÿÂ¿»ÿÃÀ¼ÿÃÂ¾ÿÆÃ¿ÿÅÃÂÿÄÁÃÿÅÁÆÿÄÃÅÿÄÃÅÿÂÁÃÿÂÁÃÿÂÂÂÿÃÄÂÿÄÅÃÿÂÃ¿ÿÂÁ½ÿÁÁ»ÿÄÁ¼ÿÅÃ»ÿÆÄ¼ÿÅÃ»ÿÇÄ¼ÿÉÃ¼ÿÆÂ½ÿÆÂ½ÿÅÀ½ÿÄÁ½ÿÄÀ¿ÿÄÀ¿ÿÇÃÂÿÄÀ¿ÿÁ½¼ÿÀ¼»ÿÁ½¼ÿÁ¾ºÿÁ¼¹ÿ¾»·ÿ¿¼·ÿ¼¼¶ÿ½ºµÿ¾¼´ÿÀ¾¶ÿÁÀ¶ÿÀ¿µÿ¿¿³ÿ¾½³ÿ½»°ÿ¾¼²ÿÂÀ¶ÿÃÁ·ÿ¿½³ÿ½»±ÿÁ¼³ÿÄ½´ÿÄ½´ÿÃ¼³ÿÃ¼³ÿÅ¼³ÿÆ½´ÿÆ½´ÿÇ¾µÿÇ¾´ÿÄ»±ÿÂ¸®ÿÁ·­ÿÃº­ÿÅ¼¯ÿÄ»®ÿÂ¹¬ÿÃ¹¨ÿÂ¸§ÿÁ·¦ÿÂ¸§ÿÃ¹¨ÿÃ¹¨ÿÃ¹¨ÿÂ¸§ÿÄº©ÿÂ¸§ÿÀ¶¥ÿÁ·¦ÿÃ¹¨ÿÄº©ÿÃ¹¨ÿÁ·¦ÿÃ¹¨ÿÃ¹¨ÿÃ¹§ÿÃ¹§ÿÃ¹§ÿÃ¹§ÿÁº§ÿÁº§ÿÀ¹¦ÿÁº§ÿÃ»ªÿÃ»ªÿÃº¬ÿÃº¬ÿÅ¼®ÿÆ½¯ÿÄ¼¯ÿÂº­ÿÁ¹¬ÿÃº°ÿÄ¾³ÿÆ¿¶ÿÆ¿¶ÿÃ½¶ÿÆÀ»ÿÅ¿ºÿÄ½ºÿÃ¾½ÿÆÁÀÿÆÀÁÿÄ¿ÀÿÁ½¼ÿÃ¾»ÿÄÀ»ÿÆÁ¾ÿÇÃ¾ÿÆÁ¾ÿÄÀ»ÿÂ½ºÿ¿¼·ÿÃ¾»ÿÂ¿ºÿÂ¿»ÿÂ¿ºÿÃÀ¼ÿÄÁ¼ÿÅÂ¾ÿÅÂ¾ÿÅÀÂÿÄÁÃÿÄÁÃÿÁÀÂÿÀ¿ÁÿÀÀÀÿÁÂÀÿÃÄÀÿÃÄÀÿÁÃ½ÿÁÁ»ÿÁÂ¹ÿÃÁ¹ÿÃÁ¹ÿÁ¿·ÿÁ¾¶ÿÁ»´ÿÃ½¶ÿÃ¿ºÿÅÁ¼ÿÆÁ¾ÿÇÂ¿ÿÅÁÀÿÅÁÀÿÄÀ¿ÿÁ½¼ÿ¿»ºÿ¿»ºÿÂ¿»ÿÄÁ½ÿÅÀ½ÿÃÀ¼ÿÁÁ»ÿ¿¿¹ÿ¾¾¸ÿ¾¾¸ÿÁ¾¹ÿÁ¿·ÿÀ¾¶ÿ¿½µÿ¿½µÿ½¼²ÿ¿½³ÿÃÁ·ÿÂÀ¶ÿ¼º°ÿ¹·­ÿ½¸¯ÿÀ¹°ÿÀ¹°ÿÀ¹°ÿÀ¹°ÿÂ¹°ÿÃº±ÿÄ»²ÿÅ¼³ÿÅ¼²ÿÂ¹¯ÿÁ·­ÿÂ¸®ÿÅ¼¯ÿÇ¾±ÿÅ¼¯ÿÂ¹¬ÿÃ»ªÿÂº©ÿÁ¹¨ÿÀ¸§ÿ¿¶¨ÿÀ·©ÿÀ·ªÿÁ¸«ÿÀ·ªÿÁ·­ÿÃ¹¯ÿÂ¸®ÿÁ·­ÿ¿µ«ÿÀµ­ÿÀ¶¬ÿÃ·«ÿÁ¶¨ÿ¿´¦ÿ¿´¦ÿÂ·©ÿÃ¸ªÿÂ·©ÿÁ¶¨ÿ½²¤ÿÁ¶¨ÿÅº¬ÿÆ»­ÿÃ¸ªÿÀµ§ÿ¾³¥ÿ¾³¥ÿÁ·¦ÿÁ·¦ÿÁ¶¨ÿÁ¶¨ÿÂµ§ÿÂµ§ÿÁ´¦ÿÁ´¦ÿÇº¬ÿÆ¹«ÿÄ·©ÿÃ¶¦ÿÄµ¥ÿÄµ¥ÿÅ·¥ÿÅ·¥ÿÁ´¤ÿÂµ¥ÿÃ¶¦ÿÂµ¥ÿÁ´¤ÿÀ³£ÿÀ³£ÿÁ´¤ÿÃ¶¦ÿÃ¶¦ÿÁ´¤ÿÀ³£ÿ¿²¢ÿ¿²¢ÿ¿²¢ÿ¿²¢ÿÂµ¥ÿÁ´¤ÿÃ´¤ÿÃ´¤ÿÃ´¤ÿÄµ¥ÿÄµ¥ÿÅ¶¦ÿÃ´¤ÿÃ´¤ÿÄ´§ÿÄµ¥ÿÄ´§ÿÄµ¥ÿÃ³¦ÿÃ´¤ÿÂ²¥ÿÂ³£ÿÁ±¤ÿÁ²¢ÿÁ±¤ÿÃ´¤ÿÄ´§ÿÅ¶¦ÿ¾¯ŸÿÂ³£ÿÀ³£ÿ¾±¡ÿ¾±¡ÿÃ¶¦ÿÃ¶¦ÿÀ³£ÿ¿²¢ÿ¿²¢ÿ¾³¥ÿ¾´£ÿ¾³¥ÿ¾´£ÿ¿µ¤ÿ¿µ¤ÿ¼³¥ÿ¼³¥ÿ¼³¥ÿ¼³¥ÿ¼³¥ÿ»²¤ÿ»²¤ÿ»²¤ÿº±£ÿ»²¤ÿ½´¦ÿ¾µ§ÿ½´¦ÿ½´¦ÿÀµ§ÿÁ¶¨ÿÁ´¦ÿÁ´¦ÿÀ³¥ÿ¿²¤ÿ¾±£ÿ¾±£ÿÀ°£ÿÀ°£ÿÃ»ªÿÂ»¨ÿÂº©ÿÁ¹¨ÿÁ¸ªÿÁ¸ªÿÂ¹¬ÿÂ¹¬ÿ¿µ«ÿÀ¶¬ÿÀµ­ÿÀµ­ÿ¿´¬ÿ¿´¬ÿ¾²¬ÿ¾³«ÿÀ·ªÿ¾µ§ÿ½±¥ÿ¼³¥ÿÀ´¨ÿÀ·©ÿÀ´¨ÿ¼³¥ÿ¿³§ÿ¿¶¨ÿÂ¶ªÿÀ·©ÿ¿³§ÿ¼³¥ÿ¾²¦ÿ½´¦ÿÀµ§ÿ¾µ§ÿÁ¶¨ÿÁ¶¨ÿÂ¶ªÿÁ¶¨ÿÃµ©ÿÀµ§ÿÂ´¨ÿÀµ§ÿÁ´¦ÿÁ´¤ÿÁ´¤ÿÂµ¥ÿÆ·§ÿÄ¸¦ÿÁ´¤ÿÂµ¥ÿÃ¶¦ÿÂµ¥ÿÁ´¤ÿÀ³£ÿÁ´¤ÿÂµ¥ÿÂµ¥ÿÁ´¤ÿÁ´¤ÿÀ³£ÿÀ³£ÿÀ³£ÿÁ´¤ÿÁ´¤ÿÅ¶¦ÿÅ¶¦ÿÄµ¥ÿÄµ¥ÿÄµ¥ÿÅ¶¦ÿÆ·§ÿÆ·§ÿÂ²¥ÿÂ²¥ÿÃ³¦ÿÃ³¦ÿÃ³¦ÿÃ³¦ÿÃ³¦ÿÂ²¥ÿÆ·§ÿÅ¶¦ÿÃ´¤ÿÂ³£ÿÂ³£ÿÂ³£ÿÃ´¤ÿÃ´¤ÿÂ³£ÿÅ¶¦ÿÃ¶¦ÿÀ³£ÿÀ³£ÿÃ¶¦ÿÃ¶¦ÿÀ³£ÿÀ³£ÿÀ³£ÿ¾´£ÿ¿µ¤ÿ¿µ¤ÿ¿µ¤ÿ¿µ¤ÿ¿µ¤ÿ½´¦ÿ½´¦ÿ½´¦ÿ¾µ§ÿ¾µ§ÿ¾µ§ÿ¿¶©ÿ¿¶©ÿ»²¥ÿ½´§ÿ¾µ¨ÿ¾µ¨ÿ½´¦ÿ½´¦ÿ¿´¦ÿÀµ§ÿÂµ§ÿÁ´¦ÿÀ³¥ÿ¿²¤ÿ¾±£ÿ¾±£ÿÀ°£ÿÁ²¢ÿÃ»ªÿÃ»ªÿÃ»ªÿÄ¼«ÿÄ»­ÿÄ»­ÿÄ»®ÿÄ»®ÿÂ¸®ÿÁ·­ÿÁ¶®ÿÂ·¯ÿÂ·¯ÿÁ¶®ÿÀ´®ÿ¿´¬ÿÁ·­ÿ½µ¨ÿ»±§ÿ»³¦ÿ¾´ªÿ¾¶©ÿ½³©ÿº²¥ÿ¿µ«ÿ¾¶©ÿ¿µ«ÿ½µ¨ÿ¾´ªÿ¾¶©ÿÂ¸®ÿÃ»®ÿÁ¸«ÿÁ¹¬ÿÄ»®ÿÆ½°ÿÆ¼²ÿÆ½°ÿÇ»±ÿÄ»®ÿÂ¶¬ÿ¿¶©ÿÁµ©ÿÀµ§ÿÀµ§ÿÁ·¦ÿÃ¶¦ÿÄ·§ÿÂµ¥ÿÃ¶¦ÿÃ¶¦ÿÂµ¥ÿÁ´¤ÿÀ³£ÿÁ´¤ÿÂµ¥ÿÁ´¤ÿÁ´¤ÿÀ³£ÿÀ³£ÿÁ´¤ÿÁ´¤ÿÂµ¥ÿÃ¶¦ÿÃ¶¦ÿÃ¶¦ÿÃ¶¦ÿÃ¶¦ÿÃ¶¦ÿÄ·§ÿÄ·§ÿÅ¸¨ÿÀ³¥ÿÀ³¥ÿÁ´¦ÿÂµ§ÿÂµ§ÿÂµ§ÿÂµ§ÿÂµ§ÿÇ¸¨ÿÆ·§ÿÅ¶¦ÿÄµ¥ÿÃ´¤ÿÃ´¤ÿÂµ¥ÿÂµ¥ÿÃ¶¦ÿÅ¸¨ÿÅ¸¨ÿÃ¶¦ÿÃ¶¦ÿÄ·§ÿÂ¸§ÿÀ¶¥ÿÀ¶¥ÿÀ¶¥ÿÀ¶¥ÿÀ¶¥ÿÀµ§ÿÁ¶¨ÿ¿¶¨ÿ¿¶¨ÿ¿¶¨ÿ¿¶¨ÿÀ·©ÿÁ¸ªÿÁ¹¬ÿÁ¹¬ÿÂº­ÿÂº­ÿÁ¸«ÿÂ¹¬ÿÃº­ÿÂ¹¬ÿÀ·ªÿ¿¶©ÿÁ¶¨ÿÁ¶¨ÿÂµ§ÿÁ´¦ÿÁ´¤ÿÀ³£ÿ¿²¢ÿ¿²¢ÿÁ²¢ÿÂ³£ÿÃº¬ÿÃ»ªÿÄ¼«ÿÅ½¬ÿÆ½¯ÿÆ½¯ÿÅ¼¯ÿÅ¼¯ÿÈ¾´ÿÇ½³ÿÆ»³ÿÇ¼´ÿÈ½µÿÈ½µÿÆº´ÿÃº±ÿÂ¹°ÿ½·¬ÿ½´ªÿ¼¶«ÿÀ·­ÿ¿¹®ÿ¿¶¬ÿ»µªÿÀ·­ÿ¿¹®ÿÁ¸®ÿÀº¯ÿÃº°ÿÄ¾³ÿÉÀ¶ÿËÂ¸ÿÆ½³ÿÇ¾´ÿÉÀ¶ÿËÂ¸ÿËÂ¹ÿÊÁ·ÿÊ¿·ÿÇ¾´ÿÉ¿µÿÇ½³ÿÅ»±ÿÃº­ÿÁ¸«ÿ¿¶¨ÿÀµ§ÿÀ¶¥ÿÃ¶¦ÿÃ¶¦ÿÄ·§ÿÃ¶¦ÿÁ´¤ÿÁ´¤ÿÂµ¥ÿÃ¶¦ÿÂµ¥ÿÁ´¤ÿÁ´¤ÿÁ´¤ÿÁ´¤ÿÂµ¥ÿÂµ¥ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÃ¶¦ÿÃ¶¦ÿÄ·§ÿÂµ§ÿÂµ§ÿÃ¶¨ÿÄ·©ÿÅ¸ªÿÅ¸ªÿÅ¸ªÿÅ¸ªÿÅ¶¦ÿÅ¶¦ÿÅ¶¦ÿÅ¶¦ÿÅ¶¦ÿÄ·§ÿÅ¸¨ÿÆ¹©ÿÅ¸¨ÿÆ¹©ÿÅ¸¨ÿÅ¸¨ÿÅ¸¨ÿÅ¸¨ÿÃ¹¨ÿÃ¹¨ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÂ¸§ÿÂ·©ÿÃ¸ªÿÁ¸ªÿÁ¸ªÿÂ¹«ÿÂ¹«ÿÃº¬ÿÄ»­ÿÄ¼¯ÿÄ¼¯ÿÄ¼¯ÿÄ¼¯ÿÆ½°ÿÆ½°ÿÇ¾±ÿÅ¼¯ÿÃº­ÿÀ·ªÿÂ·©ÿÂ·©ÿÂµ§ÿÂµ§ÿÁ´¤ÿÀ³£ÿÀ³£ÿÀ³£ÿÂ³£ÿÃ´¤ÿÂ»¬ÿÃ¼­ÿÄ½®ÿÄ½®ÿÅ½°ÿÅ½°ÿÅ½°ÿÅ½°ÿÊÁ·ÿÉÀ¶ÿÉÀ·ÿÉÀ·ÿÊÁ¸ÿÊÁ¸ÿÉÀ·ÿÇ¾µÿÃ¼³ÿ¿º±ÿÀ¹°ÿ¿º±ÿÃ¼³ÿÂ½´ÿÃ¼³ÿ¿º±ÿÂ»²ÿÀ»²ÿÃ¼³ÿÃ¾µÿÇÀ·ÿÆÁ¸ÿÈÁ¸ÿÈÁ¸ÿÆ¿¶ÿÇÀ·ÿÈÁ¸ÿÉÂ¹ÿÉÁºÿÇÀ·ÿÇ½¶ÿÄ½´ÿÍÄ»ÿËÂ¸ÿÉÀ¶ÿÅ½°ÿÂº­ÿÀ¹ªÿ¿¶¨ÿ¾µ§ÿÁ·¦ÿÄ·§ÿÄ·§ÿÃ¶¦ÿÁ´¤ÿÁ´¤ÿÂµ¥ÿÄ·§ÿÃ¶¦ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÁ´¤ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÃ¶¦ÿÄ·§ÿÄ·©ÿÄ·©ÿÅ¸ªÿÆ¹«ÿÇº¬ÿÇº¬ÿÆ¹«ÿÆ¹«ÿÄ·©ÿÄ·©ÿÄ·©ÿÄ·©ÿÅ¸ªÿÅ¸ªÿÆ¹«ÿÅº¬ÿÂ·©ÿÂ·©ÿÂ·©ÿÃ¸ªÿÄ¹«ÿÄ¹«ÿÄ¹«ÿÅº¬ÿÁ¸ªÿÁ¸ªÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÃº¬ÿÃº¬ÿÄ¼¯ÿÄ¼¯ÿÅ½°ÿÅ½°ÿÅ½°ÿÅ½°ÿÄ¼¯ÿÄ¼¯ÿÆ½°ÿÇ¾±ÿÇ¾±ÿÅ¼¯ÿÂ¹¬ÿÀ·ªÿÁ¶¨ÿÁ¶¨ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÁ´¤ÿÁµ£ÿÁµ£ÿÃµ£ÿÄ¶¤ÿÃ¼­ÿÃ¼­ÿÃ¼­ÿÃ¼­ÿÄ¼¯ÿÅ½°ÿÅ½°ÿÆ¾±ÿÈ¿µÿÈ¿µÿÈ¿¶ÿÈ¿¶ÿÉÀ·ÿÈ¿¶ÿÇ¾µÿÆ½´ÿÅ¾µÿÃ¾µÿÃ¾µÿÄ¿¶ÿÄ¿¶ÿÅÀ·ÿÄ¿¶ÿÄ¿¶ÿÃ¾µÿÃ¾µÿÃ¾µÿÅÀ·ÿÅÀ·ÿÄ¿¶ÿÁ¼³ÿ¿º±ÿÆ¾·ÿÇ¿¸ÿÇ¿¸ÿÇ¿¸ÿÆ¾·ÿÅ½¶ÿÄ¼µÿÃ»´ÿÈÁ¸ÿÇÀ·ÿÇ¾´ÿÅ½°ÿÃ»®ÿÁº«ÿÀ¹ªÿÀ·©ÿÂ¸§ÿÅ¸¨ÿÄ·§ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÃ¶¦ÿÅ¸¨ÿÄ·§ÿÄ·§ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÄ·§ÿÄ·§ÿÃ¶¦ÿÃ¶¦ÿÃ¶¦ÿÄ·§ÿÅ¸¨ÿÅ¸¨ÿÄ·©ÿÄ·©ÿÅ¸ªÿÆ¹«ÿÆ¹«ÿÆ¹«ÿÆ¹«ÿÆ¹«ÿÇº¬ÿÇº¬ÿÆ¹«ÿÆ¹«ÿÅ¸ªÿÅ¸ªÿÂ·©ÿÂ·©ÿÂ·©ÿÀµ§ÿÁ¶¨ÿÄ¹«ÿÄ¹«ÿÃ¸ªÿÄ¹«ÿÄ»­ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÂ¹«ÿÃº¬ÿÃº¬ÿÃº¬ÿÃº¬ÿÄ¼¯ÿÅ½°ÿÆ¾±ÿÆ¾±ÿÆ¾±ÿÅ½°ÿÄ¼¯ÿÃ»®ÿÆ½°ÿÇ¾±ÿÇ¾±ÿÆ½°ÿÃº­ÿÀ·ªÿÂ·©ÿÂ·©ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÁ´¤ÿÁµ£ÿÁµ£ÿÄ¶¤ÿÄ¶¤ÿÄ¼¯ÿÃ»®ÿÂº­ÿÁ¹¬ÿÂº­ÿÃ»®ÿÅ½°ÿÆ¾±ÿÅ¼²ÿÆ½³ÿÇ¾´ÿÇ¾´ÿÆ½³ÿÅ¼²ÿÅ¼³ÿÅ¼³ÿÄ¾³ÿÆÀµÿÇÁ¶ÿÇÁ¶ÿÆÀµÿÅ¿´ÿÆÀµÿÆÀµÿÆÀµÿÅ¿´ÿÅ¿´ÿÆÀµÿÇÁ¶ÿÆÀµÿÃ½²ÿÀº¯ÿÅ¾µÿÅ¾µÿÅ¾µÿÄ½´ÿÄ¼µÿÄ¼µÿÇ¾µÿÇ¾µÿÅ¼³ÿÅ¼³ÿÄ»±ÿÃ»®ÿÂº­ÿÁº«ÿÀ¹ªÿÁ¹¨ÿÃ¹¨ÿÅ¸¨ÿÅ¸¨ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÄ·§ÿÅ¸¨ÿÃ¶¦ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÃ¶¦ÿÃ¶¦ÿÄ·§ÿÄ·§ÿÅ¸¨ÿÅ¸¨ÿÄ·§ÿÄ·§ÿÅ¸¨ÿÅ¸¨ÿÆ¹©ÿÇºªÿÄ·§ÿÅ¸¨ÿÆ¹«ÿÆ¹«ÿÆ¹«ÿÆ¹«ÿÆ¹«ÿÅ¸ªÿÅ¹­ÿÅ¹­ÿÅ¹­ÿÄ¸¬ÿÄ¸¬ÿÃ·«ÿÃ·«ÿÃ·«ÿÁ¸«ÿ¿¶©ÿ¿¶©ÿÂ¹¬ÿÂ¹¬ÿÀ·ªÿÀ·ªÿÃº­ÿÁ¸«ÿÀ¸«ÿÀ¸«ÿÀ¸«ÿÁ¹¬ÿÁ¹¬ÿÁ¹¬ÿÁ¹¬ÿÂº­ÿÃ»®ÿÄ¼¯ÿÅ½°ÿÅ½°ÿÅ½°ÿÄ¼¯ÿÃ»®ÿÅ»±ÿÆ¼²ÿÇ¾±ÿÅ¼¯ÿÃº­ÿÁ¸«ÿÃ¸ªÿÃ¸ªÿÂµ¥ÿÂµ¥ÿÁµ£ÿÁµ£ÿÁµ£ÿÂ¶¤ÿÄ¶£ÿÄ¶£ÿÄ¼¯ÿÃ»®ÿÁ¹¬ÿÀ¸«ÿÀ¸«ÿÂº­ÿÄ¼¯ÿÆ¾±ÿÄ»±ÿÆ½³ÿÇ¾´ÿÇ¾´ÿÅ¼²ÿÄ»±ÿÄ»±ÿÅ¼²ÿÅ¼²ÿÆÀ³ÿÊÁ·ÿÇÁ´ÿÆ½³ÿÃ½°ÿÆ½³ÿÅ¿²ÿÇ¾´ÿÄ¾±ÿÅ¼²ÿÄ¾±ÿÉÀ¶ÿÈÂµÿÉÀ¶ÿÅ¿´ÿÅ¼²ÿÂ¼±ÿÃº±ÿÁº±ÿÄ»²ÿÅ¼³ÿÆ½´ÿÇ¾´ÿÆ¼²ÿÄ»±ÿÄ»®ÿÂ»¬ÿÂ¹«ÿÀ¹¨ÿÀ¸§ÿ¿·¦ÿÃ¹¨ÿÅ¸¨ÿÅ¸¨ÿÃ¶¦ÿÂµ¥ÿÂµ¥ÿÄ·§ÿÆ¹©ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÂµ¥ÿÃ¶¦ÿÄ·§ÿÅ¸¨ÿÆ¹©ÿÅ¸¨ÿÅ¸¨ÿÅ¸¨ÿÄ·§ÿÅ¸¨ÿÅ¸¨ÿÆ¹©ÿÇºªÿÅ¸¨ÿÆ¹©ÿÆ¹«ÿÇº¬ÿÇº¬ÿÆ¹«ÿÆ¹«ÿÅ¸ªÿÃ·«ÿÃ·«ÿÃ·«ÿÄ¸¬ÿÄ¸¬ÿÅ¹­ÿÅ¹­ÿÅ¹­ÿÃº­ÿÀ·ªÿ¿¶©ÿÃº­ÿÂ¹¬ÿ¿¶©ÿ¿¶©ÿÂ¹¬ÿ¿·ªÿ¿·ªÿ¿·ªÿ¿·ªÿÀ¸«ÿÀ¸«ÿÀ¸«ÿÀ¸«ÿÀ¸«ÿÁ¹¬ÿÃ»®ÿÄ¼¯ÿÅ½°ÿÅ½°ÿÄ¼¯ÿÄ¼¯ÿÂ¸®ÿÃ¹¯ÿÄ»®ÿÃº­ÿÁ¸«ÿÀ·ªÿÁ¶¨ÿÂ·©ÿÂµ¥ÿÂµ¥ÿÁµ£ÿÁµ£ÿÁµ£ÿÂ¶¤ÿÄ¶£ÿÅ·¤ÿÁ²¢ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÁ³¡ÿÁ³¡ÿÀ² ÿ¿±Ÿÿ¿±Ÿÿ¾°žÿÁ³¡ÿÀ² ÿÀ² ÿ¿±Ÿÿ¾°žÿ¾°žÿ½¯ÿ½¯ÿ½¯ÿ¾°žÿ¿±Ÿÿ¿±žÿ¿±Ÿÿ¾°ÿ½¯ÿ¼®›ÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿº¬™ÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿ¹«˜ÿº¬™ÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿº¬™ÿ¹«˜ÿ¸ª—ÿ¹«˜ÿ»­šÿ¼®›ÿ¼®›ÿ»­šÿ¹«˜ÿ¸ª—ÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ¸ª—ÿ·©–ÿ·©–ÿ¶¨•ÿ´§‘ÿ·ª”ÿº­—ÿ¹¬–ÿ¶©“ÿµ¨’ÿ·ª”ÿº­—ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿÂ´¢ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÀ² ÿÀ² ÿÀ² ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÀ² ÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¾°žÿ¾°žÿ½¯ÿ¼®›ÿ¼®›ÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ¼®›ÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿº¬™ÿº¬™ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¸ª—ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¸ª—ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¸ª—ÿ·©–ÿ·©–ÿ·ª”ÿº­—ÿ¼¯™ÿº­—ÿ·ª”ÿµ¨’ÿ·ª”ÿº­—ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÁ³¡ÿÁ³¡ÿÀ² ÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±ŸÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ¿±Ÿÿ½¯œÿ¾°ÿ¾°ÿ¿±žÿ¿±žÿ¾°ÿ¾°ÿ½¯œÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ½¯œÿ½¯œÿ¼®›ÿ¼®›ÿ¼®›ÿ½¯œÿ¼®›ÿ¼®›ÿ»­šÿº¬™ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ¼®›ÿ»­šÿº¬™ÿ¹«˜ÿ¹«˜ÿº¬™ÿ»­šÿ¼®›ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¸ª—ÿ¸ª—ÿ¹¬–ÿ»®˜ÿ¼¯™ÿ»®˜ÿ·ª”ÿ¶©“ÿ·ª”ÿ¹¬–ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÁ³¡ÿÁ³¡ÿÁ³¡ÿÂ´¢ÿÂ´¢ÿÃµ£ÿÃµ£ÿÂ´¢ÿÂ´¢ÿÁ³¡ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÂ´¢ÿÁ³¡ÿÀ² ÿ¿±Ÿÿ¿±Ÿÿ¿±ŸÿÀ² ÿÁ³¡ÿ¿±žÿ¿±žÿÀ²ŸÿÀ²ŸÿÀ²ŸÿÀ²Ÿÿ¿±žÿ¿±žÿ¿±žÿ¿±žÿ¿±žÿ¿±žÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ¼®›ÿ¼®›ÿ»­šÿ¾°ÿ½¯œÿ¼®›ÿ»­šÿº¬™ÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿº¬™ÿº¬™ÿ»­šÿ»­šÿ¼®›ÿº¬™ÿº¬™ÿ»­šÿ»­šÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¸«•ÿº­—ÿº­—ÿ¹¬–ÿ·ª”ÿ¶©“ÿ¶©“ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿÃµ£ÿÃµ£ÿÃµ£ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÂ´¢ÿÁ³¡ÿÁ³¡ÿÂ´¢ÿÂ´¢ÿÁ³¡ÿÁ³¡ÿÀ² ÿÀ² ÿ¿±Ÿÿ¿±ŸÿÂ´¢ÿÂ´¢ÿÀ² ÿ¿±Ÿÿ¿±ŸÿÀ² ÿÀ² ÿÁ³¡ÿ¿±žÿÀ²ŸÿÀ²ŸÿÁ³ ÿÁ³ ÿÀ²ŸÿÀ²Ÿÿ¿±žÿ¿±žÿ¿±žÿ¿±žÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ½¯œÿ½¯œÿ¾°ÿ¾°ÿ¾°ÿ½¯œÿ¼®›ÿ¼®›ÿ¾°ÿ½¯œÿ¼®›ÿ»­šÿ»­šÿ»­šÿ¼®›ÿ½¯œÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ·ª”ÿ¸«•ÿ¹¬–ÿ¸«•ÿ¸«•ÿ·ª”ÿ¸«•ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÂ´¢ÿÂ´¢ÿÂ´¢ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÃµ£ÿÂ´¢ÿÁ³¡ÿÁ³¡ÿÃµ£ÿÃµ£ÿÂ´¢ÿÁ³¡ÿÀ² ÿÀ² ÿ¿±Ÿÿ¿±ŸÿÂ´¢ÿÂ´¢ÿÁ³¡ÿÀ² ÿÀ² ÿÀ² ÿÀ² ÿÁ³¡ÿ¿±žÿ¿±žÿÀ²ŸÿÀ²ŸÿÀ²ŸÿÀ²Ÿÿ¿±žÿ¿±žÿ¿±žÿ¿±žÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ½¯œÿ¾°ÿ¾°ÿ¾°ÿ¾°ÿ½¯œÿ½¯œÿ¼®›ÿ¾°ÿ¾°ÿ½¯œÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ½¯œÿ»­šÿ»­šÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿº­—ÿº­—ÿº­—ÿº­—ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÀ´¢ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÀ´¢ÿ¿³¡ÿ¿³¡ÿÀ´¢ÿÀ´¢ÿÀ´¢ÿÀ´¢ÿ¿³¡ÿ¿³¡ÿ¾² ÿ¾² ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿ¾² ÿ½±Ÿÿ¼±ÿ½²žÿ½²žÿ½²žÿ½²žÿ½²žÿ½²žÿ¼±ÿ½²žÿ½²žÿ¼±ÿ¼±ÿ¼±ÿ½²žÿ½²žÿ¾³Ÿÿ»°œÿ¼±ÿ¼±ÿ¼±ÿ¼±ÿ»°œÿº¯›ÿº¯›ÿ»°œÿ¼±ÿ¼±ÿ¼±ÿ¼±ÿ»°œÿº¯›ÿº¯›ÿ½¯œÿ½¯œÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ»­šÿ¼®›ÿ»­šÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¼®›ÿ»­šÿº¬™ÿ»­šÿ»­šÿ»­šÿ»­šÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÂ¶¤ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÁµ£ÿÀ´¢ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿ¿³¡ÿÀ´¢ÿÀ´¢ÿÀ´¢ÿÀ´¢ÿ¾² ÿ¿³¡ÿÀ´¢ÿÀ´¢ÿÀ´¢ÿ¿³¡ÿ¾² ÿ½±Ÿÿ¼±ÿ¼±ÿ¼±ÿ½²žÿ½²žÿ¼±ÿ¼±ÿ¼±ÿ½²žÿ½²žÿ½²žÿ¼±ÿ½²žÿ½²žÿ¾³Ÿÿ¿´ ÿ»°œÿ¼±ÿ¼±ÿ¼±ÿ¼±ÿ»°œÿº¯›ÿº¯›ÿ»°œÿ»°œÿ¼±ÿ½²žÿ½²žÿ¼±ÿº¯›ÿ¹®šÿ¿±žÿ¾°ÿ¼®›ÿº¬™ÿº¬™ÿ¼®›ÿ¾°ÿ¿±žÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ½¯œÿ¼®›ÿ»­šÿ»­šÿº¬™ÿ»­šÿ»­šÿ»­šÿ½¯œÿ¼®›ÿ»­šÿ»­šÿ»­šÿ»­šÿ¹«˜ÿ¸ª—ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹¬–ÿ¸«•ÿ¸ª”ÿ¶©“ÿ·©“ÿ¶©“ÿ¸ª”ÿ¸«•ÿ¹«•ÿ¸«•ÿ¸ª”ÿ·ª”ÿ¸ª”ÿ·ª”ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¹«•ÿº¬–ÿ»­—ÿ»­—ÿ»­—ÿº¬–ÿ¹«•ÿ»­—ÿ»­—ÿº¬–ÿ¹«•ÿ¹«•ÿ¸ª”ÿ·©“ÿ·©“ÿ¹«”ÿ»­–ÿ¼®—ÿ»­–ÿ¸ª“ÿ¸ª“ÿº¬•ÿ¼®—ÿ»­–ÿº¬•ÿ¹«”ÿ¹«”ÿ¹«”ÿº¬•ÿ»­–ÿ¼®˜ÿ¼­šÿ¼¬›ÿ¼¬›ÿ»«šÿ»«šÿºª™ÿºª™ÿºª™ÿºª™ÿºª™ÿºª™ÿºª™ÿºª™ÿºª™ÿºª™ÿºª™ÿ»«šÿ»¬™ÿ»«šÿ»¬™ÿ»«šÿ»¬™ÿ»«šÿ»¬™ÿ¼¬›ÿ¼­šÿ¼¬›ÿ¼­šÿ¼¬›ÿ¼­šÿ¼¬›ÿ¼­šÿ»¬™ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ»¬™ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼®›ÿ¼®›ÿ¼®œÿ¼®›ÿ¼®œÿ¼®›ÿ¼®œÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿ¹¬–ÿ¸«•ÿ¸«•ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ·ª”ÿ¸«•ÿ¸«•ÿ¸«•ÿ·ª”ÿ·ª”ÿ¸«•ÿ¸«•ÿ¸«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¸ª”ÿ¹«•ÿº¬–ÿ»­—ÿ»­—ÿ»­—ÿº¬–ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«”ÿº¬•ÿ»­–ÿº¬•ÿ¸ª“ÿ¸ª“ÿº¬•ÿ¼®—ÿ»­–ÿ»­–ÿº¬•ÿº¬•ÿ»­–ÿ»­–ÿ¼®—ÿ¼®˜ÿ»¬™ÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ»«šÿ¼¬›ÿ¼¬›ÿ¼¬›ÿ¼¬›ÿ¼¬›ÿ¼¬›ÿ¼¬›ÿ¼¬›ÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ½¯œÿ½¯œÿ½¯œÿ½¯œÿ¸«•ÿ¸«•ÿ¸«•ÿ¹¬–ÿ¸«•ÿ¸«•ÿ·ª”ÿ·ª”ÿ¹¬–ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¹¬–ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¸ª”ÿ¸ª”ÿ¸ª”ÿ¹«•ÿ¹«•ÿ¹«•ÿº¬–ÿº¬–ÿ·©“ÿ¸ª”ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ¹«”ÿº¬•ÿº¬•ÿ¹«”ÿ¸ª“ÿ¸ª“ÿº¬•ÿ»­–ÿ»­–ÿ»­–ÿ¼®—ÿ¼®—ÿ½¯˜ÿ¼®—ÿ¼®—ÿ¼®˜ÿº«˜ÿº«˜ÿº«˜ÿ»¬™ÿ»¬™ÿ¼­šÿ¼­šÿ½®›ÿ»¬™ÿ»¬™ÿ»¬™ÿ»¬™ÿ¼­šÿ¼­šÿ¼­šÿ½®›ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½­œÿ½­œÿ½­œÿ½­œÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ»¬™ÿ»¬™ÿ¼­šÿ½®›ÿ¾°šÿ¾°šÿ¿±›ÿ¿±›ÿ¸«•ÿ¸«•ÿ¹¬–ÿº­—ÿ¹¬–ÿ¸«•ÿ·ª”ÿ¶©“ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¹«•ÿ¸ª”ÿ¸ª”ÿ¹«•ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ¸ª”ÿ¸ª”ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿ¹«•ÿ¹«•ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿº¬•ÿº¬•ÿº¬•ÿ¹«”ÿ¹«”ÿ¹«”ÿº¬•ÿ»­–ÿº¬•ÿ»­–ÿ¼®—ÿ½¯˜ÿ½¯˜ÿ½¯˜ÿ¼®—ÿ»­–ÿº¬–ÿº«˜ÿ»¬™ÿ»¬™ÿ»¬™ÿ¼­šÿ¼­šÿ¼­šÿº«˜ÿº«˜ÿ»¬™ÿ»¬™ÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ½­œÿ½­œÿ½­œÿ½­œÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ»¬™ÿ¼­šÿ¼­šÿ½®›ÿ¾°šÿ¾°šÿ¾°šÿ¾°šÿ¸«•ÿ¹¬–ÿº­—ÿº­—ÿº­—ÿ¹¬–ÿ¸«•ÿ·ª”ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿ¸«•ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿ¹«•ÿ¹«•ÿ¹«•ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿ»­—ÿ¸ª”ÿ¹«•ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿº¬–ÿº¬–ÿº¬–ÿ¼®—ÿ»­–ÿº¬•ÿº¬•ÿº¬•ÿ»­–ÿ»­–ÿ»­–ÿ¹«”ÿº¬•ÿ»­–ÿ¼®—ÿ½¯˜ÿ¼®—ÿ»­–ÿ»­–ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ»­—ÿ»­—ÿ»­—ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ½¯™ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ»¬™ÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ»¬™ÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿº­—ÿº­—ÿº­—ÿº­—ÿº­—ÿ¹¬–ÿ¹¬–ÿ¸«•ÿ¸«•ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¹¬–ÿ¸«•ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿ¹«•ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ»­—ÿ»­—ÿ»­—ÿº¬–ÿº¬–ÿ½¯™ÿ»­–ÿº¬•ÿº¬•ÿ»­–ÿ¼®—ÿ¼®—ÿ»­–ÿº¬•ÿº¬•ÿ»­–ÿ»­–ÿ»­–ÿ»­–ÿ»­–ÿ»­–ÿ½¯™ÿ¼®˜ÿ¼®˜ÿ»­—ÿ»­—ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿ»­—ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ»¬™ÿ»¬™ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ»¬™ÿ»¬™ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®™ÿ¿®™ÿÀ¯šÿ¿®™ÿ¿®™ÿ¿®™ÿ¾­˜ÿ¾­˜ÿ»­šÿ»­šÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿº¬™ÿ¹«˜ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ»­šÿ»­šÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ»­šÿ»­šÿ»­šÿ»®˜ÿ½¯™ÿ»­—ÿ¹«•ÿº¬–ÿ»­—ÿ¼®˜ÿ¼®˜ÿº¬–ÿ»­—ÿº¬–ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ¼®˜ÿ¼®˜ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ»¬™ÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ»¬™ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿ¾­˜ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿¯˜ÿ¿¯˜ÿ¿¯˜ÿ¿¯˜ÿ¼®›ÿ»­šÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿº¬™ÿ»­šÿº¬™ÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ»­šÿ»­šÿº¬™ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿ¹«˜ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿº¬™ÿ»­šÿ»­šÿ»­šÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¼®›ÿ¹«˜ÿ¹«˜ÿº¬™ÿº¬™ÿ»­šÿ¼®›ÿ½¯œÿ½¯œÿ½¯™ÿ»­—ÿ¸ª”ÿ¹«•ÿ»­—ÿ¼®˜ÿ»­—ÿº¬–ÿ¼®˜ÿ»­—ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ¼®˜ÿ½¯™ÿº¬–ÿº¬–ÿº¬–ÿ»­—ÿ»­—ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ½¯™ÿ½¯™ÿ½¯™ÿ½¯™ÿ½¯™ÿ½¯™ÿ½¯™ÿ½¯™ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ»­—ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼®˜ÿ¼­šÿ¼­šÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®›ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿ½¬—ÿ½¬—ÿ¾­˜ÿ¿®™ÿÀ°™ÿÀ°™ÿÀ°™ÿÁ±šÿ»­šÿ»­šÿ»­›ÿ»­šÿ¼®œÿ¼®›ÿ¼®œÿ¼®›ÿ¿±Ÿÿ¾°ÿ¼®œÿº¬™ÿº¬šÿ»­šÿ½¯ÿ¾°ÿ½®›ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ½®›ÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿÀ®ÿÀ®ÿÀ®ÿÀ®ÿÁ¯žÿÁ¯žÿÁ¯žÿÁ¯žÿÁ¯žÿÁ¯žÿÂ°ŸÿÂ°ŸÿÂ°ŸÿÂ°ŸÿÁ¯žÿÁ¯žÿÀ°Ÿÿ¿¯žÿ¿¯žÿ¿¯žÿ¿¯žÿÀ°ŸÿÁ± ÿÁ± ÿÀ°ŸÿÀ°ŸÿÀ°ŸÿÀ°ŸÿÀ°Ÿÿ¿¯žÿ¿¯žÿ¿¯žÿÀ±žÿÀ²œÿÀ±žÿÀ²œÿÀ±žÿÀ²œÿÀ±žÿÀ²œÿÀ±žÿÀ²œÿÀ±žÿÁ³ÿÁ²ŸÿÁ³ÿÁ²ŸÿÁ³ÿÀ±žÿÀ²œÿÀ±žÿÀ²œÿÀ±žÿÁ³ÿÁ²ŸÿÁ³ÿÀ±žÿÀ²œÿÁ²ŸÿÂ´žÿÂ³ ÿÂ´žÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ± ÿÁ± ÿÁ± ÿÁ± ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÂ²¡ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿ»­›ÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ½¯ÿ½¯ÿ½¯ÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ¼®œÿ½¯ÿ½¯ÿ¾°žÿ½®›ÿ¼­šÿ¼­šÿ¼­šÿ¼­šÿ½®›ÿ¾¯œÿ¾¯œÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿÀ®ÿÀ®ÿÁ¯žÿÁ¯žÿÁ¯žÿÁ¯žÿÂ°ŸÿÂ°ŸÿÁ¯žÿÁ¯žÿÂ°ŸÿÂ°ŸÿÂ°ŸÿÂ°ŸÿÁ¯žÿÁ¯žÿ¿¯žÿ¿¯žÿ¿¯žÿ¿¯žÿ¿¯žÿÀ°ŸÿÀ°ŸÿÁ± ÿÀ°ŸÿÀ°ŸÿÀ°ŸÿÀ°Ÿÿ¿¯žÿ¿¯žÿ¿¯žÿ¿°ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÂ´žÿÂ´žÿÀ²œÿÀ²œÿÁ³ÿÂ´žÿÂ´žÿÂ´žÿÁ³ÿÁ³ÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿº«˜ÿ»¬™ÿ½®›ÿ¾¯œÿ¿°ÿ¿°ÿ¿°ÿ¾¯œÿ½®›ÿ½®›ÿ¼­šÿ¼­šÿ¼­šÿ½®›ÿ¾¯œÿ¾¯œÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿÁ°ÿÁ°ÿÁ°ÿÁ°ÿÂ±žÿÂ±žÿÂ±žÿÂ±žÿÁ°ÿÁ°ÿÂ±žÿÂ±žÿÂ±žÿÂ±žÿÁ°ÿÁ°ÿ¿°ÿ¿°ÿ¾¯œÿ¾¯œÿ¿°ÿ¿°ÿÀ±žÿÀ±žÿÀ±žÿÀ±žÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¾¯œÿ¾¯œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÂ´žÿÁ³ÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¾¯œÿ¾¯œÿ¾¯œÿ»¬™ÿ¼­šÿ½®›ÿ½®›ÿ¾¯œÿ¾¯œÿ¾¯œÿ¿°ÿ½®›ÿ½®›ÿ½®›ÿ¼­šÿ½®›ÿ½®›ÿ¾¯œÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿÀ¯œÿÁ°ÿÁ°ÿÁ°ÿÁ°ÿÂ±žÿÂ±žÿÂ±žÿÁ°ÿÁ°ÿÁ°ÿÁ°ÿÁ°ÿÁ°ÿÁ°ÿÁ°ÿ¿°ÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¿°ÿÀ±žÿÀ±žÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¾¯œÿ¾¯œÿ¾¯œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿ¿±›ÿ¿±›ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÂ´žÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÁ²ŸÿÄ²¡ÿÄ²¡ÿÄ²¡ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÆ´£ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿ¾­˜ÿ¾­˜ÿ¾­˜ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿÁ°›ÿÀ¯šÿ¿®™ÿ¾­˜ÿ¾­˜ÿ¿®™ÿÀ¯šÿÁ°›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¾¯œÿ¾¯œÿ¿°ÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿÀ¯šÿÀ¯šÿÀ¯šÿÀ¯šÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÀ¯šÿÀ¯šÿÀ¯šÿÀ¯šÿÁ°›ÿÁ°›ÿ¿±›ÿ¾°šÿ¾°šÿ¾°šÿ¾°šÿ¿±›ÿÀ²œÿÀ²œÿ¿±›ÿ¿±›ÿ¿±›ÿ¿±›ÿ¿±›ÿ¾°šÿ¾°šÿ¾°šÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÂ´žÿÂ´žÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÁ²ŸÿÁ²ŸÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÃ´¡ÿÃ´¡ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÄ²¡ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÆ´£ÿÆ´£ÿÆ´£ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿ¾­˜ÿ¾­˜ÿ¾­˜ÿ¾­˜ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿÃ²ÿÁ°›ÿ¿®™ÿ½¬—ÿ½¬—ÿ¾­˜ÿÀ¯šÿÁ°›ÿ¾¯œÿ½®›ÿ½®›ÿ½®›ÿ½®›ÿ¾¯œÿ¿°ÿ¿°ÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿÀ¯šÿÀ¯šÿÀ¯šÿÀ¯šÿÀ¯šÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÀ¯šÿÀ¯šÿÀ¯šÿÀ¯šÿÁ°›ÿÁ°›ÿ¿±›ÿ¿±›ÿ¾°šÿ¾°šÿ¿±›ÿ¿±›ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿ¿±›ÿ¿±›ÿ¿±›ÿ¿±›ÿ¾°šÿ¾°šÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÂ´žÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÅ³¢ÿÆ´£ÿÆ´£ÿÆ´£ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿ¾­˜ÿ¾­˜ÿ¾­˜ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿÀ¯šÿÀ¯šÿ¿®™ÿ¿®™ÿ¾­˜ÿ¾­˜ÿ¿®™ÿÀ¯šÿÁ°›ÿ¾¯œÿ¾¯œÿ½®›ÿ½®›ÿ½®›ÿ¾¯œÿ¿°ÿ¿°ÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿ¾¯œÿÀ¯šÿÀ¯šÿÀ¯šÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÂ±œÿÂ±œÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÂ±œÿÂ±œÿ¿±›ÿ¿±›ÿ¿±›ÿ¿±›ÿ¿±›ÿÀ²œÿÀ²œÿÁ³ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿ¿±›ÿ¿±›ÿ¿±›ÿ¿±›ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿ¿±›ÿ¿±›ÿ¿±›ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÄµ¢ÿÄµ¢ÿÄµ¢ÿÄµ¢ÿÄµ¢ÿÄµ¢ÿÄµ¢ÿÄµ¢ÿÄ´£ÿÄ´£ÿÄ´£ÿÄ´£ÿÄ´£ÿÃ³¢ÿÃ³¢ÿÃ³¢ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿ¿®™ÿ¿®™ÿ¿®™ÿ¿®™ÿÀ¯šÿÀ¯šÿÀ¯šÿÀ¯šÿ½¬—ÿ½¬—ÿ¿®™ÿÀ¯šÿÁ°›ÿÁ°›ÿÁ°›ÿÀ¯šÿ¾¯œÿ¾¯œÿ½®›ÿ½®›ÿ¾¯œÿ¾¯œÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿ¿°ÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÁ°›ÿÂ±œÿÂ±œÿÂ±œÿÃ²ÿÂ±œÿÂ±œÿÂ±œÿÂ±œÿÂ±œÿÂ±œÿÃ²ÿÀ²œÿ¿±›ÿ¿±›ÿ¿±›ÿ¿±›ÿÀ²œÿÁ³ÿÁ³ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿ¿±›ÿ¿±›ÿ¿±›ÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÁ³ÿÂ´žÿÂ´žÿÂ´žÿÁ³ÿÁ³ÿÀ²œÿÀ²œÿÁ³ÿÁ³ÿÂ´žÿÃµŸÿÂ³ ÿÂ³ ÿÂ³ ÿÂ³ ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÃ´¡ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÄ´£ÿÄ´£ÿÄ´£ÿÄ´£ÿÄ´£ÿÃ³¢ÿÃ³¢ÿÃ³¢ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÅ¶£ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÆ³žÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÈµ ÿÈµ ÿÇ´ŸÿÆ³žÿÅ²ÿÅ²ÿÅ²ÿÆ³žÿÇ´ŸÿÈµ ÿÅ²ÿÅ²ÿÆ³žÿÇ´ŸÿÇ´ŸÿÆ³žÿÅ²ÿÅ²ÿÇ´ŸÿÇ´ŸÿÆ³žÿÆ³žÿÇ´ŸÿÇ´ŸÿÈµ ÿÈµ ÿÉ¶¡ÿÈµ ÿÇ´ŸÿÆ³žÿÆ³žÿÇ´ŸÿÈµ ÿÉ¶¡ÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÈµ ÿÈµ ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÈµ ÿÈµ ÿÈµ ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÊ·¢ÿÉ¶¡ÿÈµ ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿÈ´¢ÿÉµ£ÿÉµ£ÿÊ¶¤ÿË·¥ÿË·¥ÿÌ¸¦ÿÌ¸¦ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿË¸£ÿÊ·¢ÿÊ·¢ÿÉ¶¡ÿÈµ ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÍº¥ÿÌ¹¤ÿË¸£ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÆ³žÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÈµ ÿÈµ ÿÈµ ÿÇ´ŸÿÇ´ŸÿÆ³žÿÆ³žÿÆ³žÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÆ³žÿÆ³žÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÈµ ÿÉ¶¡ÿÈµ ÿÈµ ÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÈµ ÿÈµ ÿÈµ ÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÇ´ŸÿÈµ ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿÊ¶¤ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÊ·¢ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÆµ ÿÆµ ÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÄ³žÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÆµ ÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÆµ ÿÆµ ÿÈµ ÿÈµ ÿÇ´ŸÿÇ´ŸÿÈµ ÿÈµ ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÇ´ŸÿÈµ ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿË¸£ÿÊ·¢ÿÊ·¢ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÊ·¢ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË·¥ÿË¸£ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÍº¥ÿÍº¥ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÊ·¢ÿÉ¶¡ÿÉ¶¡ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÆµ ÿÆµ ÿÆµ ÿÅ´ŸÿÆµ ÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÄ³žÿÄ³žÿÆµ ÿÅ´ŸÿÄ³žÿÄ³žÿÅ´ŸÿÆµ ÿÇ¶¡ÿÈ·¢ÿÆµ ÿÆµ ÿÆµ ÿÅ´ŸÿÆµ ÿÆµ ÿÇ¶¡ÿÈ·¢ÿÅ´ŸÿÆµ ÿÇ¶¡ÿÈ·¢ÿÈ·¢ÿÇ¶¡ÿÆµ ÿÅ´ŸÿÉ¶¡ÿÈµ ÿÈµ ÿÈµ ÿÈµ ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÈµ ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿË¸£ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÍº¥ÿÍº¥ÿË¸£ÿÌ¹¤ÿÍº¥ÿÍº¥ÿÍº¥ÿÌ¹¤ÿË¸£ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÄ³žÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÆµ ÿÆµ ÿÆµ ÿÇ¶¡ÿÅ´ŸÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÅ´ŸÿÄ³žÿÆµ ÿÅ´ŸÿÄ³žÿÄ³žÿÅ´ŸÿÆµ ÿÇ¶¡ÿÈ·¢ÿÇ¶¡ÿÆµ ÿÆµ ÿÆµ ÿÆµ ÿÇ¶¡ÿÈ·¢ÿÈ·¢ÿÆµ ÿÇ¶¡ÿÈ·¢ÿÈ·¢ÿÈ·¢ÿÈ·¢ÿÇ¶¡ÿÆµ ÿÉ¶¡ÿÉ¶¡ÿÈµ ÿÈµ ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿÊ·¢ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿË·¥ÿÌ¸¦ÿÌ¸¦ÿÍ¹§ÿÍ¹§ÿÎº¨ÿÎº¨ÿÏ»©ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÍº¥ÿÍº¥ÿÍº¥ÿÍº¥ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÍº¥ÿÎ»¦ÿÍº¥ÿÌ¹¤ÿË¸£ÿÊ·¢ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÆµ ÿÆµ ÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÇ¶¡ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÆµ ÿÆµ ÿÅ´ŸÿÅ´ŸÿÅ´ŸÿÆµ ÿÆµ ÿÇ¶¡ÿÈ·¢ÿÇ¶¡ÿÇ¶¡ÿÇ¶¡ÿÆµ ÿÇ¶¡ÿÇ¶¡ÿÈ·¢ÿÉ¸£ÿÇ¶¡ÿÇ¶¡ÿÈ·¢ÿÈ·¢ÿÈ·¢ÿÈ·¢ÿÇ¶¡ÿÇ¶¡ÿÊ·¢ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿÊ·¢ÿÉ¶¡ÿÊ·¢ÿÊ·¢ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿË·¥ÿË·¥ÿÌ¸¦ÿÍ¹§ÿÎº¨ÿÎº¨ÿÏ»©ÿÏ»©ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÎ»¦ÿÎ»¦ÿÎ»¦ÿÍº¥ÿÍº¥ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÅ´¡ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÆµ¢ÿÆµ¢ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÆµ¢ÿÆµ¢ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÉ¸¥ÿÉ¸¥ÿÉ¸¥ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÉ¸¥ÿÈ·¤ÿÈ·¤ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÈ·¤ÿÉ¸¥ÿÉ¸¥ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÉ¸¥ÿÉ¸¥ÿÉ¸¥ÿÊ¹¦ÿÊ¹¦ÿÉ¸¥ÿÉ¸¥ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÉ¸¥ÿÉ¸¥ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÉ¸¥ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÉ¸¥ÿÊ¹¦ÿÊ¹¦ÿËº§ÿËº§ÿËº§ÿÌ»¨ÿÌ»¨ÿÌ»¨ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº¥ÿËº¥ÿËº¥ÿÊ¹¤ÿÊ¹¤ÿÊ¹¤ÿËº¥ÿËº¥ÿÌ»¦ÿÌ»¦ÿÌ»¦ÿÌ»¦ÿËº¥ÿËº¥ÿËº¥ÿËº¥ÿËº§ÿËº§ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÇ¶£ÿÆµ¢ÿÆµ¢ÿÆµ¢ÿÇ¶£ÿÈ·¤ÿÉ¸¥ÿÆµ¢ÿÇ¶£ÿÈ·¤ÿÉ¸¥ÿÉ¸¥ÿÈ·¤ÿÇ¶£ÿÆµ¢ÿÈ·¤ÿÈ·¤ÿÇ¶£ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÉ¸¥ÿÉ¸¥ÿÊ¹¦ÿÉ¸¥ÿÈ·¤ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÉ¸¥ÿÊ¹¦ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÇ¶£ÿÈ·¤ÿÈ·¤ÿÉ¸¥ÿÊ¹¦ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÈ·¤ÿÉ¸¥ÿÉ¸¥ÿÉ¸¥ÿÊ¹¦ÿÇ¶£ÿÇ¶£ÿÈ·¤ÿÉ¸¥ÿÊ¹¦ÿÊ¹¦ÿÉ¸¥ÿÉ¸¥ÿÈ·¤ÿÉ¸¥ÿÉ¸¥ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿÉ¸¥ÿÌ»¨ÿÌ»¨ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿÌ»¨ÿÌ»¨ÿÌ»¨ÿÌ»¨ÿÌ»¨ÿÌ»¨ÿÌ»¨ÿÌ»¨ÿÍ¼§ÿÌ»¦ÿËº¥ÿËº¥ÿËº¥ÿËº¥ÿËº¥ÿËº¥ÿÊ¹¤ÿËº¥ÿËº¥ÿËº¥ÿÌ»¦ÿÌ»¦ÿÍ¼§ÿÍ¼§ÿÍ¼©ÿÍ¼©ÿËº§ÿÊ¹¦ÿÊ¹¦ÿÊ¹¦ÿËº§ÿÌ»¨ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿËº§ÿÊ·¢ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿÊ·¢ÿÊ·¢ÿÉ¶¡ÿÈµ ÿÉ¶¡ÿË¸£ÿÌ¹¤ÿÉ¶¡ÿÇ´ŸÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÍ¶ ÿÍ¶ ÿÎ·¡ÿÎ·¡ÿÎ·¡ÿÎ·¡ÿÍ¶ ÿÍ¶ ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÎ·¡ÿÎ·¡ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÎ·¡ÿÎ·¡ÿÎ·¡ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÎ·¡ÿÎ·¡ÿÎ·¡ÿÎ·¡ÿÏ¸¢ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÎ·¡ÿÎ·¡ÿÎ·¡ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÑº¤ÿÑº¤ÿÑº¤ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÒ»¥ÿÑº¤ÿÑº¤ÿÐ¹£ÿÐ¹£ÿÑº¤ÿÑº¤ÿÒ»¥ÿË¸£ÿË¸£ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿË¸£ÿÌ¹¤ÿÊ·¢ÿÈµ ÿÈµ ÿÉ¶¡ÿË¸£ÿÊ·¢ÿÉ¶¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÍ¶ ÿÎ·¡ÿÎ·¡ÿÏ¸¢ÿÏ¸¢ÿÎ·¡ÿÎ·¡ÿÍ¶ ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÎ·¡ÿÎ·¡ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÐ¹£ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÑº¤ÿÑº¤ÿÐ¹£ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÍº¥ÿË¸£ÿÈµ ÿÇ´ŸÿÈµ ÿÊ·¢ÿË¸£ÿÌ¹¤ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÌ·¡ÿÎ·¡ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÎ·¡ÿÎ¹£ÿÎ¹£ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÌ¹¤ÿÍº¥ÿÍº¥ÿÍº¥ÿÍº¥ÿÍº¥ÿÍº¥ÿÌ¹¤ÿÌ¹¤ÿË¸£ÿÉ¶¡ÿÉ¶¡ÿÉ¶¡ÿÊ·¢ÿË¸£ÿÌ¹¤ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÏ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÏº¤ÿÏº¤ÿÎ¹£ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÑº¤ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÏº¥ÿÏº¥ÿÏº¥ÿÏº¥ÿÏº¥ÿÏº¥ÿÏº¥ÿÏº¥ÿÌ·¢ÿÍ¸£ÿÎ¹¤ÿÎ¹¤ÿÍ¸£ÿÍ¸£ÿÍ¸£ÿÍ¸£ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÐ¹£ÿÐ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÍ¸¢ÿÎ¹£ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÎ¹£ÿÍ¸¢ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÑ¼¦ÿÑ¼¦ÿÑ¼¦ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÏº¥ÿÏº¥ÿÏº¥ÿÎ¹¤ÿÎ¹¤ÿÏº¥ÿÏº¥ÿÏº¥ÿË¶¡ÿÍ¸£ÿÏº¥ÿÏº¥ÿÎ¹¤ÿÍ¸£ÿÍ¸£ÿÍ¸£ÿÎ¹¤ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÎ¹£ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÐ¹£ÿÐ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÑ¼¦ÿÑ¼¦ÿÑ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÍ¹§ÿÍ¹§ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÍ¹§ÿÍ¹§ÿË·¥ÿÌ¸¦ÿÍ¹§ÿÍ¹§ÿË·¥ÿÊ¶¤ÿÌ¸¦ÿÎ»¦ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÌ¹¤ÿÎ¹¤ÿÎ¹¤ÿÎ¹¤ÿÎ¹¤ÿÎ¹¤ÿÎ¹¤ÿÏº¥ÿÏº¥ÿÑ¹¥ÿÑ¹¥ÿÐ¸¤ÿÐ¸¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÑ¼¦ÿÑ¼¦ÿÑ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÍ¹§ÿÍ¹§ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÌ¸¦ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿÍ¹§ÿË·¥ÿÉµ£ÿÉµ£ÿÍ¹§ÿÐ¼ªÿÍº¥ÿÍº¥ÿÍº¥ÿÍº¥ÿÏº¥ÿÏº¥ÿÏº¥ÿÏº¥ÿÎ¹¤ÿÎ¹¤ÿÏº¥ÿÏº¥ÿÑ¹¥ÿÑ¹¥ÿÐ¸¤ÿÐ¸¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÑ¼¦ÿÐ»¥ÿÏº¤ÿÎ¹£ÿÎ¹£ÿÏº¤ÿÐ»¥ÿÑ¼¦ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÑ¼¦ÿÑ¼¦ÿÏº¤ÿÏº¤ÿÏº¤ÿÏº¤ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÐ»¥ÿÑ¼¦ÿÑ¼¦ÿÑ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÑº¤ÿÑº¤ÿÐ¹£ÿÑº¤ÿÑº¤ÿÒ»¥ÿÓ¼¦ÿÔ½§ÿÐ¹£ÿÑº¤ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÓ¼¦ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÕ¾¨ÿ×ÀªÿÖ¿©ÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿ×Àªÿ×ÀªÿÖ¿©ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿ×Àªÿ×ÀªÿÖ¿©ÿÙÂ¬ÿØÁ«ÿÖ¿©ÿÔ½§ÿÔ½§ÿÕ¾¨ÿ×ÀªÿØÁ«ÿÖ¿©ÿ×Àªÿ×ÀªÿÖ¿©ÿÕ½§ÿÓ¼¦ÿ×¿©ÿÙÂ¬ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÔ½§ÿÓ¼¦ÿÒ»¥ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÕ¾¨ÿ×ÀªÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×ÀªÿÖ¿©ÿÖ¿©ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿ×ÀªÿØÁ«ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿ×ÀªÿÚÃ­ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÀªÿØÀªÿØÀªÿØÀªÿØÀªÿØÀªÿØÀªÿØÀªÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÒ»¥ÿÑº¤ÿÑº¤ÿÑº¤ÿÑº¤ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿ×ÀªÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÖ¿©ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿ×ÀªÿÖ¿©ÿ×Àªÿ×ÀªÿØÁ«ÿ×ÀªÿÖ¿©ÿ×ÀªÿÙÂ¬ÿÚÃ­ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÔ½§ÿÕ¾¨ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÕ¾¨ÿÖ¿©ÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÚÃ­ÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÖ¾¨ÿÖ¾¨ÿÖ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿÖ¿©ÿ×ÀªÿØÁ«ÿØÁ«ÿÖ¿©ÿÖ¿©ÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿ×ÀªÿÖ¿©ÿ×ÀªÿØÁ«ÿÙÂ¬ÿ×Àªÿ×ÀªÿÖ¿©ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÖ¿©ÿÕ¾¨ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÖ¾¨ÿÖ¾¨ÿÖ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿÖ¿©ÿ×ÀªÿØÁ«ÿØÁ«ÿ×ÀªÿÖ¿©ÿ×ÀªÿÙÂ¬ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÜÅ¯ÿÚÃ­ÿØÁ«ÿÖ¿©ÿÖ¿©ÿ×ÀªÿÙÂ¬ÿÚÃ­ÿØÁ«ÿ×ÀªÿÖ¿©ÿ×ÀªÿÙÂ¬ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÖ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿØÀªÿØÀªÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿÕ¾¨ÿ×ÀªÿØÁ«ÿØÁ«ÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿØÁ«ÿ×ÀªÿØÁ«ÿÚÃ­ÿÛÄ®ÿÚÃ­ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿØÀªÿØÀªÿØÀªÿØÀªÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿÕ¾¨ÿÖ¿©ÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÛÄ®ÿÜÅ¯ÿÚÃ­ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÙÂ¬ÿ×ÀªÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÙÂ¬ÿ×ÀªÿÛÅ¬ÿÙÃªÿ×Á¨ÿÖÀ§ÿÖ¿©ÿØÁ«ÿÚÃ­ÿÛÄ®ÿÞÆ²ÿÛÃ¯ÿÔ¿ªÿÒ½¨ÿÒ¼ªÿÓ½«ÿÔ¾¬ÿÓ¿®ÿÍ½¬ÿÊ»«ÿÉ¹©ÿÈ¹©ÿÈ¹©ÿÈ¹©ÿÇ·ªÿÇ·ªÿÈ¸«ÿÆ¹«ÿÈ¸¬ÿÈ¸«ÿÈ¸¬ÿÈ¸«ÿÈ¸¬ÿÇ·ªÿÈ¸«ÿÈ¸«ÿÉ¸«ÿÉ¸«ÿÉ¸«ÿË¸«ÿË¸©ÿÍ¸©ÿÏº«ÿÒ»¬ÿÒ»¬ÿÓ¼­ÿÓ¼­ÿÔ»«ÿÔº¬ÿÓºªÿÓ¹«ÿÑºªÿÓ¹«ÿÒ»«ÿÓ¼­ÿÔ½®ÿÔ½®ÿÓ¾¯ÿÓ¾¯ÿÒ½®ÿÑ¼­ÿÑ¼­ÿÐ»¬ÿÐ»¬ÿÐ»¬ÿÎ»¬ÿÊ¹¬ÿÉ¸«ÿÈ¸«ÿÉ¹¬ÿË»¯ÿÌ¼°ÿÊ»²ÿÇº²ÿÆ¸²ÿÅ¹³ÿÇ»·ÿÇ¼¸ÿÆº¸ÿÃº·ÿÁ¸µÿÀ¶¶ÿÁ¶¸ÿ¾¶·ÿ¾³µÿ¼´µÿ¾´´ÿ»³³ÿ»±±ÿ¹°­ÿ½´±ÿ¾µ²ÿÂ¶´ÿ¿¶²ÿ¾²°ÿº±­ÿº¯«ÿº°©ÿÂµ­ÿÂ¶¬ÿÅ¶­ÿÆ·®ÿÇ¸¯ÿÊº®ÿÊº®ÿË¹®ÿÊ¹¬ÿË¸«ÿË¸©ÿÏº«ÿÐ¼«ÿÎº©ÿË´¤ÿÆ°žÿ×ÀªÿØÁ«ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿÛÅ¬ÿÚÄ«ÿØÂ©ÿ×Á¨ÿ×ÀªÿØÁ«ÿÚÃ­ÿÛÄ®ÿÜÄ°ÿÙÁ­ÿÔ¾¬ÿÒ¼ªÿÒ¼ªÿÓ½«ÿÔ½­ÿÒ¾­ÿÏ¿¯ÿÍ¾®ÿË¼¬ÿË¼¬ÿÊ»«ÿÊ»«ÿÈ¸«ÿÇ·ªÿÇ·ªÿÇ·ªÿÆ¶©ÿÆ¶©ÿÇ·ªÿÇ·ªÿÈ¸«ÿÉ¹¬ÿË»«ÿË»«ÿÊºªÿÊºªÿÌ¹ªÿÌ¹ªÿÏº«ÿÏº«ÿÒ»¬ÿÒ»¬ÿÕ»­ÿÕ»­ÿÕ»­ÿÕ»­ÿÕº¬ÿÔº¬ÿÕ»­ÿÓ¼­ÿÒ»¬ÿÒ»¬ÿÒ»¬ÿÒ»¬ÿÏº«ÿÏº«ÿÑ¼­ÿÑ¼­ÿÐ»¬ÿÐ»¬ÿÐ»¬ÿÐ»¬ÿÑ¼­ÿÏ¼­ÿÎ»®ÿËº­ÿÉ¹¬ÿÊº­ÿË»¯ÿÌ¼°ÿÉº±ÿÈ¹°ÿÇº²ÿÇ¹³ÿÆº¶ÿÆº¶ÿÅ¹·ÿÄ¸¶ÿÃ·µÿÂ¶´ÿÁ··ÿÀ¶¶ÿ¿´¶ÿÀ¶¶ÿÀ¶¶ÿÀ·´ÿ¾µ²ÿ¾²°ÿÁµ³ÿÁ¶²ÿÀµ±ÿ¾³¯ÿ½²®ÿ½³¬ÿ¾´­ÿÀµ­ÿÈ¹°ÿÉº±ÿÊ»²ÿË½±ÿÎ¾²ÿÏ¿²ÿÑÀ³ÿÑÁ±ÿÏ¼­ÿÐ½®ÿÒ¾­ÿÒ¾­ÿÓ½«ÿÐº¨ÿÍ·¥ÿÊ´¢ÿÖ¿©ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÙÃªÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿ×Â­ÿÕÀ«ÿÓ½«ÿÓ½«ÿÓ½«ÿÓ½«ÿÓ½«ÿÐ¼ªÿÐ¾­ÿÎ¾­ÿÎ¾­ÿÎ¾­ÿÎ¾®ÿÍ½­ÿÌ¼¬ÿÊºªÿÊºªÿÊºªÿÊºªÿÊºªÿÊ¹¬ÿËº­ÿÍ¼¯ÿÍ¼¯ÿÍ½­ÿÌ¼¬ÿË»«ÿÊºªÿÌ¹ªÿÍº«ÿÐ»¬ÿÑ¼­ÿÓ¼­ÿÓ¼­ÿÖ¼®ÿÖ¼®ÿÖ¼®ÿÖ¼®ÿÖ»­ÿÕ»­ÿÕ»­ÿÓ¼­ÿÓ¼­ÿÓ¼­ÿÓ¼­ÿÒ»¬ÿÐ»¬ÿÐ»¬ÿÏº«ÿÏº«ÿÏº«ÿÏº«ÿÐ»¬ÿÑ¼­ÿÒ½®ÿÐ½®ÿÐ½®ÿÍ½­ÿÊº­ÿË»®ÿÌ¼°ÿÌ¼°ÿÉº±ÿÇ¸¯ÿÇº²ÿÇº²ÿÅ¹³ÿÅ¹³ÿÅ¹µÿÄ¸´ÿÃ¸´ÿÃ·µÿÃ·µÿÃ·µÿÂ¶¶ÿÃ·µÿÅ¹·ÿÅ¹·ÿÄ¸¶ÿÃ·³ÿÄ¸´ÿÂ¶°ÿ¿³­ÿ¾²¬ÿ¿³­ÿÁµ¯ÿÄ¸²ÿÆ»³ÿÌ½´ÿÏ¿³ÿÏ¿³ÿÐÀ´ÿÑ¿´ÿÑÀ³ÿÓÀ³ÿÓÀ±ÿÕÀ±ÿ×Ã²ÿÙÂ²ÿ×À°ÿÓ½«ÿÐº¨ÿÑ¹§ÿÒº¨ÿ×ÀªÿØÁ«ÿÚÃ­ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÚÃ­ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÔ¿ªÿÔ¿ªÿÓ½«ÿÔ¾¬ÿÔ¾¬ÿÔ¾¬ÿÒ¼ªÿÎº¨ÿÍ»ªÿÌ¼«ÿÍ½¬ÿÏ¿®ÿÏ¿¯ÿÏ¿¯ÿÎ¾®ÿÍ½­ÿÌ¼¬ÿÍ½­ÿÎ¾®ÿÎ¾®ÿÎ½°ÿÎ½°ÿÎ½°ÿÍ½­ÿÎ¾®ÿÍ½­ÿË»«ÿÊºªÿÌ¹ªÿÍº«ÿÑ¼­ÿÒ½®ÿÕ¾¯ÿÕ¾¯ÿ×½¯ÿ×½¯ÿ×½¯ÿ×½¯ÿØ½¯ÿ×½¯ÿÓ¼­ÿÓ¼­ÿÔ½®ÿÕ¾¯ÿÕ¾¯ÿÖ¿°ÿÕÀ±ÿÕÀ±ÿÐ»¬ÿÐ»¬ÿÏº«ÿÏº«ÿÐ»¬ÿÐ»¬ÿÑ¼­ÿÐ½®ÿÐ½®ÿÍ½­ÿË»®ÿÌ¼¯ÿÍ½±ÿÍ½±ÿÊ»²ÿÉº±ÿÊº³ÿÈ»³ÿÇ¹³ÿÄ¸²ÿÄ¸²ÿÄ¸´ÿÅ¹µÿÄ¹µÿÅ¹µÿÃ¸´ÿÄ·µÿÄ¹µÿÆº¶ÿÆº¶ÿÅ¹µÿÄ¸²ÿÄ¸²ÿÂ·¯ÿÂ´®ÿÀµ­ÿÄ¶°ÿÆ»³ÿË¾¶ÿÌÀ¶ÿÑÁµÿÑÁ´ÿÒÀµÿÒÁ´ÿÑÀ³ÿÐÀ°ÿÑ¾¯ÿÐ¾­ÿÖÂ±ÿØÄ³ÿÚÃ³ÿ×Á¯ÿÔ¾¬ÿÒ¼ªÿÕ½«ÿÖ¾¬ÿÚÂ¬ÿÛÃ­ÿÝÅ¯ÿÝÅ¯ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÝÅ¯ÿÛÃ­ÿÙÁ«ÿÙÁ«ÿÚÂ¬ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÓ¾©ÿÓ¾©ÿÔ¿ªÿÕÀ«ÿÖÀ®ÿÕ¿­ÿÓ½«ÿÏ»©ÿÎ½ªÿÏ¾«ÿÐ¿¬ÿÐ¿¬ÿÐ¾­ÿÏ½¬ÿÎ¼«ÿÎ¼«ÿÎ¼«ÿÐ¾­ÿÒÀ¯ÿÔÂ±ÿÓÀ±ÿÑ¾¯ÿÎ»¬ÿÌ¹ªÿÒ¿°ÿÑ¿®ÿÏ½¬ÿÎ¼«ÿÎ¼«ÿÏ½¬ÿÓ¿®ÿÔÀ¯ÿÖ¿¯ÿÖ¿¯ÿÖ¿¯ÿÖ¿¯ÿØ¿¯ÿØ¿¯ÿØ¿¯ÿØ¿¯ÿÔ½­ÿÕ¾®ÿÕ¾®ÿÖ¿¯ÿ×À°ÿØÁ±ÿØÁ±ÿÙÂ²ÿÓ¿®ÿÒ¾­ÿÒ¾­ÿÑ½¬ÿÑ½¬ÿÑ½¬ÿÑ½¬ÿÏ½¬ÿÐ½®ÿÍ½­ÿÍ½­ÿÎ¾®ÿÎ¾±ÿÏ¿²ÿÏ¿³ÿÌ¾²ÿË¼³ÿÉ½³ÿÈ»³ÿÇº²ÿÇº²ÿÇ¹³ÿÈº´ÿÆº´ÿÇ¹³ÿÅ¹³ÿÆ·´ÿÅ¹³ÿÈº´ÿÈº´ÿÆ¸²ÿÅ¸°ÿÆ¹±ÿÅ¹¯ÿÇ·°ÿÇ»±ÿÌ¼µÿÌÀ¶ÿÐÁ¸ÿÏÁµÿÓÂµÿÓÃ³ÿÕÂµÿÕÂ³ÿÕÂ³ÿÔÁ²ÿÖÁ²ÿÕÁ°ÿØÁ±ÿØÂ°ÿ×Á¯ÿÖÀ®ÿ×¿­ÿ×¿«ÿØÀ¬ÿØÀ¬ÿÛÃ­ÿÝÅ¯ÿÞÆ°ÿÝÅ¯ÿÛÃ­ÿÚÂ¬ÿÚÂ¬ÿÛÃ­ÿÜÄ®ÿÛÃ­ÿÚÂ¬ÿÚÂ¬ÿÛÃ­ÿÜÄ®ÿÛÃ­ÿÛÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÔ¿ªÿÔ¿ªÿÕÀ«ÿÖÁ¬ÿØÂ°ÿ×Á¯ÿÕ¿­ÿÓ½«ÿÕÁ¯ÿÓÂ¯ÿÓÂ¯ÿÑÀ­ÿÏ½¬ÿÎ¼«ÿÍ»ªÿÍ»ªÿÑ¿®ÿÓÁ°ÿÕÃ²ÿÖÄ³ÿÖÃ´ÿÓÀ±ÿÐ½®ÿÎ¼«ÿÔÂ±ÿÓÁ°ÿÓÁ°ÿÒÀ¯ÿÒÀ¯ÿÓÁ°ÿÕÁ°ÿÖÂ±ÿØÁ±ÿØÁ±ÿ×À°ÿ×À°ÿÙÀ°ÿÙÀ°ÿÚÁ±ÿÚÁ±ÿØÁ±ÿØÁ±ÿØÁ±ÿØÁ±ÿ×À°ÿ×À°ÿ×À°ÿ×À°ÿÕÁ°ÿÕÁ°ÿÔÀ¯ÿÓ¿®ÿÒ¾­ÿÒ¾­ÿÒ¾­ÿÐ¾­ÿÑ¾¯ÿÎ¾®ÿÎ¾®ÿÏ¿¯ÿÐÀ³ÿÑÁ´ÿÑÁµÿÐÀ´ÿÎ¾²ÿÌ½´ÿÌ½´ÿÊ½µÿÊ½µÿÉ¼´ÿÉ¼´ÿÉ¼´ÿÉ¼´ÿÈ»³ÿÉ¹²ÿÈ»³ÿË»´ÿÉ½³ÿÊ»²ÿÈ¹°ÿÊ»²ÿË½±ÿÎ½´ÿÎÀ´ÿÒÂ¶ÿÑÃ·ÿÓÃ·ÿÒÂµÿÒ¿°ÿÓÁ°ÿÕÂ³ÿ×Å´ÿØÅ¶ÿÚÆµÿÚÆµÿÚÆ´ÿÙÃ±ÿØÂ°ÿÖÀ®ÿÖÁ¬ÿÙÁ­ÿÚÂ®ÿÚÂ®ÿÙÁ­ÿÛÃ­ÿÜÄ®ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÜÄ®ÿÛÃ­ÿÚÂ¬ÿÛÃ­ÿÜÄ®ÿÜÄ®ÿÛÃ­ÿÚÂ¬ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÁ­ÿÙÁ­ÿÖÁ¬ÿÕÀ«ÿÖÁ¬ÿ×Â­ÿÙÄ¯ÿÙÄ¯ÿ×Â­ÿÖÁ¬ÿ×Ä¯ÿ×Ä¯ÿÖÃ®ÿÔÁ¬ÿÓ¿­ÿÒ¾¬ÿÓ¿­ÿÕÁ¯ÿÖÂ°ÿ×Ã±ÿØÄ²ÿØÄ²ÿÙÅ´ÿØÄ³ÿ×Ã²ÿ×Ã²ÿÖÂ±ÿ×Ã±ÿ×Ã±ÿ×Ã±ÿ×Ã±ÿ×Ã±ÿÙÃ±ÿØÂ°ÿÙÃ±ÿÙÃ±ÿØÂ°ÿØÂ°ÿÚÂ°ÿÚÂ°ÿÛÃ±ÿÛÃ±ÿÚÄ²ÿÚÄ²ÿÙÃ±ÿÙÃ±ÿÙÃ±ÿÙÃ±ÿØÂ°ÿØÂ°ÿØÂ°ÿØÂ°ÿÕÁ¯ÿÕÁ¯ÿÕÁ¯ÿÕÁ¯ÿÕÁ¯ÿÔÃ°ÿÓÁ°ÿÐÀ¯ÿÐÀ°ÿÑÁ±ÿÒÂ²ÿÓÃ³ÿÒÁ´ÿÐÀ³ÿÏ¿²ÿÐÀ´ÿÑÁµÿÏÀ·ÿÏÀ·ÿÎ¿¶ÿÍ¾µÿÌ½´ÿÌ½´ÿË¼³ÿÍ¼³ÿÍ¾µÿÐ¿¶ÿÏÁµÿÐÀ´ÿÏ¿³ÿÐÀ´ÿÑÁ´ÿÔÂ·ÿÓÃ¶ÿÕÄ·ÿÔÄ·ÿÕÄ·ÿÕÅµÿÔÂ±ÿ×Ã±ÿÙÅ´ÿÚÆ´ÿÛÇ¶ÿÝÇµÿÜÆ´ÿÜÆ´ÿÝÅ³ÿÜÄ°ÿÛÃ¯ÿÜÄ°ÿÜÄ°ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÙÁ«ÿÛÃ­ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÛÃ­ÿÛÃ­ÿÜÄ®ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÜÄ®ÿÝÅ¯ÿÝÅ¯ÿÛÃ­ÿÙÁ«ÿÞÇ±ÿÝÆ°ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÂ®ÿÚÂ®ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿØÃ®ÿÙÄ¯ÿÚÅ°ÿÙÄ¯ÿ×Â­ÿÖÃ®ÿÖÃ®ÿÖÃ®ÿÕÂ­ÿÕÁ¯ÿ×Ã±ÿÚÆ´ÿÜÈ¶ÿÖÂ°ÿÖÂ°ÿÕÁ¯ÿÕÁ¯ÿÖÂ±ÿØÄ³ÿÙÅ´ÿÛÇµÿÕÁ¯ÿÖÂ°ÿ×Ã±ÿØÄ²ÿØÄ²ÿ×Ã±ÿØÂ°ÿ×Á¯ÿÚÄ²ÿÙÃ±ÿÙÃ±ÿØÂ°ÿÚÂ°ÿÛÃ±ÿÛÃ±ÿÜÄ²ÿÙÃ±ÿÙÃ±ÿÚÄ²ÿÚÄ²ÿÛÅ³ÿÜÆ´ÿÝÇµÿÝÇµÿØÂ°ÿØÂ°ÿÖÂ°ÿÖÂ°ÿÖÂ°ÿ×Ã±ÿØÄ²ÿØÄ²ÿÖÄ³ÿÒÂ±ÿÑÁ±ÿÒÂ²ÿÓÃ³ÿÓÃ³ÿÒÂ²ÿÑÀ³ÿÐÀ³ÿÑÁ´ÿÒÂµÿÓÃ·ÿÓÃ·ÿÐÂ¶ÿÐ¿¶ÿÎ¾²ÿÎ¾²ÿÎ¾±ÿÏ¿²ÿÑÁ´ÿÔÃ¶ÿÔÄ·ÿÕÄ·ÿÔÄ´ÿÔÃ¶ÿÕÅµÿÖÅ¸ÿÖÆ¶ÿÖÃ´ÿÔÄ³ÿØÅ¶ÿÙÇ¶ÿÝÉ·ÿÝÉ·ÿàÊ¸ÿàÊ¸ÿßÉ·ÿÝÇµÿÜÆ´ÿÚÅ°ÿßÇ³ÿßÇ³ÿßÇ³ÿßÇ³ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÆ°žÿÈ³žÿÍ·¥ÿÓ¾©ÿØÂ°ÿÙÄ¯ÿØÃ®ÿÙÁ­ÿÙÁ­ÿØÀ¬ÿØÀ¬ÿÙÂ¬ÿÚÂ®ÿÙÂ¬ÿ×¿«ÿÖ¾¨ÿÙÁ«ÿÙÁ«ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÙÁ«ÿ×Àªÿ×¿©ÿÕ¾¨ÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÚÅ¯ÿÛÄ®ÿØÃ­ÿÛÄ®ÿÜÅ¯ÿÞÇ±ÿÜÅ¯ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÝÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÂ¬ÿÙÁ«ÿØÀªÿØÀªÿÚÂ¬ÿÚÂ¬ÿÙÁ«ÿØÀªÿÚÂ¬ÿÜÄ®ÿÝÅ¯ÿÜÄ®ÿÛÃ­ÿÙÂ¬ÿÚÂ¬ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿ×Àªÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÅ¯ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÄ®ÿÛÄ®ÿÛÄ®ÿÌ´ ÿÎ¶¢ÿÒº¦ÿ×¿«ÿÚÂ®ÿÛÃ¯ÿÚÂ®ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿØÁ«ÿÙÂ¬ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿØÁ«ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÚÂ¬ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÚÂ¬ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÚÂ¬ÿÙÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÜÄ®ÿÛÃ­ÿÚÂ¬ÿÛÃ­ÿÜÄ®ÿÜÄ®ÿÛÃ­ÿÚÂ¬ÿÙÁ«ÿÛÃ­ÿÜÄ®ÿÜÄ®ÿÛÃ­ÿÛÃ­ÿÜÄ®ÿÝÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÑ¹¥ÿÔ¼¨ÿ×¿«ÿÚÂ®ÿÛÃ¯ÿÛÃ¯ÿÚÂ®ÿÚÂ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÛÃ­ÿÜÄ®ÿÜÄ®ÿÛÃ­ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÙÂ¬ÿÛÄ®ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿÞÆ°ÿÝÅ¯ÿÛÃ­ÿØÀªÿÚÂ¬ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿÞÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÕ½©ÿØÀ¬ÿÛÃ¯ÿÜÄ°ÿÜÄ°ÿÜÄ°ÿÜÄ°ÿÜÄ°ÿÝÆ°ÿÜÅ¯ÿÚÃ­ÿÚÃ­ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÝÆ°ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÝÅ¯ÿÝÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÛÄ®ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿÞÆ°ÿÜÄ®ÿÛÃ­ÿÙÁ«ÿÛÃ­ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿÞÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿØÀ¬ÿÚÂ®ÿÜÄ°ÿÝÅ±ÿÝÅ±ÿÝÅ±ÿÞÆ²ÿßÇ³ÿàÉ³ÿÞÇ±ÿÜÅ¯ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÛÄ®ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÚÂ®ÿÛÃ¯ÿÝÅ±ÿÝÅ±ÿÞÆ²ÿÞÆ²ÿßÇ³ÿàÈ´ÿàÉ³ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿßÈ²ÿÞÇ±ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÞÇ±ÿßÈ²ÿßÈ²ÿÝÆ°ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÞÆ²ÿÝÅ±ÿÜÄ°ÿÝÅ±ÿÝÅ±ÿÞÆ²ÿÞÆ²ÿÞÆ²ÿßÈ²ÿÞÇ±ÿÝÆ°ÿÞÇ±ÿßÈ²ÿßÈ²ÿÞÇ±ÿÜÅ¯ÿàÉ³ÿßÈ²ÿÞÇ±ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿßÈ²ÿÞÇ±ÿÞÇ±ÿßÈ²ÿßÈ²ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿßÈ²ÿÞÇ±ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿßÈ²ÿßÈ²ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿßÈ²ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿßÈ²ÿßÈ²ÿÝÆ°ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿàÈ´ÿÞÆ²ÿÜÄ°ÿÜÄ°ÿÝÅ±ÿÞÆ²ÿÝÅ±ÿÜÄ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿßÈ²ÿáÊ´ÿáÊ´ÿßÈ²ÿÞÇ±ÿáÊ´ÿàÉ³ÿßÈ²ÿÞÇ±ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿßÈ²ÿÞÇ±ÿÞÇ±ÿßÈ²ÿàÉ³ÿàÉ³ÿàÉ³ÿßÈ²ÿßÈ²ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÞÇ±ÿßÈ²ÿßÈ²ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿßÈ²ÿàÉ³ÿßÈ²ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÞÇ±ÿßÈ²ÿàÉ³ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿßÈ²ÿßÈ²ÿÝÆ°ÿÛÄ®ÿÚÃ­ÿÛÄ®ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿßÈ²ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÚÄ«ÿÚÄ«ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÚÂªÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÚÂªÿÚÂªÿÚÂªÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÛÃ­ÿÙÁ©ÿØÂ©ÿÚÂªÿÚÄ«ÿÜÄ¬ÿÜÆ­ÿÞÆ®ÿÝÇ®ÿÜÄ¬ÿÛÅ¬ÿÜÄ¬ÿÚÄ«ÿÛÃ«ÿÛÅ¬ÿÜÄ¬ÿÛÄ®ÿÛÄ®ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÚÂ®ÿÛÃ¯ÿÜÄ°ÿÜÄ°ÿÜÄ°ÿÛÃ¯ÿÚÂ®ÿÙÁ­ÿÜÆ´ÿØÄ²ÿØÂ°ÿÕÁ¯ÿÖÀ®ÿÕÁ¯ÿØÂ°ÿ×Ã±ÿÙÃ±ÿ×Ã±ÿØÂ°ÿÖÂ°ÿ×Á¯ÿÕÁ¯ÿ×Á¯ÿÖÀ®ÿ×Á¯ÿ×Â­ÿ×Á¯ÿÖÁ¬ÿ×Á¯ÿ×Â­ÿØÂ°ÿÙÄ¯ÿÙÃ±ÿØÃ®ÿØÂ°ÿØÃ®ÿ×Á¯ÿÖÁ¬ÿÖÀ®ÿÖÁ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿÕ½©ÿØÀ¬ÿÛÃ¯ÿÜÄ°ÿÙÁ­ÿ×¿«ÿÖ¾ªÿ×ÀªÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÝÆ°ÿÜÅ¯ÿÚÃ­ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÛÄ®ÿÜÅ¯ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÜÄ¬ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÛÅ¬ÿÛÅ¬ÿÚÄ«ÿÚÄ«ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÛÄ®ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÜÄ°ÿÝÅ±ÿÜÄ°ÿÛÃ¯ÿÚÂ®ÿÙÁ­ÿÙÃ±ÿÖÂ°ÿÕÁ¯ÿÕÁ¯ÿÕÁ¯ÿÕÁ¯ÿÖÂ°ÿ×Ã±ÿ×Ã±ÿ×Ã±ÿÖÂ°ÿÖÂ°ÿÖÂ°ÿÕÁ¯ÿÕÁ¯ÿÕÁ¯ÿ×Á¯ÿ×Á¯ÿ×Á¯ÿØÂ°ÿØÂ°ÿØÂ°ÿØÂ°ÿØÂ°ÿÖÀ®ÿÖÀ®ÿÖÀ®ÿ×Á¯ÿ×Á¯ÿØÂ°ÿØÂ°ÿØÃ®ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿØÀ¬ÿÚÂ®ÿÛÃ¯ÿÚÂ®ÿØÀ¬ÿ×¿«ÿØÀ¬ÿÙÁ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÚÂªÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÜÆ­ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÙÃªÿÜÆ­ÿÛÅ¬ÿÛÅ¬ÿÚÄ«ÿÚÄ«ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿØÃ®ÿØÃ®ÿØÃ®ÿØÃ®ÿØÃ®ÿØÃ®ÿØÃ®ÿØÃ®ÿØÃ®ÿØÀ¬ÿÙÁ­ÿÚÂ®ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÚÂ®ÿÚÂ®ÿØÀ¬ÿÙÁ­ÿÙÁ­ÿÚÂ®ÿÚÂ®ÿÛÃ¯ÿÛÃ¯ÿÛÃ¯ÿÙÁ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿØÁ«ÿØÁ«ÿÝÅ­ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÝÅ­ÿÞÆ®ÿÝÅ­ÿÝÅ­ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÝÅ­ÿÝÅ­ÿÝÅ­ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÜÆ­ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÜÆ­ÿÜÆ­ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÜÆ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÁ­ÿ×Â­ÿ×Â­ÿØÃ®ÿ×Â­ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×¿«ÿÙÁ­ÿÚÂ®ÿÜÄ°ÿÜÄ°ÿÛÃ¯ÿÚÂ®ÿÙÁ­ÿÜÄ°ÿÜÄ°ÿÜÄ°ÿÛÃ¯ÿÛÃ¯ÿÚÂ®ÿÚÂ®ÿÚÂ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÞÆ®ÿÝÅ­ÿÝÅ­ÿÜÄ¬ÿÜÄ¬ÿÝÅ­ÿÝÅ­ÿÞÆ®ÿßÇ¯ÿÞÆ®ÿÝÅ­ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÝÅ­ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÜÆ­ÿÜÆ­ÿÜÆ­ÿÝÇ®ÿÜÆ­ÿÜÆ­ÿÜÆ­ÿÜÆ­ÿÛÅ¬ÿÚÄ«ÿÙÃªÿØÂ©ÿÚÄ«ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÜÆ­ÿÜÆ­ÿÜÆ­ÿÜÆ­ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÜÆ­ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÞÆ°ÿÞÆ°ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿØÁ«ÿ×Àªÿ×ÀªÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿ×ÀªÿØÁ«ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÙÂ¬ÿ×ÀªÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÜÅ¯ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÞÆ®ÿÞÆ®ÿÞÆ®ÿÞÆ®ÿÞÆ®ÿÞÆ®ÿÞÆ®ÿÞÆ®ÿßÇ¯ÿÞÆ®ÿÝÅ­ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÝÅ­ÿÞÆ®ÿÛÅ¬ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÝÇ®ÿÝÇ®ÿÞÈ¯ÿÞÈ¯ÿÝÇ®ÿÝÇ®ÿÝÇ®ÿÜÆ­ÿÛÅ¬ÿÚÄ«ÿÙÃªÿÙÃªÿÚÄ«ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÜÆ­ÿÝÇ®ÿÞÈ¯ÿÞÈ¯ÿÝÇ®ÿÜÆ­ÿÜÆ­ÿÛÅ¬ÿÛÅ¬ÿÜÆ­ÿÜÆ­ÿÝÇ®ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÙÂ¬ÿÖ¿©ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÜÅ¯ÿÚÃ­ÿØÁ«ÿÖ¿©ÿÖ¿©ÿ×ÀªÿÙÂ¬ÿÚÃ­ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿàÈ²ÿÞÆ°ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿÞÆ°ÿßÇ±ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÝÅ­ÿÜÄ¬ÿÛÃ«ÿÚÂªÿÚÂªÿÚÂªÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÚÂªÿÚÂªÿÚÂªÿÚÂªÿÚÂªÿÚÂªÿÚÂªÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÛÃ«ÿØÀ¨ÿÙÁ©ÿÙÁ©ÿÚÂªÿÚÂªÿÛÃ«ÿÛÃ«ÿÛÃ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÜÆ­ÿÛÅ¬ÿÚÄ«ÿÛÅ¬ÿÝÇ®ÿÝÇ®ÿÚÄ«ÿØÂ©ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÝÅ¯ÿÝÅ¯ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÞÆ°ÿÝÅ¯ÿÝÅ¯ÿàÈ²ÿÞÆ°ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÝÅ¯ÿßÇ±ÿàÈ²ÿÞÇ±ÿÞÇ±ÿÞÇ±ÿÝÆ°ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÝÆ°ÿÞÇ±ÿßÈ²ÿßÈ²ÿßÈ²ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÝÆ°ÿÞÇ±ÿÝÆ°ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÝÆ°ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÝÅ¯ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÜÄ®ÿÛÃ­ÿÛÃ­ÿÛÃ«ÿÚÂªÿÙÁ©ÿØÀ¨ÿÙÁ©ÿÛÃ«ÿÜÄ¬ÿÞÆ®ÿÝÅ­ÿÝÅ­ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÚÂªÿÚÂªÿÛÃ«ÿÛÃ«ÿÚÂªÿÚÂªÿÛÃ«ÿÛÃ«ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÜÄ¬ÿÛÃ«ÿÛÃ«ÿÚÂªÿÚÂªÿÚÂªÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿßÉ°ÿÜÆ­ÿÚÄ«ÿÚÄ«ÿÜÆ­ÿÝÇ®ÿÜÆ­ÿÚÄ«ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÜÅ¯ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÚÃ­ÿÛÄ®ÿÜÅ¯ÿÜÅ¯ÿÚÃ­ÿØÁ«ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿ×¿«ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿ×¿«ÿ×¿«ÿÛÃ¯ÿÙÁ­ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿÙÁ­ÿÙÁ­ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿÛÃ¯ÿÚÂ®ÿÙÁ­ÿ×¿«ÿ×¿«ÿ×¿«ÿØÀ¬ÿÙÁ­ÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÕ½«ÿÙÁ¯ÿÜÄ²ÿÜÄ²ÿÙÁ¯ÿÖ¾¬ÿØÀ®ÿÚÂ°ÿÖÁ¬ÿÕÀ«ÿÕÀ«ÿÔ¿ªÿÔ¿ªÿÕÀ«ÿÕÀ«ÿÖÁ¬ÿÖÁ¬ÿÕÀ«ÿÕÀ«ÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÔ¿©ÿÔ¿©ÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÖ¾¨ÿÖ¾¨ÿÕ½§ÿÖ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿÖ¾¨ÿÖ¾¨ÿÕ½§ÿ×¿§ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿØÀ¬ÿ×¿«ÿÖ¾ªÿÛÃ¯ÿÙÁ­ÿ×¿«ÿ×¿«ÿØÀ¬ÿÙÁ­ÿØÀ¬ÿ×¿«ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿÙÁ­ÿÙÁ­ÿÙÁ­ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿÕ½«ÿØÀ®ÿÚÂ°ÿÙÁ¯ÿÖ¾¬ÿÔ¼ªÿÖ¾¬ÿØÀ®ÿÕÀ«ÿÕÀ«ÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÕÀ«ÿÕÀ«ÿÖÁ¬ÿÕÀ«ÿÕÀ«ÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÕÀ«ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÖ¾¨ÿÖ¾¨ÿÕ½§ÿÖ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿÖ¾¨ÿÖ¾¨ÿÕ½§ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿ×ÀªÿÖ¿©ÿÚÃ­ÿÙÂ¬ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÕ¾¨ÿÖ¿©ÿØÁ«ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿÖ¾ªÿØÀ¬ÿÙÁ­ÿ×¿«ÿÕ½«ÿÔ¼ªÿÕ½«ÿØÀ®ÿÕÀ«ÿÕÀ«ÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÕÀ«ÿÕÀ«ÿÖÁ¬ÿÖÁ¬ÿÕÀ«ÿÔ¿ªÿÔ¿ªÿÔ¿ªÿÕÀ«ÿÕÀ«ÿÖ¿©ÿÖ¿©ÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÖ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿÖ¾¨ÿÖ¾¨ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿ×¿§ÿ×¿§ÿØÀ¨ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÛÄ®ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÜÅ¯ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿ×Àªÿ×ÀªÿÚÃ­ÿØÁ«ÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÖ¿©ÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×¿«ÿ×¿«ÿ×¿«ÿ×¿«ÿÙÁ­ÿÚÂ®ÿÙÁ­ÿ×¿«ÿÕ½«ÿÕ½«ÿ×¿­ÿÙÁ¯ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÕÀ«ÿÖ¿©ÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿØÀªÿØÀªÿ×¿©ÿ×¿©ÿÖ¾¨ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÛÄ®ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÛÄ®ÿÛÄ®ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿÖ¿©ÿ×ÀªÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÚÃ­ÿØÁ«ÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿ×ÀªÿÖ¿©ÿ×Àªÿ×ÀªÿØÁ«ÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×Àªÿ×ÀªÿÛÄ®ÿÚÃ­ÿÙÁ­ÿØÀ¬ÿ×¿«ÿ×¿«ÿØÀ¬ÿÙÁ­ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿ×Â­ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿÕÀ«ÿÕÀ«ÿÖÁ¬ÿÖÁ¬ÿ×Àªÿ×Àªÿ×ÀªÿØÁ«ÿ×Àªÿ×ÀªÿÖ¿©ÿÕ¾¨ÿ×¿©ÿ×¿©ÿØÀªÿØÀªÿØÀªÿØÀªÿ×¿©ÿ×¿©ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿØÀ¨ÿØÀ¨ÿØÀ¨ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÖ¿©ÿÖ¿©ÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÚÃ­ÿÙÂ¬ÿ×Àªÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿ×ÀªÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿÛÄ®ÿÚÃ­ÿØÁ«ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÙÂ¬ÿÙÁ­ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿØÀ¬ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿØÃ®ÿ×Â­ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿØÁ«ÿ×Àªÿ×ÀªÿÖ¿©ÿ×¿©ÿØÀªÿØÀªÿÙÁ«ÿÙÁ«ÿØÀªÿØÀªÿ×¿©ÿØÀ¨ÿØÀ¨ÿØÀ¨ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿØÀ¨ÿØÀ¨ÿØÀ¨ÿØÀ¨ÿØÀ¨ÿ×¿§ÿ×¿§ÿ×¿§ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿØÁ«ÿ×ÀªÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿØÂ©ÿØÂ©ÿÙÃªÿÙÃªÿÙÃªÿØÂ©ÿ×Á¨ÿ×Á¨ÿÛÅ¬ÿÙÃªÿ×Á¨ÿ×Á¨ÿØÂ©ÿÙÃªÿØÂ©ÿ×Á¨ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿÙÃªÿÙÃªÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿÙÃªÿÙÃªÿÙÃªÿÙÃªÿÙÃªÿÙÃªÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿ×ÀªÿÖÁ¬ÿ×Â­ÿ×Â­ÿØÃ®ÿØÃ®ÿ×Â­ÿ×Â­ÿÖÁ¬ÿØÃ®ÿØÃ®ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿÖÁ¬ÿ×Â­ÿ×Â­ÿÖÁ«ÿ×Â¬ÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿ×Àªÿ×Àªÿ×ÀªÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿØÀªÿØÀªÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿ×¿©ÿÙÁ«ÿÙÁ«ÿØÀªÿØÀªÿØÀªÿØÀªÿ×¿©ÿ×¿©ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÚÃ­ÿÜÅ¯ÿÝÆ°ÿÜÅ¯ÿÛÄ®ÿÙÂ¬ÿØÁ«ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÙÃªÿ×Á¨ÿÖÀ§ÿÕ¿¦ÿÛÅ¬ÿÙÃªÿØÂ©ÿØÂ©ÿØÂ©ÿÙÃªÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿØÂ©ÿÖÀ§ÿ×Á¨ÿÙÃªÿÚÄ«ÿÚÄ«ÿÚÄ«ÿÙÃªÿØÂ©ÿ×Á¨ÿ×Á¨ÿ×Á¨ÿ×Á¨ÿ×Á¨ÿ×Á¨ÿ×Àªÿ×ÀªÿÙÂ¬ÿÙÂ¬ÿÙÂ¬ÿÚÃ­ÿÛÄ®ÿÛÄ®ÿÙÂ¬ÿ×ÀªÿÖÁ¬ÿÖÁ¬ÿ×Â­ÿ×Â­ÿ×Â­ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿØÃ®ÿØÃ®ÿ×Â­ÿ×Â­ÿÖÁ¬ÿÖÁ¬ÿ×Â­ÿ×Â­ÿ×Â¬ÿ×Â¬ÿÚÃ­ÿÚÃ­ÿÙÂ¬ÿÙÂ¬ÿØÁ«ÿØÁ«ÿ×Àªÿ×ÀªÿÙÁ«ÿÙÁ«ÿÙÁ«ÿÙÁ«ÿØÀªÿØÀªÿÖ¾¨ÿÖ¾¨ÿÖ¾¨ÿ×¿©ÿ×¿©ÿØÀªÿØÀªÿØÀªÿÙÁ«ÿÙÁ«ÿÙÁ«ÿØÀªÿØÀªÿØÀªÿØÀªÿØÀªÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿ×¾¤ÿ×¾¤ÿ×¾¤ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÒ»¡ÿÓ¼¢ÿÕ¾¤ÿÖ¿¥ÿÖ¿¥ÿÕ¾¤ÿÓ¼¢ÿÒ»¡ÿÑº ÿÑº ÿÒ»¡ÿÓ¼¢ÿÓ¼¢ÿÔ½£ÿÕ¾¤ÿÕ¾¤ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÒ»¥ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ½¤ÿÓ½¤ÿÖ¿©ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÒº¦ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÒº¤ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿ×¾¤ÿ×¾¤ÿ×¾¤ÿ×¾¤ÿÖ½£ÿÖ½£ÿÖ½£ÿÖ½£ÿÔ½£ÿÔ½£ÿÔ½£ÿÔ½£ÿÔ½£ÿÔ½£ÿÔ½£ÿÔ½£ÿÓ¼¢ÿÓ¼¢ÿÓ¼¢ÿÓ¼¢ÿÓ¼¢ÿÓ¼¢ÿÓ¼¢ÿÓ»£ÿÓ½¤ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ½¤ÿÓ½¤ÿÖ¿©ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÒº¦ÿÒº¦ÿÒº¦ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÓ»¥ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÓ»¥ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿÖ¼¤ÿÖ¼¤ÿÖ¼¤ÿÖ¼¤ÿÕ½¥ÿÕ½¥ÿÔ¼¤ÿÓ»£ÿÓ»£ÿÔ¼¤ÿÕ½¥ÿÕ½¥ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÓ»£ÿÓ»£ÿÓ»£ÿÓ»£ÿÓ½¤ÿÓ½¤ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÖ¿©ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÒº¦ÿÒº¦ÿÒº¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿØ¾¦ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿÖ¼¤ÿÖ¼¤ÿÖ¼¤ÿÕ½¥ÿÕ½¥ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÕ½¥ÿÕ½¥ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÔ¼¤ÿÓ½¤ÿÓ½¤ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ»§ÿÓ»§ÿÓ»§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÕ½©ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÓ»§ÿÓ»§ÿÓ»§ÿÓ»§ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÓ»¥ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÓ»¥ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿÖ¼¤ÿÓ»£ÿÔ¼¤ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÔ¼¤ÿÓ»£ÿÓ»£ÿÓ»£ÿÔ¼¤ÿÔ¼¤ÿÕ½¥ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿÓ½¤ÿÓ½¤ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ¼¨ÿÔ¼¨ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ»§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÐ¹£ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿØ¾¦ÿ×½¥ÿ×½¥ÿ×½¥ÿ×½¥ÿÓ»£ÿÔ¼¤ÿÖ¾¦ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÔ¼¤ÿÓ»£ÿÓ»£ÿÓ»£ÿÔ¼¤ÿÕ½¥ÿÕ½¥ÿÖ¾¦ÿ×¿§ÿ×¿§ÿÓ½¤ÿÓ½¤ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÔ¾¥ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÓ½¤ÿÔ¾¥ÿÕ¿¦ÿÕ¾¨ÿÖ¿©ÿÔ½§ÿÔ½§ÿÔ¼¨ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÑº¤ÿÐ¹£ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÔ¼¤ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÔ¼¤ÿÔ¼¤ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÓ¾£ÿÓ¾£ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÓ¾£ÿÓ¾£ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÕÀ¥ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¾¥ÿÔ¾¥ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÖ¾¬ÿÖ¾ªÿÖ¿©ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÖ¾ªÿÖ¾ªÿÖ¾ªÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÐ¹£ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿ×¿§ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÔ¼¤ÿÔ¼¤ÿÕ½¥ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÖ¾¦ÿÕ½¥ÿÕ½¥ÿÕ½¥ÿÓ¾£ÿÓ¾£ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÔ¿¤ÿÓ¾£ÿÓ¾£ÿÕÀ¥ÿÕÀ¥ÿÕÀ¥ÿÕÀ¥ÿÕÀ¥ÿÕÀ¥ÿÕÀ¥ÿÕÀ¥ÿ×Â§ÿÖÁ¦ÿÕÀ¥ÿÔ¿¤ÿÔ¾¥ÿÔ¾¥ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÕ½©ÿÕ½©ÿÕ½©ÿÖ¾ªÿÖ¾¬ÿÖ¾ªÿÖ¾ªÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ¼¨ÿÔ¼¨ÿÔ¼¨ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÖ¾ªÿÖ¾ªÿÕ½©ÿÕ½©ÿÕ½©ÿÕ½©ÿÔ¼¨ÿÔ¼¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÕ¾¨ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÔ½§ÿÔ½§ÿÒ»¥ÿÑº¤ÿÔ½§ÿÔ½§ÿÓ¼¦ÿÓ¼¦ÿÓ¼¦ÿÒ»¥ÿÒ»¥ÿÒ»¥ÿÒº¤ÿÑ¹¡ÿÑ¹£ÿÑ¹¡ÿÑ¹£ÿÒº¢ÿÓ»¥ÿÓ»£ÿÑ¹£ÿÑ¹¡ÿÑ¹£ÿÑ¹¡ÿÑ¹£ÿÒº¢ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÒº¤ÿÒº¤ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÏ·¡ÿÑ¹£ÿÒº¤ÿÑ¹£ÿÏ·¡ÿÍµŸÿÏ·¡ÿÑ¹£ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÒº¤ÿÒº¢ÿÒº¤ÿÒº¢ÿÑ¹£ÿÏ·ŸÿÎ¶ ÿÍµÿÏ·¡ÿÏ·ŸÿÏ·¡ÿÏ·ŸÿÏ·¡ÿÏ·ŸÿÏ·¡ÿÏ·ŸÿÐ¸ ÿÐ¹ŸÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÎ·ÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÏ¸žÿÐ¹ŸÿÑº ÿÐ¹ŸÿÎ·ÿÎ·ÿÎ·ÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÑ¸žÿÐ·ÿÐ¶žÿÐ·ÿÐ¶žÿÐ·ÿÐ¶žÿÏ¶œÿÑ·ŸÿÑ¸žÿÑ·ŸÿÑ¸žÿÐ¶žÿÐ·ÿÐ¶žÿÎ¶žÿÎ¶žÿÎ¶žÿÎ¶žÿÎ¶žÿÍµÿÍµÿÍµÿÍµÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÎ¶žÿÎ¶žÿÍµÿÍµÿÍµÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÓ»¥ÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÒº¤ÿÒº¤ÿÓ»¥ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÐ¸¢ÿÑ¹£ÿÒº¤ÿÑ¹£ÿÏ·¡ÿÎ¶ ÿÏ·¡ÿÑ¹£ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÏ·¡ÿÏ·¡ÿÐ¸¢ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸ ÿÐ¹ŸÿÐ¹ŸÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÎ·ÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÐ¹ŸÿÏ¸žÿÐ¹ŸÿÑº ÿÐ¹ŸÿÎ·ÿÎ·ÿÎ·ÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÏ¸žÿÐ¶žÿÐ¶žÿÐ¶žÿÐ¶žÿÐ¶žÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÐ¶žÿÐ¶žÿÐ¶žÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÎ¶žÿÎ¶žÿÎ¶žÿÎ¶žÿÍµÿÍµÿÍµÿÍµÿÎ¶žÿÎ¶žÿÎ¶žÿÎ¶žÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÐ¸¢ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹£ÿÒº¤ÿÓ»¥ÿÒº¤ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÑ¹£ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÎ¶ ÿÏ·¡ÿÐ¸¢ÿÒº¤ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÐ¸ ÿÑ¹¡ÿÐ¸ ÿÏ·ŸÿÎ¶žÿÏ·ŸÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏµÿÐ¶žÿÐ¶žÿÐ¶žÿÑ·ŸÿÑ·ŸÿÒ¸ ÿÒ¸ ÿÐ¶žÿÐ¶žÿÐ¶žÿÑ·ŸÿÑ·ŸÿÒ¸ ÿÒ¸ ÿÒ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÍµÿÍµÿÍµÿÎ¶žÿÏ·ŸÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÓ»¥ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÐ¸ ÿÑ¹¡ÿÐ¸ ÿÏ·ŸÿÎ¶žÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÑ·ŸÿÏµÿÐ¶žÿÐ¶žÿÑ·ŸÿÒ¸ ÿÓ¹¡ÿÓ¹¡ÿÔº¢ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÒº¤ÿÒº¤ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÐ¸¢ÿÏ·¡ÿÏ·¡ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÏ·ŸÿÎ¶žÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÎ¶žÿÎ¶žÿÎ¶žÿÎ¶žÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÒº¢ÿÒº¢ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÒº¤ÿÓ»¥ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÓ»¥ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÔ¼¦ÿÓ»¥ÿÒº¤ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÒº¢ÿÑ¹¡ÿÏ·ŸÿÏ·ŸÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÒº¢ÿÒº¢ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÎ¶žÿÏ·ŸÿÏ·ŸÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÒº¢ÿÒº¢ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÏ·ŸÿÏ·ŸÿÎ¶žÿÒº¤ÿÓ»¥ÿÕ½§ÿÖ¾¨ÿÖ¾¨ÿÕ½§ÿÔ¼¦ÿÓ»¥ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÕ½§ÿÓ»¥ÿÑ¹£ÿÒº¤ÿÓ»¥ÿÔ¼¦ÿÒº¤ÿÑ¹£ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÐ¸¢ÿÑ¹£ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÑ¹¡ÿÒº¢ÿÑ¹¡ÿÐ¸ ÿÏ·ŸÿÐ¸ ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÒº¤ÿÓ»¥ÿÕ½§ÿÖ¾¨ÿ×¿©ÿÖ¾¨ÿÔ¼¦ÿÓ»¥ÿÖ¾¨ÿÖ¾¨ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÓ»¥ÿÒº¤ÿÒº¤ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÕ½§ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÔ¼¦ÿÕ½§ÿÓ»¥ÿÑ¹£ÿÒº¤ÿÓ»¥ÿÔ¼¦ÿÒº¤ÿÐ¸¢ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÓ»¥ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÒº¤ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÑ¹¡ÿÐ¸ ÿÑ¹¡ÿÒº¢ÿÑ¹¡ÿÐ¸ ÿÏ·ŸÿÐ¸ ÿÑ¹¡ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÐ¸ ÿÎ·¡ÿÎ·¡ÿÏ¸¢ÿÏ¸¢ÿÐ¹£ÿÑº¤ÿÑº¤ÿÒ»¥ÿÑº¤ÿÑº¤ÿÑº¤ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÐ¹£ÿÏ¸¢ÿÒº¤ÿÒº¤ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÐ¸¢ÿÑ¹£ÿÑ¹£ÿÑ¹£ÿÒº¤ÿÒº¤ÿûùùÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿûùùÿûùùÿûùùÿúøøÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿøöõÿøöõÿù÷öÿúø÷ÿúø÷ÿúø÷ÿúøøÿù÷÷ÿûùùÿûùùÿúøøÿúøøÿù÷÷ÿù÷÷ÿúøøÿúøøÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿûùùÿûùùÿûùùÿúøøÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿøöõÿøöõÿù÷öÿúø÷ÿúø÷ÿúø÷ÿúøøÿù÷÷ÿûùùÿûùùÿúøøÿù÷÷ÿù÷÷ÿù÷÷ÿúøøÿúøøÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿûùøÿûùøÿûùøÿúø÷ÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷öÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿøöõÿøöõÿù÷öÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿù÷öÿûùùÿûùùÿúøøÿù÷÷ÿùöøÿùöøÿú÷ùÿú÷ùÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿûùøÿûùøÿúø÷ÿúø÷ÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷öÿù÷öÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿøöõÿøöõÿù÷öÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿù÷öÿûùùÿûùùÿúøøÿù÷÷ÿùöøÿùöøÿú÷ùÿú÷ùÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿûùøÿûùøÿúø÷ÿúø÷ÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿø÷óÿø÷óÿùøôÿúùõÿúø÷ÿúø÷ÿúø÷ÿù÷öÿûùùÿûùùÿú÷ùÿùöøÿùöøÿùöøÿú÷ùÿú÷ùÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿûùøÿûùøÿûùøÿúø÷ÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿø÷óÿø÷óÿùøôÿúùõÿúø÷ÿúø÷ÿúø÷ÿù÷öÿûùùÿûùùÿú÷ùÿùöøÿùöøÿùöøÿú÷ùÿú÷ùÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿûùøÿûùøÿûùøÿúø÷ÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿø÷óÿø÷óÿùøôÿúùõÿúø÷ÿúø÷ÿúø÷ÿù÷öÿûùùÿûùùÿú÷ùÿùöøÿùöøÿùöøÿúöûÿú÷ùÿûùùÿûùùÿûùùÿûùùÿûùùÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúø÷ÿúø÷ÿûùøÿûùøÿûùøÿúø÷ÿù÷öÿù÷öÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷öÿù÷öÿùøôÿù÷öÿùøôÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷÷ÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿù÷öÿùøôÿù÷öÿùøôÿù÷öÿùøôÿøöõÿø÷óÿù÷öÿúø÷ÿúø÷ÿúø÷ÿúø÷ÿù÷öÿûùùÿûùùÿú÷ùÿùöøÿùöøÿùöøÿú÷ùÿú÷ùÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿùøúÿùøúÿùùùÿùùùÿùùùÿùùùÿûùøÿùúøÿùúøÿ÷úøÿ÷ùùÿõúùÿõúùÿôùøÿôøùÿñùùÿíúøÿëù÷ÿç÷öÿâôóÿÞòóÿÛðòÿØîóÿÕíóÿÒìóÿÎéóÿËåñÿÇâðÿÅàîÿÃàïÿÆàðÿÅâñÿÂáðÿÀßîÿ½ÜëÿºÛêÿ¹Úéÿ¹Úéÿ·Øèÿµ×çÿ³Õåÿ²Ôäÿ¯Óåÿ­Ñãÿ«ÏáÿªÎàÿ¨ÌÞÿ¦ÌÞÿ©Ïáÿ¦Îàÿ¥Íßÿ¦Îàÿ§Ïáÿ¦Ñâÿ¥Ïâÿ¤Îáÿ¡ËÞÿ ËÞÿ ËàÿŸÊßÿžÉÞÿšÇÜÿ™ÆÛÿ˜ÅÚÿ˜ÅÚÿ™ÆÛÿ›ÈÝÿ›ÈÝÿšÆÝÿ—ÆÜÿ™ÅÜÿ—ÆÜÿšÆÝÿ—ÆÜÿ—ÆÜÿ—ÆÜÿ—ÅÝÿ“ÃÛÿ’ÀØÿ¾Öÿ•ÁØÿ˜ÂÙÿ˜ÂÙÿ–ÂÙÿ–ÂÙÿ–ÂÙÿ•ÁØÿ“ÂØÿ‘¿×ÿ’ÀØÿ“ÁÙÿ‘ÁÙÿÀØÿŽ¾ÖÿŒ¼ÔÿŠºÒÿŽ¼ÔÿŒºÒÿ‹¹Ñÿ‹¹ÑÿŒºÒÿ‹¹ÑÿŠ¸Ðÿ‰·Ïÿ‡µÍÿˆ¶ÎÿŠ¸Ðÿ‹¹Ñÿ‹¹Ñÿ‰·Ïÿ†´Ìÿ„²Êÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿùøúÿùøúÿùùùÿùùùÿùùùÿùùùÿûùøÿûùøÿùúøÿùúøÿùùùÿ÷ùùÿ÷ùùÿõúùÿõùúÿóøùÿïúøÿëù÷ÿé÷öÿåõôÿàòóÿÜðñÿÙîðÿÖìñÿÓëñÿÒéñÿÍæðÿÌåïÿÉãïÿÉãïÿÊäòÿËåóÿÄßíÿÁÞìÿÀÝëÿ¿Üêÿ½Üëÿ¼Ûêÿ¹Øçÿ·Öåÿ´Õåÿ´Õåÿ³Õåÿ³Õåÿ´Õèÿµ×çÿ¶×êÿµÙéÿ­ÓåÿªÓâÿªÐâÿ§Ïáÿ¨Ðâÿ¨Ðâÿ¨Ðâÿ¥Ïâÿ£Íàÿ¢Ìßÿ¡ËÞÿŸÊßÿŸÊßÿŸÊßÿŸÊßÿŸÊßÿ›ÈÝÿœÉÞÿœÉÞÿ›ÈÝÿšÇÜÿ˜ÇÝÿ›ÇÞÿ™ÈÞÿ–ÅÛÿ–ÅÛÿ•ÄÚÿ—ÆÜÿ˜ÇÝÿ—ÈÞÿ—ÅÝÿ–ÅÛÿ“½Ôÿ“¾Óÿ•¾Õÿ•ÀÕÿ•¿Öÿ•¿Öÿ•¿Öÿ“¿Öÿ“¿Öÿ“¿Öÿ’¾Öÿ¿Õÿ‘¿×ÿ‘ÀÖÿ‘¿×ÿ’ÀØÿ½Õÿ»ÓÿŽºÒÿŒºÒÿŽºÒÿŒºÒÿ¹Ñÿ‰·ÏÿŽºÒÿŒºÒÿ¹ÑÿŠ¸Ðÿ‹·Ïÿˆ¶Îÿ‰µÍÿ‡µÍÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿùøúÿùøúÿùùùÿùùùÿûùùÿûùùÿûùøÿûùøÿúø÷ÿùúøÿùùùÿ÷ùùÿ÷ùùÿ÷ùùÿ÷ùúÿõùúÿñùùÿïùùÿîøøÿë÷÷ÿçôöÿâñóÿÞïòÿÚíòÿÙíòÿØëòÿÕëñÿÓèðÿÒçïÿÑæîÿÑåðÿÎäïÿÊâîÿÇáíÿÇáíÿÈâîÿÇâðÿÅàîÿÁÜêÿ¾Ùçÿ»Øçÿ¹Öåÿ¶Õäÿ´Óâÿ´Òãÿ´Óâÿ³Ôäÿ³Ôãÿ±Õåÿ­Ôâÿ­ÑáÿªÑàÿ«Òáÿ«Òáÿ«Òáÿ©Ñãÿ§Ïáÿ¦Îàÿ¤ÌÞÿ¡ËÞÿ¢Ìßÿ£Íàÿ¤Îáÿ¦Ðãÿ¢Íàÿ¡Ìßÿ ËÞÿŸÊÝÿŸÊÝÿžËàÿŸÊßÿÊßÿŸÌáÿžËàÿœÉÞÿ›ÈÝÿœÉÞÿšÉÞÿ›ÇÞÿšÇÜÿÆÜÿÇÚÿ ÇÝÿžÈÛÿžÇÝÿžÇÝÿÆÜÿœÇÜÿ—Â×ÿ–ÁÖÿ”¾Õÿ’¿Ôÿ’¾Õÿ“ÀÕÿ•ÁØÿ–ÂÙÿ“¿Öÿ’¾Õÿ’¼Óÿ¼Óÿ’¼Óÿ¼ÓÿºÑÿ¹Ðÿ“½Ôÿ»Òÿ¹Ðÿ‹·ÎÿŒ¶Íÿ‹·Îÿ¹ÐÿŽºÑÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿùøúÿùøúÿùùùÿùùùÿûùùÿûùùÿûùøÿûùøÿúø÷ÿúø÷ÿøøøÿùùùÿùùùÿ÷ùùÿ÷ùúÿ÷ùúÿõùúÿôùúÿóûûÿóûûÿïøûÿë÷ùÿçó÷ÿãòõÿäóöÿâòøÿàðöÿÜïôÿÛëñÿ×êïÿÖæíÿÓåìÿÒçïÿÏæîÿÑåðÿÏåðÿÏåðÿÌåïÿÉáíÿÇßëÿÍåñÿÉãïÿÆàîÿÂÝëÿÀÛéÿ¿ÚèÿÀÛéÿ¾Ûéÿ¶Øåÿ´Öãÿ²Ôáÿ²Ôáÿ³Ôãÿ´×åÿ´×åÿ´×åÿ±Óãÿ¯Óãÿ®Òâÿ­Ñáÿ­Ñãÿ­Ñãÿ®Òäÿ¬Òäÿ©Ñãÿ¦Ñâÿ¨Ðâÿ¦Ñâÿ©Ñãÿ¦Ñâÿ¤Îáÿ¢Ìßÿ§Ñäÿ¤Ïâÿ£Íàÿ¡Ìßÿ¢Ìßÿ¡Ìßÿ¢Ìßÿ¡ËÞÿ¡ÉÜÿ£ÉÛÿ£ÈÜÿ¢ÈÚÿ¡ÆÚÿžÆÙÿœÄ×ÿœÄ×ÿžÅÛÿ›ÅØÿšÃÙÿ™ÃÖÿ˜Á×ÿ—ÂÕÿ—Â×ÿ—Â×ÿ˜ÃØÿ–ÁÖÿ–¿Öÿ”¿Ôÿ•¾Õÿ”¿Ôÿ“¼Óÿ»Ðÿ’»Òÿ»Ðÿ¸Ïÿ¸ÍÿŽ·ÎÿºÏÿ’»Òÿ“½Ôÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿùøúÿ÷ùúÿùùùÿùùùÿûùùÿûùùÿûùøÿûùøÿúø÷ÿúø÷ÿúøøÿùùùÿùùùÿùùùÿùøúÿùøúÿöøùÿ÷ùúÿöúûÿ÷ûüÿöûüÿóûûÿïøûÿìøúÿíùûÿì÷ûÿëöúÿèôøÿçòöÿãïóÿâíñÿàìðÿÝíóÿØëðÿØèîÿÕèíÿÖèïÿÕèïÿÕèïÿÔçîÿÓæîÿÐåíÿÎãëÿËâêÿËáìÿËáìÿÍãîÿÌåïÿÆàìÿÃßêÿÁÝèÿÀÜçÿÁÝèÿÁÝèÿÁÜêÿ¾Ûéÿº×åÿ»Øæÿ¼ÙèÿºÙèÿ¹Øçÿ·ÖåÿµÔãÿ±Òáÿ±Óãÿ¯Óãÿ²Ôäÿ±Õåÿ³Õåÿ¯Óãÿ«Ïßÿ¨ÌÜÿªÎàÿ¦ÌÞÿ§ËÝÿ¦ÌÞÿªÎàÿªÐâÿ¬Ðâÿ¬Ðâÿ§ËÝÿ§ËÛÿ§ËÝÿ§ËÛÿ¦ÊÜÿ£ÉÛÿ¢ÈÚÿ¡ÇÙÿ¡ÆÚÿŸÇÙÿŸÇÚÿŸÇÙÿžÆÙÿ›Æ×ÿ™ÃÖÿ˜ÂÕÿšÄ×ÿ™ÃÖÿ™ÀÖÿ—ÁÔÿ™ÀÖÿ–ÀÓÿ—¾Ôÿ“½Ðÿ•¼Òÿ“½Ðÿ”»Ñÿ’¼Ïÿ“ºÐÿ‘»Îÿ“ºÐÿ‘ºÐÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿøøøÿùøúÿ÷ùúÿùùùÿùùùÿûùùÿûùùÿûùøÿûùøÿúø÷ÿûùøÿûùùÿûùùÿùùùÿùùùÿùøúÿùøúÿùöøÿø÷ùÿùøúÿøúûÿùûüÿöúûÿõúýÿôùüÿòùüÿòúúÿòùüÿñùùÿñùùÿðøøÿðøøÿðøøÿìøúÿéöøÿæóõÿåòôÿåñõÿåô÷ÿåô÷ÿãô÷ÿÜìòÿÛëñÿ×êïÿÖéîÿÔçîÿÓæíÿÓæíÿÓæíÿÖëóÿÓêòÿÓèðÿÏæîÿÑæîÿÍäìÿËáìÿÇàêÿÆÜçÿÆßéÿÇßëÿÆàìÿÆÞêÿÁÛçÿ½×ãÿºÖáÿ¸Õãÿ·×äÿ¸Øåÿ¹Ùæÿ¸Øåÿ¶Öãÿ²Òßÿ­ÏÜÿ²Óâÿ°Ñàÿ®ÏÞÿ­ÎÝÿ­ÎÝÿ¬ÍÜÿ«ÌÛÿ©ÊÙÿ«ÌÜÿªÌÜÿ¬ÍÝÿ¬ÎÞÿ¬ÎÞÿªÎÞÿ«ÍÝÿ©Íßÿ ÄÖÿŸÅ×ÿ£ÇÙÿ¢ÈÚÿ¢ÈÚÿŸÇÙÿŸÅ×ÿœÄÖÿžÆÙÿÅØÿœÄ×ÿ›ÃÖÿ›ÃÖÿ›ÃÖÿ™ÁÔÿ˜ÀÓÿšÂÕÿšÂÕÿšÂÕÿšÂÕÿ˜ÀÓÿ–¾Ñÿ“»Îÿ’ºÍÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿøøøÿùøúÿ÷ùúÿùùùÿùùùÿûùùÿûùùÿûùøÿûùøÿýùøÿýùøÿûùùÿûùùÿûùùÿûùùÿùøúÿú÷ùÿüöûÿüöûÿüöûÿû÷üÿûøúÿùøúÿ÷ùúÿ÷ùúÿ÷ùúÿ÷ùùÿ÷ùúÿ÷ùùÿ÷ùùÿøúúÿùûûÿùûûÿøþýÿôüûÿóûûÿðúúÿñûûÿðüüÿðüüÿðüüÿòÿÿÿòÿÿÿîýÿÿíüþÿêùüÿè÷úÿäõøÿãô÷ÿãóùÿàóøÿâòùÿàòùÿáñøÿÞð÷ÿÚëôÿ×êòÿØéòÿ×êòÿØêõÿÖêõÿ×éôÿÒæñÿÏãîÿÌâíÿÊäðÿÊäðÿÉãïÿÈâîÿÆàìÿÄÞêÿÃÝéÿÂÞéÿÆáïÿÄßíÿÂÝëÿÁÜêÿ¿Úèÿ½ØæÿºÕãÿ¶Óáÿ°ÏÞÿ¯Ðßÿ±Ðßÿ®ÏÞÿ®ÏÞÿ¬ÏÝÿ¬ÍÜÿªÌÜÿ«ÍÝÿ©ÍÝÿ«ÍÝÿ©ÍÝÿ©ÍÝÿ¦ÍÜÿ§ËÛÿ¥ÌÛÿ¥ËÝÿ¤ÊÜÿ¢ÈÚÿ¢ÈÚÿ£ÉÛÿ¢ÈÚÿ¡ÇÙÿ ÆØÿ¡ÇÙÿ¡ÇÙÿ¡ÇÙÿ ÆØÿŸÅ×ÿÃÕÿœÂÔÿ™ÁÔÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿúøøÿùøúÿùøúÿùùùÿùùùÿûùùÿûùùÿûùøÿûùøÿýùøÿýùøÿûùùÿûùùÿûùùÿúøøÿø÷ùÿú÷ùÿþùûÿþùûÿý÷üÿü÷ùÿú÷ùÿú÷ùÿø÷ùÿùøúÿúúúÿùùùÿøøøÿ÷÷÷ÿ÷øöÿøù÷ÿûùøÿùúøÿõúøÿôûøÿõúùÿõûúÿöüûÿöüûÿòúùÿðø÷ÿîøøÿïùùÿðúúÿðüüÿðüüÿðüüÿðüþÿîûýÿìøúÿìùûÿïúþÿðüÿÿòýÿÿñýÿÿîúÿÿë÷ýÿìøþÿìøþÿêøþÿé÷ýÿèõýÿçõûÿäôûÿãóúÿä÷þÿãöýÿáôûÿÞñøÿÛîõÿÚíôÿÜïöÿÞñøÿÕêòÿÕêòÿÖëóÿØíõÿÛðøÿÛðøÿÚï÷ÿ×íøÿÑéõÿÐèôÿÏçóÿËåñÿÉãïÿÆàìÿÃÝéÿÁÜêÿÂÝëÿ¾Ûéÿ¼Ùçÿ¹ÖäÿµÕâÿµÕâÿµÕâÿµÔãÿ¯Ðßÿ¬ÏÝÿ¬ÍÝÿ«ÎÜÿ­ÎÞÿ¬ÏÝÿªÌÜÿ©ÌÚÿ¦ÈØÿ¦É×ÿ¦ÈØÿ¦É×ÿ§ÉÙÿ¨ËÙÿ¨ÊÚÿ¦ÊÚÿ†µËÿ†µËÿ†²Éÿ…±Èÿ…±Èÿ„°Çÿ„°Çÿ„°Çÿ†²Éÿ„°Çÿ„®Åÿ„®Åÿ…¯Æÿ†°Çÿ…¯Æÿ„®Åÿƒ®Ãÿƒ®Ãÿ„¯Äÿƒ®Ãÿ‚­Âÿ‚­Âÿ„¯Äÿ†±Æÿ‚­Âÿ‚­Âÿ€­Âÿ®Ãÿƒ°Åÿƒ°Åÿ‚¯Äÿ®Ãÿƒ­Äÿ„®Åÿƒ­Äÿ«Âÿ©Àÿ~¨¿ÿ€ªÁÿ«Âÿ«Âÿ€ªÁÿ©Àÿ«Âÿƒ­Äÿƒ­Äÿ€ªÁÿ}§¾ÿ¨¿ÿ¨¿ÿ~§¾ÿ~§¾ÿ¨¿ÿ¨¿ÿ€©Àÿ€©ÀÿªÁÿªÁÿªÁÿªÁÿ‚«ÂÿªÁÿ~§¾ÿ|¥¼ÿ~¨¿ÿ}§¾ÿ|¦½ÿ|¦½ÿ{¥¼ÿ{¥¼ÿ|¦½ÿ|¦½ÿ~§½ÿ|¥»ÿ{¤ºÿ|¥»ÿ¨¾ÿ€©¿ÿ~§½ÿ{¤ºÿ~§½ÿ|¥»ÿ{¤ºÿ{¤ºÿ{¤ºÿ{¤ºÿy¢¸ÿx¡·ÿx¡·ÿ|¥»ÿ}¦¼ÿz£¹ÿy¢¸ÿ|¥»ÿ{¤ºÿvŸµÿz¢µÿy¡´ÿy¡´ÿy¡´ÿy¡´ÿy¡´ÿy¡´ÿx ³ÿwŸ²ÿx ³ÿ{ ´ÿ|¡µÿ|¡µÿ|¡µÿ{ ´ÿzŸ³ÿx±ÿyž²ÿzŸ³ÿ{ ´ÿ{ ´ÿzŸ³ÿyž²ÿx±ÿ{¡³ÿ{¡³ÿz ²ÿxž°ÿxž°ÿw¯ÿw¯ÿxž°ÿ†µËÿ†µËÿˆ´Ëÿ†²Éÿ…±Èÿ„°Çÿ…±Èÿ†²Éÿ‡³Êÿ…±Èÿ†°Çÿ†°Çÿ‡±Èÿ‡±Èÿ‡±Èÿ†°Çÿ…°Åÿ‡²Çÿˆ³Èÿ‡²Çÿ…°Åÿƒ®Ãÿƒ®Ãÿƒ®Ãÿ„¯Äÿ„¯Äÿƒ°Åÿƒ°Åÿ„±Æÿ…²Çÿ„±Æÿƒ°Åÿ…¯Æÿ†°Çÿ…¯Æÿ„®Åÿƒ­Äÿ‚¬Ãÿƒ­Äÿ„®Åÿƒ­Äÿ‚¬Ãÿ‚¬Ãÿ‚¬Ãÿƒ­Äÿƒ­Äÿ€ªÁÿ}§¾ÿƒ¬Ãÿƒ¬Ãÿƒ¬Ãÿ‚«ÂÿªÁÿ€©Àÿ€©Àÿ¨¿ÿ€©Àÿ€©Àÿ€©ÀÿªÁÿƒ¬Ãÿ‚«ÂÿªÁÿ¨¿ÿ€ªÁÿ€ªÁÿ©Àÿ©Àÿ~¨¿ÿ~¨¿ÿ©Àÿ©Àÿ¨¾ÿ~§½ÿ}¦¼ÿ~§½ÿ¨¾ÿ¨¾ÿ}¦¼ÿ{¤ºÿ}¦¼ÿ|¥»ÿ{¤ºÿ{¤ºÿ|¥»ÿ|¥»ÿ{¤ºÿz£¹ÿy¢¸ÿ|¥»ÿ}¦¼ÿz£¹ÿz£¹ÿ}¦¼ÿ}¦¼ÿz£¹ÿ~¦¹ÿ~¦¹ÿ}¥¸ÿ|¤·ÿ|¤·ÿ{£¶ÿ{£¶ÿz¢µÿ|¤·ÿ|¤·ÿ¤¸ÿ¤¸ÿ~£·ÿ~£·ÿ}¢¶ÿ}¢¶ÿ|¡µÿ|¡µÿ{ ´ÿ{ ´ÿzŸ³ÿzŸ³ÿzŸ³ÿzŸ³ÿ~¤¶ÿ}£µÿ}£µÿ|¢´ÿ|¢´ÿ|¢´ÿ}£µÿ}£µÿŠ¶ÍÿŠ¶ÍÿŠ¶Íÿ‰µÌÿŠ´Ëÿ‰³ÊÿŠ´Ëÿ‹µÌÿŒ¶ÍÿŠ´Ëÿ‰³Êÿ‰³ÊÿŠ³Êÿ‹´Ëÿ‹´ËÿŠ³Êÿˆ±ÇÿŠ³ÉÿŒµËÿŒµËÿŠ³Éÿˆ±Çÿ…°Åÿ…°Åÿ‡²Çÿ‡²Çÿ‡²Çÿˆ³Èÿ‰´Éÿ‰´Éÿˆ³Èÿ‡²Çÿ†°Çÿ‡±Èÿˆ²Éÿˆ²Éÿ‡±Èÿ†°Çÿ‡±Èÿˆ²Éÿ†°Çÿ†°Çÿ†°Çÿ†°Çÿ…¯Æÿ„®Åÿ‚¬Ãÿ€ªÁÿ…®Åÿ†¯Æÿ†¯Æÿ†¯Æÿ…®Åÿ„­Äÿ‚«ÂÿªÁÿªÁÿªÁÿªÁÿƒ¬Ãÿ…®Åÿ…®Åÿ„­Äÿ‚«Âÿ«Âÿ«Âÿ‚«Âÿ‚«Âÿ‚«Âÿ‚«Âÿ‚«Âÿ‚«Âÿ‚«ÁÿªÀÿ€©¿ÿ€©¿ÿ€©¿ÿ¨¾ÿ~§½ÿ|¥»ÿ}¦¼ÿ|¥»ÿ|¥»ÿ|¥»ÿ~§½ÿ¨¾ÿ~§½ÿ}¦¼ÿ|¥»ÿ~§½ÿ}¦¼ÿ|¥»ÿ|¥»ÿ¨¾ÿ¨¾ÿ~§½ÿ~¨»ÿ~¨»ÿ€¨»ÿ€¨»ÿ§ºÿ§ºÿ§ºÿ§ºÿ€¨»ÿ§ºÿ§ºÿ~¦¹ÿ¤¸ÿ¤¸ÿ¤¸ÿ€¥¹ÿƒ¦ºÿ¤¸ÿ}¢¶ÿ|¡µÿ{ ´ÿ{ ´ÿ|¡µÿ}¢¶ÿ{£¶ÿ{£¶ÿz¢´ÿ{£µÿ{£µÿ{£µÿ|¤¶ÿ|¤¶ÿºÑÿ¹ÐÿŒ¸ÏÿŒ¸ÏÿŽ¸ÏÿŽ¸ÏÿŽ¸ÏÿŽ¸ÏÿŽ¸Ïÿ·Îÿ‹µÌÿ‹µÌÿ¶Íÿ¶Íÿ¶ÍÿŒµÌÿ‰²Èÿ‹´Êÿ¶Ìÿ¶ÌÿŒµËÿ‹´Êÿ‹¶ËÿŒ·ÌÿŠµÊÿ‰´Éÿ‰´Éÿ‰´ÉÿŠµÊÿŠµÊÿ‰´Éÿˆ³Èÿ†°Çÿˆ²ÉÿŠ´ËÿŠ´Ëÿ‰³Êÿˆ²Éÿ‰³Êÿ‰³Êÿˆ²Éÿ‰³Êÿ‰³Êÿ‰³Êÿˆ²Éÿ‡±Èÿ†°Çÿ…¯Æÿƒ¬Ãÿ„­Äÿ†¯Æÿˆ±Èÿˆ±Èÿ‡°Çÿ†¯Æÿ…®Åÿ„­Äÿƒ¬Ãÿƒ¬Ãÿ„­Äÿ†¯Æÿ†¯Æÿ…®Åÿ„­Äÿƒ­Äÿƒ­Äÿ„­Äÿ„­Äÿ„­Äÿ„­Äÿ„­Äÿ„­Äÿƒ¬Âÿƒ¬Âÿƒ¬Âÿƒ¬Âÿ‚«ÁÿªÀÿ€©¿ÿ€©¿ÿ€©¿ÿ¨¾ÿ~§½ÿ¨¾ÿ€©¿ÿ€©¿ÿ€©¿ÿ¨¾ÿ€©¿ÿ€©¿ÿ¨¾ÿ~§½ÿ~§½ÿ¨¾ÿ€©¿ÿ€©¿ÿ}§ºÿ~¨»ÿ€¨»ÿ©¼ÿ©¼ÿ‚ª½ÿ‚ª½ÿ‚ª½ÿ‚ª½ÿ©¼ÿ€¨»ÿ§ºÿ¦ºÿ‚§»ÿƒ¨¼ÿƒ¨¼ÿ†©½ÿ…¨¼ÿ‚§»ÿ¦ºÿ¦ºÿ¦ºÿ‚§»ÿ‚§»ÿ}¥¸ÿ}¥¸ÿ}¥·ÿ}¥·ÿ}¥·ÿ{¦·ÿ{¦·ÿ{¦·ÿ’½Òÿ»Ðÿ¸ÍÿŽ¹Îÿ»Ðÿ‘¼ÑÿºÏÿŽ¹Îÿ¹Ïÿ¸Îÿ¶Ìÿ¶ÌÿŽ·ÍÿŽ·ÍÿŽ·Íÿ¶Ìÿ¶Ìÿ¶Ìÿ¶Ìÿ‹´ÊÿŠ³Éÿ‹´ÊÿŽ·Íÿ¹Ïÿ¶Ìÿ¶Ìÿ‹¶Ëÿ‹¶Ëÿ‹¶Ëÿ‹¶ËÿŠµÊÿ‰´Éÿ‡±Èÿˆ²ÉÿŠ´ËÿŠ´Ëÿ‰³Êÿˆ²Éÿ‰³ÊÿŠ´Ëÿˆ²Éÿ‰³Êÿ‰³ÊÿŠ´ËÿŠ´Ëÿ‰³Êÿ‰³Êÿ‰³Êÿ„­Äÿ…®Åÿ‡°Çÿ‰²Éÿ‰²Éÿˆ±Èÿ‡°Çÿ†¯Æÿ‡°Çÿ†¯Æÿ…®Åÿ…®Åÿ†¯Æÿ†¯Æÿ„­Äÿƒ¬Ãÿ†¯Æÿ†¯Æÿ†¯Æÿ†¯Æÿ†¯Æÿ†¯Æÿ†¯Æÿ†¯Æÿ„­Ãÿ„­Ãÿ…®Äÿ…®Äÿ…®Äÿ…®Äÿ„­Ãÿ„­Ãÿ„¯Äÿ‚­Âÿ¬Áÿ¬Áÿ¬Áÿ¬Áÿ€«Àÿª¿ÿ„¯Äÿ‚­Âÿ€«Àÿ€«Àÿª¿ÿª¿ÿª¿ÿ¬Áÿ©¼ÿ©¼ÿ©¼ÿ©¼ÿ©¼ÿ©¼ÿ©¼ÿ©¼ÿ‚ª½ÿ©¼ÿ©¼ÿ©¼ÿƒ¨¼ÿ…ª¾ÿ†«¿ÿ‡¬Àÿ†¨¿ÿ‡©Àÿ†«Áÿ‡¬Âÿ‡¬Àÿ‡¬Àÿ„¬¿ÿ„¬¿ÿ„¬¿ÿ„¬¿ÿ«¾ÿ«¾ÿ€«¼ÿ€«¼ÿª»ÿ~ª»ÿ•¾Ôÿ‘¼ÑÿºÏÿºÏÿ»Ðÿ‘¼Ñÿ»ÐÿŽ¹Îÿ’»Ñÿ‘ºÐÿ¸Îÿ¸Îÿ¹Ïÿ¹Ïÿ¹Ïÿ¸Îÿ”½Óÿ’»Ñÿ¹Ïÿ¶Ìÿ‹´ÊÿŒµËÿ¸Îÿ‘ºÐÿ’»Ñÿ‘ºÐÿŽ¹ÎÿŽ¹ÎÿŽ¹Îÿ¸Íÿ¸ÍÿŒ·Ìÿ‹µÌÿ‹µÌÿŒ¶Íÿ‹µÌÿŠ´ËÿŠ´Ëÿ‹µÌÿŒ¶Íÿ‰³Êÿ‰³Êÿ‰³ÊÿŠ´Ëÿ‹µÌÿŒ¶Íÿ‹µÌÿ‹µÌÿŠ³ÊÿŠ³Êÿ‹´Ëÿ‹´ËÿŠ³Êÿˆ±Èÿ‡°Çÿ†¯ÆÿŠ³Êÿˆ±Èÿ‡°Çÿ‡°Çÿ‡°Çÿ†¯Æÿ…®Åÿƒ¬Ãÿ†¯Æÿ†¯Æÿ†¯Æÿ‡°Çÿ‡°Çÿ†¯Æÿ†¯Æÿ†¯Æÿ†¯Åÿ†¯Åÿ†¯Åÿ‡°Æÿˆ±Çÿˆ±Çÿ‡°Æÿ†¯Åÿ‡²Çÿ†±Æÿ„¯Äÿ„¯Äÿ„¯Äÿ„¯Äÿ‚­Âÿ¬Áÿ†±Æÿ„¯Äÿƒ®Ãÿ„¯Äÿƒ®Ãÿ¬Áÿ¬Áÿƒ®Ãÿ„®Áÿƒ­Àÿ‚¬¿ÿ«¾ÿ‚ª½ÿ€¨»ÿ§ºÿ§ºÿ©¼ÿ€¨»ÿ€¨»ÿ©¼ÿ„©½ÿ„©½ÿ…ª¾ÿ†«¿ÿ„¦½ÿ†¨¿ÿ…ªÀÿ‡¬Âÿ‡¬Àÿ‡¬Àÿƒ«¾ÿ‚ª½ÿ…­Àÿ…­Àÿƒ­Àÿ‚¬¿ÿ‚­¾ÿ¬½ÿ«¼ÿ~ª»ÿ™ÂØÿ—Â×ÿ–ÁÖÿ•ÀÕÿ”¿Ôÿ”¿Ôÿ•¾Ôÿ–¿Õÿ—ÀÖÿ–¿Õÿ”½Óÿ”½Óÿ•¾Ôÿ–¿Õÿ—¾Ôÿ–½ÓÿšÁ×ÿ™ÀÖÿ–¿Õÿ“¼Òÿ‘ºÐÿ‘ºÐÿ”½Óÿ–¿Õÿ—ÀÖÿ–¿Õÿ“¾Óÿ’½Òÿ’½Òÿ’½Òÿ‘¼Ñÿ‘¼Ñÿ‘»Òÿ‘»ÒÿºÑÿŽ¸ÏÿŒ¶ÍÿŒ¶ÍÿŽ¸ÏÿºÑÿŽ¸ÏÿŒ¶Íÿ‹µÌÿŒ¶ÍÿŽ¸Ïÿ¹ÐÿŽ¸ÏÿŒ¶Íÿ¸ÏÿŽ·ÎÿŽ·Îÿ¶ÍÿŒµÌÿŒµÌÿ‹´ËÿŠ³ÊÿŽ·ÎÿŒµÌÿ‹´Ëÿ‹´Ëÿ‹´Ëÿ‹´Ëÿ‰²Éÿˆ±ÈÿŠ°Èÿ‹±Éÿ‹±Éÿ‹±Éÿ‹±ÉÿŠ°Èÿ‰¯Çÿ‰¯Çÿ‰²Èÿˆ±Çÿ‡°Æÿˆ±ÇÿŠ³ÉÿŠ³Éÿˆ±Çÿ†¯Åÿˆ³Èÿ‡²Çÿ†±Æÿ†±Æÿ‡²Çÿ‡²Çÿ†±Æÿ„¯Äÿ‡²Çÿ„¯Äÿ…°Åÿˆ³Èÿˆ³Èÿ…°Åÿ„¯Äÿ‡²Çÿ†°Ãÿ†°Ãÿ…¯Âÿ„®Áÿƒ­Àÿƒ­Àÿ„¬¿ÿ„¬¿ÿƒ«¾ÿƒ«¾ÿƒ«¾ÿ„¬¿ÿ„¬¿ÿƒ«¾ÿ…ª¾ÿ…ª¾ÿ‡©Àÿ‡©Àÿ‡©Àÿ‡©Àÿ…ª¾ÿ…ª¾ÿ‚ª½ÿ‚ª½ÿ«¾ÿ‚¬¿ÿ‚¬¿ÿ‚¬¿ÿ€¬½ÿ€¬½ÿ«¼ÿ«¼ÿ¢ÈÚÿ¡ÉÜÿ¢ÊÝÿ ÈÛÿœÄ×ÿ›ÃÖÿŸÄØÿ¡ÆÚÿ¡ÆÚÿŸÄØÿžÃ×ÿÂÖÿžÃ×ÿŸÄØÿžÃ×ÿžÃ×ÿŸÂÖÿžÃ×ÿžÃ×ÿžÃ×ÿÂÖÿ›ÃÖÿÅØÿžÆÙÿÅØÿœÄ×ÿ˜ÂÕÿ—ÁÔÿ—ÁÔÿ–ÀÓÿ–ÀÓÿ•¿Òÿ—ÀÖÿ–¿Õÿ•¾Ôÿ’»Ñÿ¹Ïÿ¹Ïÿ“¼Òÿ•¾Ôÿ”½Óÿ»ÐÿŽ¹ÎÿºÏÿ‘¼Ñÿ’½Òÿ»Ðÿ¸Íÿ¹Ïÿ¸Îÿ¸Ïÿ¸Îÿ¸Ïÿ¹Ïÿ¹Ðÿ‘ºÐÿ‘ºÑÿ¹Ïÿ¸Ïÿ¸Îÿ¹ÐÿºÏÿ¸Ïÿ¶ÌÿŽ·ÎÿŽ·Íÿ¶ÎÿŽ·Íÿ¶Îÿ¶ÌÿŽ´Ìÿ‹´ÊÿŒµËÿŠ³Éÿ‰²Èÿ‰²Èÿ‹´Êÿ‹´Êÿˆ±Çÿ…®Äÿˆ³Èÿ‡²Çÿ†±Æÿ‡²Çÿˆ³Èÿ‰´Éÿˆ³Èÿ‡²Çÿ†±Æÿ„¯Äÿ…°ÅÿŠµÊÿ‹¶Ëÿˆ³Èÿ‡²ÇÿŠµÊÿ…¯Âÿ…¯Âÿ†°Ãÿ‡±Äÿ‡±Äÿˆ²Åÿ‰³Æÿ‰³Æÿˆ°Ãÿ‡±Äÿ‰±Äÿ‡±Äÿ‰±Äÿ‡¯Âÿ…­Àÿ†«¿ÿ²Æÿ°Äÿ‹­Äÿ‰¬Àÿ†«¿ÿ†«¿ÿ‡¬Àÿ…­Àÿ…­Àÿ„®Áÿ‡¯Âÿ…¯Âÿ…°Áÿ…°Áÿ…°Áÿ„¯Àÿz ²ÿz ²ÿz ²ÿyŸ±ÿyŸ±ÿyŸ±ÿyŸ±ÿyŸ±ÿzŸ³ÿ{ ´ÿzŸ³ÿx±ÿx±ÿyž²ÿx±ÿwœ°ÿvœ®ÿvœ®ÿw¯ÿxž°ÿxž°ÿw¯ÿu›­ÿtš¬ÿvœ®ÿu›­ÿtš¬ÿtš¬ÿu›­ÿu›­ÿtš¬ÿs™«ÿr—«ÿrš­ÿtœ¯ÿvž±ÿx±ÿwœ°ÿv›¯ÿuš®ÿuš®ÿuš®ÿuš®ÿv›¯ÿy›²ÿxš±ÿu—®ÿs•¬ÿv›±ÿuš°ÿuš°ÿuš°ÿuš°ÿuš°ÿv›±ÿwœ²ÿt™¯ÿs˜®ÿs˜®ÿuš°ÿv›±ÿv›±ÿv›±ÿx³ÿx³ÿuš°ÿs˜®ÿr—­ÿt™¯ÿt™¯ÿr—­ÿp•«ÿwœ°ÿv›¯ÿuš®ÿt™­ÿu˜¬ÿt—«ÿt—«ÿt—«ÿs™«ÿtš¬ÿu›­ÿu›­ÿu›­ÿtš¬ÿs™«ÿr˜ªÿq–ªÿq–ªÿr—«ÿr—«ÿr—«ÿr—«ÿs˜¬ÿs˜¬ÿu˜¬ÿt—«ÿt—«ÿs–ªÿt•©ÿt•©ÿt•©ÿu–ªÿu–©ÿt•¨ÿt•¨ÿu–©ÿw—ªÿw—ªÿv–©ÿt”§ÿr’¥ÿs“¦ÿu•¨ÿv–©ÿv–©ÿu•¨ÿs“¦ÿr’¥ÿt”§ÿs“¦ÿs“¦ÿv”§ÿx–©ÿy—ªÿy—ªÿx–§ÿyŸ±ÿyŸ±ÿz ²ÿz ²ÿz ²ÿz ²ÿz ²ÿ{¡³ÿwœ°ÿx±ÿyž²ÿx±ÿx±ÿzŸ³ÿzŸ³ÿyž²ÿ{¡³ÿz ²ÿyŸ±ÿxž°ÿxž°ÿw¯ÿw¯ÿw¯ÿw¯ÿvœ®ÿvœ®ÿw¯ÿyŸ±ÿyŸ±ÿw¯ÿvœ®ÿu°ÿu°ÿu°ÿu°ÿwœ°ÿwœ°ÿwœ°ÿwœ°ÿwœ°ÿwœ°ÿwœ°ÿv›±ÿxš±ÿxš±ÿy›²ÿx³ÿwœ²ÿwœ²ÿv›±ÿv›±ÿwœ²ÿwœ²ÿx³ÿx³ÿwœ²ÿv›±ÿv›±ÿx³ÿx³ÿwœ²ÿwœ²ÿx³ÿ{ ¶ÿx³ÿv›±ÿuš°ÿwœ²ÿx³ÿx³ÿwœ²ÿwœ°ÿwœ°ÿv›¯ÿv›¯ÿx›¯ÿyœ°ÿz±ÿx±ÿs™«ÿs™«ÿtš¬ÿvœ®ÿvœ®ÿw¯ÿw¯ÿw¯ÿt™­ÿt™­ÿt™­ÿt™­ÿt™­ÿt™­ÿt™­ÿt™­ÿu˜¬ÿt—«ÿt—«ÿs–ªÿu–ªÿv—«ÿv—«ÿv—«ÿv—«ÿv—ªÿu–©ÿv—ªÿx˜«ÿx˜«ÿw—ªÿu•¨ÿu•¨ÿu•¨ÿv–©ÿw—ªÿv–©ÿv–©ÿu•¨ÿt”§ÿzš­ÿx˜«ÿv–©ÿu•¨ÿt”§ÿs“¦ÿs‘¤ÿo¢ÿx ²ÿy¡³ÿy¡³ÿy¡³ÿz¢´ÿz¢´ÿ{£¶ÿ{£¶ÿx ³ÿy¡´ÿz¢µÿy¡´ÿy¡´ÿz¢µÿz¢µÿy¡´ÿz¢µÿy¡´ÿwŸ²ÿvž±ÿvž±ÿvž±ÿx ³ÿy¡´ÿwŸ²ÿvž±ÿvž±ÿwŸ²ÿy¡´ÿx ³ÿvž±ÿs›®ÿz¢µÿy¡´ÿwŸ²ÿvž±ÿu°ÿu°ÿv³ÿwž´ÿx³ÿyž´ÿyž´ÿxœ´ÿw›³ÿxœ´ÿ{Ÿ·ÿ~¢ºÿyž´ÿwž´ÿv³ÿv³ÿv³ÿwž´ÿxŸµÿxŸµÿy ¶ÿxŸµÿxŸµÿy ¶ÿy ¶ÿwž´ÿwž´ÿxŸµÿz ¸ÿxž¶ÿuœ²ÿuœ²ÿx³ÿzŸµÿ{ ¶ÿ{ ¶ÿwœ²ÿwœ²ÿwœ²ÿwœ²ÿwœ°ÿx±ÿx±ÿyž²ÿtš¬ÿrš¬ÿrš¬ÿrš¬ÿs›®ÿtœ¯ÿu°ÿvž±ÿtœ¯ÿtœ¯ÿt›±ÿt›±ÿt›±ÿt›±ÿt›±ÿt›±ÿt™¯ÿt™¯ÿs˜®ÿs˜®ÿv˜¯ÿv˜¯ÿv˜¯ÿwš®ÿv™­ÿu˜¬ÿu˜¬ÿu˜¬ÿx™­ÿx™­ÿw˜¬ÿv—«ÿw˜«ÿw˜«ÿw˜«ÿv—ªÿv—ªÿv—ªÿu–©ÿu–©ÿu–©ÿt•¨ÿs”§ÿt•¨ÿu–©ÿu–©ÿu•¨ÿs”§ÿ|¤¶ÿ|¤¶ÿ|¤¶ÿ|¤¶ÿ|¤¶ÿ|¤¶ÿ|¤·ÿ|¤·ÿ}¥¸ÿ~¦¹ÿ~¦¹ÿ|¤·ÿ{£¶ÿ{£¶ÿz¢µÿx ³ÿwŸ²ÿwŸ²ÿvž±ÿvž±ÿwŸ²ÿx ³ÿy¡´ÿz¢µÿ|¤·ÿz¢µÿx ³ÿwŸ²ÿx ³ÿx ³ÿvž±ÿtœ¯ÿy¡´ÿx ³ÿx ³ÿwŸ²ÿvž±ÿwŸ²ÿwž´ÿwž´ÿzŸµÿzŸµÿzž¶ÿzž¶ÿyµÿzž¶ÿ{Ÿ·ÿ}¡¹ÿxž¶ÿxŸµÿwž´ÿwž´ÿwž´ÿxŸµÿxŸµÿy ¶ÿ{¢¸ÿz¡·ÿz¡·ÿ|£¹ÿ|£¹ÿz¡·ÿz¡·ÿ{¢¸ÿz ¸ÿyŸ·ÿxŸµÿxŸµÿzŸµÿ{ ¶ÿ{ ¶ÿzŸµÿzŸµÿyž´ÿx³ÿwœ²ÿv›¯ÿv›¯ÿv›¯ÿv›¯ÿvž°ÿu¯ÿtœ®ÿs›­ÿs›®ÿs›®ÿtœ¯ÿu°ÿx ³ÿx ³ÿxŸµÿxŸµÿwž´ÿwž´ÿwž´ÿwž´ÿx³ÿwœ²ÿwœ²ÿwœ²ÿwœ²ÿy›²ÿy›²ÿy›²ÿy›²ÿwš®ÿv™­ÿwš®ÿwš®ÿz›¯ÿx™­ÿu˜¬ÿx›¯ÿw›­ÿvš¬ÿu™«ÿw˜«ÿu™«ÿw˜«ÿu™«ÿs”§ÿq•§ÿs”§ÿs—©ÿx™¬ÿw›­ÿz›®ÿyš­ÿ~©ºÿ~©ºÿ}¨¹ÿ}¨¹ÿ|¦¹ÿ|¦¹ÿ{¥¸ÿ{¥¸ÿ|¦¹ÿ}§ºÿ}§ºÿ{¥¸ÿz£¹ÿz£¹ÿy¢¸ÿw ¶ÿw¡´ÿx¢µÿx¢µÿy£¶ÿy£¶ÿx¢µÿw¡´ÿw¡´ÿ}§ºÿz¤·ÿw¡´ÿv ³ÿv ³ÿw¡´ÿx¢µÿy£¶ÿuŸ²ÿuŸ²ÿv ³ÿw¡´ÿy ¶ÿy ¶ÿy ¶ÿxŸµÿz ¸ÿz ¸ÿyž¸ÿzŸ¹ÿ} ºÿ|Ÿ¹ÿz·ÿyµÿyŸ·ÿw ·ÿvŸ¶ÿvŸ¶ÿvŸ¶ÿvŸ¶ÿvŸ¶ÿw ·ÿx¡¸ÿx¡¸ÿy¢¹ÿ{¤»ÿ|¥¼ÿ{¤»ÿz£ºÿ{¤»ÿ|¢ºÿ}£»ÿ~¤¼ÿ¥½ÿ}£»ÿ|¢ºÿz¡·ÿy ¶ÿ{ ¶ÿ{ ¶ÿyž´ÿx³ÿwœ²ÿwœ²ÿwœ²ÿwœ°ÿz¢´ÿy¡³ÿx ³ÿwŸ²ÿvž±ÿwŸ²ÿxŸµÿxŸµÿ|£¹ÿ|£¹ÿ|¢ºÿ|¢ºÿ{¡¹ÿ{¡¹ÿ{¡¹ÿ{¡¹ÿz ¸ÿz ¸ÿz ¸ÿyŸ·ÿxž¶ÿyµÿxœ´ÿx³ÿyž´ÿwœ²ÿv›±ÿv›±ÿwœ²ÿy›²ÿxš±ÿwš®ÿyœ°ÿv›¯ÿv›¯ÿuš®ÿv™­ÿt™­ÿv™­ÿt™­ÿz±ÿwœ°ÿwš®ÿt™­ÿv™­ÿs˜¬ÿs–ªÿq”¨ÿ¬½ÿ¬½ÿ€«¼ÿ€«¼ÿ©¼ÿ~¨»ÿ~¨»ÿ~¨»ÿ}§ºÿ©¼ÿ€ª½ÿ©¼ÿ€©¿ÿ€©¿ÿ€©¿ÿ~§½ÿ©¼ÿ©¼ÿ€ª½ÿ©¼ÿ~¨»ÿ|¦¹ÿy£¶ÿx¢µÿz¤·ÿy£¶ÿy£¶ÿx¢µÿx¢µÿz¤·ÿ}§ºÿ©¼ÿw¡´ÿx¢µÿy£¶ÿ{¥¸ÿ}¤ºÿ}¤ºÿ|£¹ÿ{¢¸ÿ}£»ÿ|¢ºÿ|¡»ÿ}¢¼ÿ€£½ÿ¢¼ÿ|Ÿ¹ÿwœ¶ÿ}£»ÿz£ºÿy¢¹ÿy¢¹ÿx¡¸ÿx¡¸ÿx¡¸ÿx¡¸ÿx¡¸ÿx¡¸ÿy¢¹ÿ|¥¼ÿ}¦½ÿ|¥¼ÿ{¤»ÿ|¥¼ÿ~¤¼ÿ€¦¾ÿ§¿ÿ§¿ÿ~¤¼ÿ|¢ºÿ{¢¸ÿ{¢¸ÿyž´ÿyž´ÿyž´ÿyž´ÿyž´ÿzŸµÿzŸµÿ{ ¶ÿx ³ÿx ²ÿx ³ÿx ³ÿy¡´ÿz¢µÿ{¢¸ÿ|£¹ÿ|£¹ÿ|£¹ÿ|¢ºÿ|¢ºÿ{¡¹ÿ{¡¹ÿ{ ºÿ{ ºÿ}¢¼ÿ}£»ÿ|¢ºÿ|¢ºÿ{¡¹ÿz ¸ÿ{Ÿ·ÿzž¶ÿ|¡·ÿzŸµÿx³ÿx³ÿyž´ÿyž´ÿzœ³ÿy›²ÿwœ°ÿwœ°ÿwœ°ÿwœ°ÿwœ°ÿv›¯ÿv›¯ÿv›¯ÿ{ ´ÿyž²ÿwœ°ÿv›¯ÿuš®ÿt™­ÿr—«ÿp•©ÿ‚­¾ÿ‚­¾ÿ‚­¾ÿ‚­¾ÿ‚¬¿ÿ‚¬¿ÿ‚¬¿ÿ‚¬¿ÿ«¾ÿƒ­Àÿ…¯Âÿ„®Áÿ…®Äÿ†¯Åÿ…®Äÿƒ¬Âÿƒ®Ãÿƒ®Ãÿƒ®Ãÿ‚­Âÿ¬Áÿ€«Àÿª¿ÿ~©¾ÿ{¦»ÿ}¨½ÿª¿ÿª¿ÿ}¨½ÿ|§¼ÿ~©¾ÿ€«Àÿ~¨»ÿ~¨»ÿ~§½ÿ~§½ÿ~§½ÿ~§½ÿ§¿ÿ§¿ÿ€¥¿ÿ€¥¿ÿ€¥¿ÿ€¥¿ÿ€¥Áÿ€¥Áÿ‚¤Áÿ¤¾ÿ‚¨Àÿ€©Àÿ~§¾ÿ}¦½ÿ|¥¼ÿ{¤»ÿ{¤»ÿ{¤»ÿz£ºÿy¢¹ÿ{¤»ÿ}¦½ÿ}¦½ÿ|¥¼ÿ{¤»ÿ|¥¼ÿ|¥¼ÿ}¦½ÿ}¦½ÿ|¥¼ÿ{¡¹ÿ{¡¹ÿ|¢ºÿ~¤¼ÿz¡·ÿy ¶ÿ{ ¶ÿ{ ¶ÿ{ ¶ÿ|¡·ÿ|¡·ÿ}¢¸ÿwŸ²ÿx ³ÿy¡´ÿz¢µÿ{¢¸ÿ{¢¸ÿ{¢¸ÿ|£¹ÿ{¡¹ÿ{¡¹ÿ{ ºÿ{ ºÿ{ ºÿ{ ºÿ{ ¼ÿ{ ºÿz¢»ÿz¢»ÿ}¢¼ÿ}¢¼ÿ|¡»ÿ|¡»ÿ{¡¹ÿ{¡¹ÿ|¢ºÿ{¡¹ÿ{Ÿ·ÿzž¶ÿ{Ÿ·ÿ{Ÿ·ÿzž¶ÿyž´ÿx±ÿx±ÿyž²ÿzŸ³ÿwŸ²ÿwŸ²ÿvž±ÿu°ÿvž±ÿu°ÿu°ÿvž±ÿx ³ÿx ³ÿx ³ÿwŸ²ÿ«¾ÿ¬½ÿ‚¬¿ÿƒ­Àÿƒ­Àÿ„®Áÿ…¯Âÿ…¯Âÿ…¯Âÿ‡±Äÿ‡±Äÿ†°Ãÿ†¯Åÿ†¯Åÿ„­Ãÿ‚«Áÿ„¯Äÿƒ®Ãÿ‚­Âÿ‚­Âÿƒ®Ãÿ„¯Äÿ†±Æÿ…²Çÿƒ®Ãÿ…²Çÿ‹¶ËÿˆµÊÿ…°Åÿ¬Áÿ€«Àÿ¬Áÿ†¯Åÿ„®Áÿ‚«Áÿ€©¿ÿ€©¿ÿ€©¿ÿ„ªÂÿ…«Ãÿ‚¨Àÿƒ©Áÿƒ¨Âÿ‚§Áÿ¦Àÿ‚§Áÿ…ªÄÿ‡¬Æÿ„­Äÿ„­Äÿ‚«ÂÿªÁÿ¨¿ÿ~§¾ÿ~§¾ÿ~§¾ÿ|¥¼ÿ{¤»ÿ|¥¼ÿ~§¾ÿ~§¾ÿ{¤»ÿz£ºÿz£ºÿ}¦½ÿ}¦½ÿ|¥¼ÿy¢¹ÿyŸ·ÿz ¸ÿ¥½ÿƒ©Áÿ¨¾ÿ€§½ÿ¦¼ÿ€¥»ÿ¤ºÿ~£¹ÿ~£¹ÿ~£¹ÿ|£¹ÿ|¤·ÿ}¤ºÿ~¥»ÿ}¤ºÿ|£¹ÿ{¢¸ÿz¡·ÿ}£»ÿ{¤»ÿ}¢¼ÿ{£¼ÿ|¤½ÿ|¤½ÿ|¤½ÿ|¤½ÿx ¹ÿy¢¹ÿ|¡»ÿ}£»ÿ}¢¼ÿ}£»ÿ}£»ÿ{¤»ÿ~¤¼ÿ|¢ºÿ{¡¹ÿz ¸ÿz ¸ÿz ¸ÿz ¸ÿy ¶ÿx±ÿyž²ÿzŸ³ÿ|¡µÿz¢µÿx ³ÿwŸ²ÿvž±ÿz¢µÿy¡´ÿy¡´ÿy¡´ÿ{¢¸ÿ{¢¸ÿ{¢¸ÿz¡·ÿu”£ÿt•¤ÿu–¥ÿt•¤ÿr“£ÿq’¢ÿr“£ÿs”¤ÿp‘¡ÿr“£ÿt•¥ÿs”¤ÿp‘¡ÿnŸÿo ÿp‘¡ÿo ÿn ÿo‘¡ÿp’¢ÿp’¢ÿp’¢ÿp‘¡ÿp‘¡ÿnŸÿmŽžÿlÿlÿnŸÿnŸÿmŽžÿnŒÿožÿožÿnŒÿm‹œÿm‹œÿm‹œÿnŒÿnŒÿu“¤ÿpŽŸÿk‰šÿlŠ›ÿm‹œÿm‹œÿm‹œÿm‹œÿk‰šÿlŠ›ÿlŠ›ÿlŠ›ÿm‹œÿnŒÿožÿožÿpŽŸÿožÿqžÿpŒÿo‹œÿo‹œÿnŠ›ÿnŠ›ÿsÿrŒœÿo‰™ÿnˆ˜ÿnˆ˜ÿpŠšÿrŒœÿtŽžÿrŒœÿo‰™ÿm‡—ÿm‡—ÿo‰™ÿpŠšÿnˆ˜ÿl†–ÿo‰™ÿpŠšÿpŠšÿo‰™ÿnˆ˜ÿm‡—ÿm‡—ÿnˆ˜ÿm‡—ÿm‡—ÿnˆ˜ÿo‰™ÿq‹›ÿq‹›ÿo‰™ÿm‡—ÿl‡•ÿl‡•ÿl‡•ÿmˆ–ÿmˆ–ÿmˆ–ÿmˆ–ÿn‰—ÿn‰—ÿmˆ–ÿl‡•ÿl‡•ÿmˆ–ÿmˆ–ÿl‡•ÿk†”ÿmˆ–ÿl‡•ÿj…“ÿj…“ÿk†”ÿk†”ÿl†”ÿk…“ÿm‡•ÿiƒ‘ÿh‚ÿj„’ÿl†”ÿk…“ÿj„’ÿiƒ‘ÿr“£ÿs”£ÿs”¤ÿs”¤ÿs”¤ÿs”¤ÿs”¤ÿt•¥ÿr“£ÿt•¥ÿu–¦ÿu–¦ÿr“£ÿq’¢ÿq‘¤ÿr”¤ÿr”¤ÿr”¤ÿr”¤ÿr”¤ÿq“£ÿp’¢ÿo‘¡ÿn ÿp‘¡ÿp‘¡ÿp‘¡ÿo ÿnŸÿmŽžÿmŽžÿmŽžÿnŸÿmŽžÿožÿlÿnŒÿmŽžÿožÿmŽžÿožÿkŒœÿnŒÿp‘¡ÿt’£ÿp‘¡ÿožÿlÿr¡ÿp‘¡ÿr¡ÿp‘¡ÿq ÿožÿnŒÿm‹œÿk‰šÿk‰šÿk‰šÿk‰šÿm‰šÿk‰šÿm‰šÿm‰šÿo‹œÿoŒ›ÿq‹›ÿn‹šÿpŠšÿmŠ™ÿo‰™ÿmŠ™ÿsÿoŒ›ÿo‰™ÿmŠ™ÿq‹›ÿpœÿq‹›ÿpŠšÿnˆ˜ÿpŠšÿrŒœÿpŠšÿnˆ˜ÿm‡—ÿnˆ˜ÿpŠšÿq‹›ÿpŠšÿpŠšÿpŠšÿq‹›ÿpŠšÿm‡—ÿk…•ÿo‰™ÿn‰—ÿn‰—ÿmˆ–ÿl‡•ÿk†”ÿk†”ÿk†”ÿk†”ÿk†”ÿj…“ÿk†”ÿn‰—ÿoŠ˜ÿn‰—ÿn‰—ÿmˆ–ÿk†”ÿj…“ÿk†”ÿl‡•ÿl‡•ÿl†”ÿj„’ÿo‰—ÿl†”ÿj„’ÿl†”ÿnˆ–ÿm‡•ÿk…“ÿk…“ÿt•¨ÿs•¥ÿr“¦ÿr“¦ÿs”§ÿr“¦ÿr“¦ÿq’¥ÿq’¥ÿr“¦ÿt•¨ÿs”§ÿr“¦ÿq’¥ÿq’¦ÿr“¦ÿt•¨ÿq•§ÿq•§ÿq•§ÿp”¦ÿo“¥ÿn’¤ÿm‘£ÿr“¦ÿs”§ÿs”§ÿq’¥ÿn¢ÿmŽ¡ÿmŽ¡ÿn¢ÿn¢ÿn¢ÿo¢ÿmŽ¡ÿo¢ÿn¢ÿo¢ÿo£ÿnŽ¡ÿl ÿo¢ÿq’¥ÿs“¦ÿp‘¤ÿo¢ÿmŽ¡ÿq‘¤ÿp‘¤ÿq‘¤ÿp‘¤ÿo¢ÿm ÿk‹žÿjŠÿp£ÿp£ÿp£ÿq‘¤ÿs‘¤ÿq‘¤ÿs‘¤ÿt’£ÿlŠ›ÿm‹œÿqžÿq ÿs ÿožÿo‹œÿlŠ›ÿt¡ÿpŽŸÿqžÿožÿqžÿpŽŸÿqžÿpŒÿm‰šÿo‹œÿqžÿpŒÿm‰šÿlˆ™ÿnŠ›ÿpŒÿpŒÿo‹œÿo‹œÿo‹œÿo‹œÿnŠ›ÿlˆ™ÿj‡–ÿn‹šÿn‹šÿmŠ™ÿmŠ™ÿl‰˜ÿkˆ—ÿj‡–ÿj‡–ÿkˆ—ÿj‡–ÿj‡–ÿkˆ—ÿmŠ™ÿn‹šÿn‹šÿmŠ™ÿkˆ—ÿkˆ—ÿkˆ—ÿkˆ—ÿl‰˜ÿl‰˜ÿl†–ÿj„”ÿpŠšÿm‡—ÿl†–ÿm‡—ÿnˆ˜ÿl†–ÿk…•ÿk†”ÿw˜«ÿv—ªÿt•¨ÿs”§ÿt•¨ÿs”§ÿq’¥ÿp‘¤ÿr“§ÿs”§ÿs”¨ÿt•©ÿs”¨ÿs”¨ÿr’©ÿp“§ÿo’¦ÿn”¦ÿp”¦ÿn”¦ÿq•§ÿq•§ÿq•§ÿq•§ÿq•§ÿr–¨ÿr–¨ÿp”¦ÿp‘¤ÿo£ÿo£ÿo£ÿp‘¤ÿp‘¤ÿp‘¤ÿp‘¤ÿp‘¤ÿq’¥ÿq’¥ÿq’¥ÿt•¨ÿr“¦ÿo£ÿn¢ÿmŽ¡ÿmŽ¡ÿn¢ÿp‘¤ÿo£ÿo£ÿn£ÿn¢ÿn£ÿn¢ÿn£ÿn¢ÿmŒ¡ÿm ÿmŒ¡ÿm ÿmŒ¡ÿm ÿmŒ¡ÿm ÿjŠÿkŒœÿpŽŸÿp‘¡ÿs‘¢ÿp‘¡ÿq ÿnŸÿt’£ÿq’¢ÿr¡ÿo ÿpŽŸÿmŽžÿnŒÿm‹œÿm‹œÿqžÿrŽŸÿqžÿpŒÿo‹œÿpŒÿqžÿo‹œÿnŠ›ÿnŠ›ÿo‹œÿqžÿqžÿpŒÿnŠ›ÿo‹œÿoŒ›ÿoŒ›ÿoŒ›ÿoŒ›ÿpœÿpœÿpœÿpœÿoŒ›ÿn‹šÿn‹šÿoŒ›ÿoŒ›ÿn‹šÿmŠ™ÿmŠ™ÿmŠ™ÿmŠ™ÿoŒ›ÿpœÿoŒ›ÿnˆ˜ÿl†–ÿo‰™ÿm‡—ÿl†–ÿm‡—ÿm‡—ÿl†–ÿk…•ÿl†–ÿv™­ÿu˜¬ÿs–ªÿs–ªÿt—«ÿt—«ÿs–ªÿr•©ÿt–­ÿt—«ÿt–­ÿu—®ÿu—®ÿu—®ÿt–®ÿs•¬ÿp•©ÿn–©ÿp•©ÿn–©ÿp•©ÿq–ªÿq–ªÿq–ªÿq–ªÿp•©ÿo”¨ÿo”¨ÿq”¨ÿr•©ÿq”¨ÿp“§ÿq”¨ÿq”¨ÿq”¨ÿr•©ÿr•©ÿr•©ÿr•©ÿr•©ÿu˜¬ÿr•©ÿp“§ÿo’¦ÿn‘¥ÿm¤ÿo’¦ÿq”¨ÿq”¨ÿp“§ÿo‘¨ÿn‘¥ÿn§ÿp“§ÿs•¬ÿt—«ÿp§ÿp‘¥ÿo¦ÿo¤ÿnŽ¥ÿn£ÿm¤ÿmŽ¢ÿmŽ¡ÿmŽ¡ÿo¢ÿn¢ÿo¢ÿn¢ÿo¢ÿn¢ÿq‘¤ÿp‘¤ÿq‘¤ÿo£ÿo¢ÿmŽ¡ÿnŽ¡ÿnŽ¡ÿr£ÿq¢ÿpŽ¡ÿpŽ¡ÿr£ÿr£ÿq¢ÿpŽ¡ÿo ÿnŒŸÿnŒŸÿo ÿpŽ¡ÿq¢ÿpŽ¡ÿožÿožÿožÿožÿožÿpŽŸÿpŽŸÿpŽŸÿpŽŸÿpŽŸÿožÿnŒÿnŒÿožÿožÿnŒÿm‹œÿlŠ›ÿlŠ›ÿm‹œÿnŒÿožÿnŒÿnŠ›ÿk‡˜ÿm‰šÿlˆ™ÿlˆ™ÿm‰šÿm‰šÿk‡˜ÿk‡˜ÿmŠ™ÿu˜¬ÿu˜¬ÿu˜¬ÿv™­ÿwš®ÿx›¯ÿy›²ÿxš±ÿxš±ÿw™°ÿw™°ÿw™±ÿxš²ÿxš²ÿw™±ÿs—¯ÿuœ²ÿu°ÿtœ¯ÿs›®ÿrš­ÿq™¬ÿs˜¬ÿs˜¬ÿt™­ÿr—«ÿq–ªÿr—«ÿt™­ÿuš®ÿv™­ÿt—«ÿu˜¬ÿu˜¬ÿv™­ÿv™­ÿv™­ÿv™­ÿv™­ÿv™­ÿs–ªÿs–ªÿt—«ÿwš®ÿx›¯ÿv™­ÿt—«ÿs–ªÿxš±ÿv˜¯ÿt–­ÿr”«ÿr”«ÿs•¬ÿu—®ÿv˜¯ÿxš±ÿw™°ÿy™°ÿx˜¯ÿw—®ÿv–­ÿv–­ÿu•¬ÿv—«ÿu–©ÿs”§ÿq’¥ÿp‘¤ÿo£ÿp‘¤ÿp‘¤ÿmŽ¡ÿo£ÿq’¥ÿq’¥ÿq’¥ÿp‘¤ÿr“¦ÿs”§ÿt”§ÿs‘¤ÿq¢ÿr£ÿu“¦ÿv”§ÿt’¥ÿq¢ÿu“¦ÿt’¥ÿr£ÿr£ÿs‘¤ÿr£ÿpŽ¡ÿo ÿs‘¤ÿr¡ÿr¡ÿq ÿpŽŸÿožÿožÿnŒÿnŒÿm‹œÿm‹œÿnŒÿpŽŸÿr¡ÿq ÿq ÿnŒÿnŒÿnŒÿožÿpŽŸÿožÿo‹œÿm‰šÿo‹œÿo‹œÿo‹œÿpŒÿo‹œÿm‰šÿnŠ›ÿqžÿv›±ÿwœ²ÿwœ²ÿx³ÿwœ²ÿx³ÿxœ´ÿyµÿyµÿxœ´ÿw›³ÿx›µÿyœ¶ÿyœ¶ÿwš´ÿu™±ÿy ¶ÿv ³ÿuŸ²ÿtž±ÿu°ÿu°ÿu°ÿu°ÿvž±ÿvž±ÿvž±ÿvž±ÿwŸ²ÿwŸ²ÿyž²ÿyž²ÿx±ÿx±ÿyž²ÿyž²ÿyž²ÿx±ÿx±ÿwœ°ÿv›¯ÿt™­ÿuš®ÿyž²ÿ{ ´ÿyž²ÿv›¯ÿuš®ÿwœ²ÿw›³ÿw›³ÿvš²ÿu™±ÿu™±ÿt˜°ÿt˜°ÿt–®ÿt–®ÿs•­ÿs•­ÿs•­ÿr”¬ÿr”¬ÿr”«ÿwš®ÿv™­ÿu˜¬ÿt—«ÿs–ªÿs–ªÿs–ªÿs–ªÿo’¦ÿq”¨ÿs–ªÿs–ªÿr•©ÿq”¨ÿr•©ÿu–ªÿv•ªÿv“¨ÿt‘¦ÿu’§ÿw”©ÿw”©ÿu’§ÿs¥ÿx•ªÿw”©ÿv“¨ÿu’§ÿv“¨ÿu’§ÿt‘¦ÿs‘¤ÿt’¥ÿt’¥ÿs‘¤ÿr£ÿr£ÿq¢ÿpŽ¡ÿpŽ¡ÿpŽ¡ÿo ÿo ÿpŽ¡ÿr£ÿs‘¤ÿs‘¤ÿr£ÿp£ÿo¢ÿnŽ¡ÿnŽ¡ÿq¢ÿq¢ÿpŽ¡ÿo ÿo ÿo ÿq¢ÿq¢ÿqŒ ÿoŠžÿp‹Ÿÿs ÿy ¶ÿz¡·ÿ|¡·ÿxŸµÿx³ÿt›±ÿvš²ÿu›³ÿ~¢ºÿz ¸ÿyž¸ÿyž¸ÿ{ ºÿ{ ºÿx·ÿvœ´ÿvŸµÿtŸ²ÿuž´ÿuŸ²ÿuž´ÿv ³ÿw ¶ÿw¡´ÿz¡·ÿ{¢¸ÿ|£¹ÿ{¢¸ÿz¡·ÿy ¶ÿz¡·ÿ{¢¸ÿ{ ¶ÿy¡´ÿ|¡·ÿz¢µÿ|¡·ÿy¡´ÿzŸµÿx ³ÿ¤ºÿx ³ÿv›±ÿtœ¯ÿx³ÿvž±ÿwœ²ÿuœ²ÿtš²ÿvœ´ÿx·ÿz ¸ÿyž¸ÿwµÿuš´ÿs™±ÿv™³ÿvš²ÿwš´ÿw›³ÿyš´ÿw›³ÿyš´ÿy›³ÿr”«ÿs–ªÿt—«ÿu˜¬ÿv™­ÿwš®ÿwš®ÿx›¯ÿv™­ÿx›¯ÿyœ°ÿwš®ÿt—«ÿq•§ÿs”¨ÿt•©ÿw–«ÿv•ªÿu”©ÿu”©ÿu”©ÿu”©ÿt“¨ÿs’§ÿx•ªÿu”©ÿv“¨ÿu•¨ÿy–«ÿw—ªÿy–«ÿv–©ÿs‘¤ÿq‘¤ÿt’¥ÿr’¥ÿt’¥ÿr’¥ÿu“¦ÿs“¦ÿt’¥ÿq‘¤ÿr£ÿp£ÿs‘¤ÿq‘¤ÿr£ÿo¢ÿs“¦ÿr’¥ÿp£ÿp£ÿs‘¤ÿs‘¤ÿs‘¤ÿr£ÿpŽ¡ÿq¢ÿr£ÿr£ÿqŒ ÿn‰ÿp‹ŸÿsŽ¢ÿn†’ÿl„ÿkƒÿkƒÿl„ÿl„ÿj‚Žÿiÿkƒÿl„ÿm…‘ÿl„ÿj‚Žÿiÿkƒÿn†’ÿkƒÿiÿiÿkƒÿn†’ÿo‡“ÿn†’ÿl„ÿkƒÿm…‘ÿm…‘ÿl„ÿl„ÿn†’ÿm…‘ÿkƒÿiÿj‚Žÿl„ÿm…‘ÿm…‘ÿl„ÿj‚Žÿiÿn†’ÿm…‘ÿkƒÿiÿj‚Žÿm…‘ÿn†’ÿm…‘ÿlƒ’ÿlƒ’ÿlƒ’ÿlƒ’ÿm„“ÿn…”ÿo†•ÿp‡–ÿk‚‘ÿg~ÿg|‹ÿjŽÿo„“ÿp…”ÿlÿg|‹ÿm„“ÿh‚ÿgÿh‚ÿl†”ÿl†”ÿk‚‘ÿg~ÿhŽÿk‚‘ÿn†’ÿm…‘ÿiÿg‹ÿiÿl„ÿhŽÿi€ÿk‚‘ÿk‚‘ÿk‚‘ÿk‚‘ÿlƒ’ÿn…”ÿlƒ’ÿlƒ’ÿk‚‘ÿk‚‘ÿlƒ’ÿk‚‘ÿjÿhŽÿm„“ÿk‚‘ÿjÿlƒ’ÿm„“ÿlƒ’ÿk‚‘ÿnƒ’ÿm‚‘ÿm‚‘ÿlÿlÿlÿlÿjŽÿi~ÿmƒÿiÿg‹ÿiÿl„ÿl„ÿj‚Žÿg‹ÿn„ÿl‚Žÿkÿl‚Žÿn„ÿo…‘ÿn„ÿn‚ÿlƒ’ÿl„ÿl„ÿm…‘ÿn†’ÿn†’ÿn†’ÿn†’ÿm…‘ÿn†’ÿn†’ÿm…‘ÿkƒÿkƒÿl„ÿo‡“ÿs‹—ÿpˆ”ÿm…‘ÿl„ÿm…‘ÿn†’ÿm…‘ÿl„ÿiÿkƒÿl„ÿkƒÿkƒÿl„ÿl„ÿj‚Žÿkƒÿl„ÿm…‘ÿm…‘ÿm…‘ÿm…‘ÿl„ÿkƒÿm…‘ÿm…‘ÿl„ÿkƒÿm…‘ÿn†’ÿn†’ÿl„ÿm„“ÿn…”ÿn…”ÿn…”ÿn…”ÿn…”ÿn…”ÿn…”ÿn…”ÿk‚‘ÿi€ÿjÿp…”ÿo†•ÿnƒ’ÿi€ÿj„’ÿh‚ÿgÿh‚ÿj„’ÿk…“ÿk‚‘ÿhŽÿk‚‘ÿm„“ÿo‡“ÿn†’ÿl„ÿj‚Žÿkƒÿm…‘ÿlƒ’ÿm„“ÿn…”ÿm„“ÿlƒ’ÿlƒ’ÿlƒ’ÿm„“ÿi€ÿi€ÿjÿk‚‘ÿlƒ’ÿlƒ’ÿlƒ’ÿk‚‘ÿn…”ÿk‚‘ÿk‚‘ÿlƒ’ÿn…”ÿm„“ÿlƒ’ÿlƒ’ÿm‚‘ÿm‚‘ÿm‚‘ÿm‚‘ÿm‚‘ÿm‚‘ÿlÿk€ÿkƒÿj‚Žÿj‚Žÿkƒÿl„ÿl„ÿkƒÿj‚Žÿn„ÿmƒÿl‚Žÿmƒÿp†’ÿq‡“ÿp†’ÿo…‘ÿl†”ÿl†”ÿm‡•ÿm‡•ÿm‡•ÿnˆ–ÿo‰—ÿo‰—ÿm‡•ÿnˆ–ÿnˆ–ÿm‡•ÿl†”ÿk…“ÿm‡•ÿnˆ–ÿs™ÿq‹—ÿnˆ”ÿl†’ÿl†’ÿl†’ÿl†’ÿk…‘ÿj„ÿk…‘ÿl†’ÿl†’ÿl†’ÿm‡“ÿm‡“ÿk…‘ÿn†’ÿn†’ÿn†’ÿn†’ÿn†’ÿn†’ÿn†’ÿn†’ÿn†’ÿo‡“ÿo‡“ÿo‡“ÿpˆ”ÿq‰•ÿo‡“ÿl„ÿp‡–ÿp‡–ÿqˆ—ÿqˆ—ÿqˆ—ÿp‡–ÿo†•ÿn…”ÿqˆ—ÿo†•ÿm„“ÿl†”ÿo†•ÿnˆ–ÿo†•ÿl†”ÿm†–ÿk…•ÿj„”ÿj„”ÿk…“ÿl†”ÿl†”ÿk…“ÿk…“ÿl†”ÿm‡•ÿm‡•ÿn†’ÿm…‘ÿm…‘ÿm…‘ÿo†•ÿp‡–ÿp‡–ÿo†•ÿm„“ÿlƒ’ÿlƒ’ÿm„“ÿjÿjÿk‚‘ÿlƒ’ÿlƒ’ÿm„“ÿm„“ÿm„“ÿm‡•ÿj„’ÿlƒ’ÿm„“ÿn…”ÿn…”ÿm„“ÿm„“ÿlƒ’ÿlƒ’ÿlƒ’ÿlƒ’ÿo„“ÿo„“ÿm‚‘ÿlÿj‚Žÿl„ÿm…‘ÿm…‘ÿl„ÿl„ÿl„ÿm…‘ÿp†’ÿo…‘ÿnƒ’ÿo„“ÿp…”ÿq†•ÿp…”ÿo…‘ÿnˆ˜ÿoŠ˜ÿq‹™ÿoŠ˜ÿnˆ–ÿl‡•ÿm‡•ÿmˆ–ÿo‰—ÿn‰—ÿo‰—ÿmˆ–ÿnˆ–ÿmˆ–ÿo‰—ÿoŠ˜ÿnˆ–ÿm‰”ÿo‰•ÿo‹–ÿpŠ–ÿo‹–ÿo‰•ÿm‰”ÿnˆ”ÿnŠ•ÿpŠ–ÿo‹–ÿpŠ–ÿpŒ—ÿpŠ–ÿpŠ–ÿo‰•ÿpˆ”ÿpˆ”ÿo‡“ÿo‡“ÿpˆ”ÿpˆ”ÿq‰•ÿq‰•ÿq‰•ÿq‰•ÿq‰•ÿrŠ–ÿs‹—ÿrŠ–ÿo‡“ÿqˆ—ÿr‰˜ÿsŠ™ÿuŒ›ÿt‹šÿsŠ™ÿr‰˜ÿqˆ—ÿt‹šÿq‹™ÿpŠ˜ÿo‰—ÿo‰—ÿo‰—ÿpŠ˜ÿpŠ˜ÿnˆ˜ÿnˆ˜ÿnˆ˜ÿm‡—ÿm‡•ÿm‡•ÿo‰—ÿpŠ˜ÿm‡•ÿm‡•ÿm‡•ÿm‡•ÿpˆ”ÿo‡“ÿn†’ÿm…‘ÿo†•ÿp‡–ÿp‡–ÿo†•ÿn…”ÿm„“ÿm„“ÿn…”ÿn…”ÿo†•ÿo†•ÿn…”ÿm„“ÿlƒ’ÿlƒ’ÿlƒ’ÿnˆ–ÿl†”ÿm„“ÿo†•ÿp‡–ÿo†•ÿn…”ÿn…”ÿm„“ÿm„“ÿm„“ÿn…”ÿp…”ÿp…”ÿo„“ÿnƒ’ÿj‚Žÿm…‘ÿo‡“ÿo‡“ÿl„ÿkƒÿm…‘ÿo‡“ÿq‡“ÿp†’ÿp…”ÿo„“ÿo„“ÿo„“ÿnƒ’ÿm‚‘ÿmŠ™ÿn‹šÿpŠšÿmŠ™ÿnˆ˜ÿkˆ—ÿm‡—ÿl‰˜ÿo‰™ÿmŠ™ÿnˆ˜ÿl‰˜ÿo‰™ÿn‹šÿq‹›ÿoŒšÿmˆ–ÿl‰—ÿp‹™ÿoŒšÿr›ÿp›ÿqŒšÿoŒšÿp‹™ÿn‹™ÿqŒšÿp›ÿr›ÿp›ÿqŒšÿqŒšÿrŒšÿrŒšÿq‹™ÿq‹™ÿq‹™ÿq‹™ÿrŒšÿrŒšÿs›ÿrŒšÿq‹™ÿpŠ˜ÿq‹™ÿs›ÿs›ÿq‹™ÿqˆ—ÿsŠ™ÿuŒ›ÿvœÿuÿtŽœÿs›ÿrŒšÿs›ÿs›ÿrŒšÿp‹™ÿoŠ˜ÿp‹™ÿqŒšÿr›ÿo‰™ÿo‰™ÿo‰™ÿnˆ˜ÿl†–ÿl†–ÿn‰—ÿp‹™ÿoŠ˜ÿmˆ–ÿnˆ–ÿnˆ–ÿpŠ˜ÿpŠ˜ÿnˆ–ÿl†”ÿo†–ÿp‡—ÿqˆ˜ÿp‡—ÿo†–ÿo†–ÿp‡—ÿqˆ˜ÿp‡—ÿqˆ˜ÿr‰™ÿqˆ˜ÿn…•ÿm„”ÿn…•ÿp‡—ÿo‰—ÿm‡•ÿl†”ÿnˆ–ÿqˆ—ÿp‡–ÿp‡–ÿp‡–ÿo†•ÿo†•ÿo†•ÿo†•ÿr‡–ÿr‡–ÿq†•ÿp…”ÿl‚Žÿo…ÿrˆ“ÿq‡’ÿo…‘ÿmƒÿo…‘ÿq‡“ÿo…‘ÿp†’ÿp†’ÿp†’ÿo„“ÿo„“ÿp…”ÿp…”ÿlˆ™ÿmŠ™ÿn‹šÿn‹šÿn‹šÿn‹šÿoŒ›ÿpœÿpœÿn‹šÿmŠ™ÿn‹šÿoŒ›ÿpœÿpœÿpœÿqŽœÿrÿrÿqŽœÿp›ÿp›ÿqŽœÿrÿrÿqŽœÿrÿsžÿsžÿqŽœÿqŽœÿqŽœÿsŽœÿtŽœÿtŽœÿtŽœÿtŽœÿtŽœÿtŽœÿtŽœÿtŽœÿtŽœÿrŒšÿpŠ˜ÿq‹™ÿtŽœÿtŽœÿs›ÿr‰˜ÿsŠ™ÿuŒ›ÿvœÿuÿuÿuÿuÿs›ÿtŽœÿsŽœÿr›ÿqŒšÿqŒšÿr›ÿsŽœÿpŠšÿq‹›ÿrŒœÿq‹›ÿo‰™ÿo‰™ÿp‹™ÿr›ÿqŒšÿp‹™ÿpŠ˜ÿq‹™ÿrŒšÿrŒšÿpŠ˜ÿnˆ–ÿp‡—ÿqˆ˜ÿr‰™ÿr‰™ÿr‰™ÿr‰™ÿsŠšÿt‹›ÿo†–ÿqˆ˜ÿsŠšÿr‰™ÿp‡—ÿp‡—ÿr‰™ÿuŒœÿq‹™ÿnˆ–ÿnˆ–ÿo‰—ÿr‰˜ÿr‰˜ÿqˆ—ÿqˆ—ÿp‡–ÿp‡–ÿp‡–ÿp‡–ÿsˆ—ÿr‡–ÿq†•ÿp…”ÿn„ÿo…ÿp†‘ÿq‡’ÿp†’ÿo…‘ÿo…‘ÿp†’ÿl‚Žÿn„ÿp†’ÿq‡“ÿq†•ÿr‡–ÿt‰˜ÿuŠ™ÿo‹œÿo‹œÿo‹œÿpŒÿqžÿqžÿqžÿqžÿs ÿqžÿo‹œÿpŒÿqžÿrŽŸÿrŽŸÿpœÿsžÿt‘Ÿÿt‘Ÿÿsžÿp›ÿp›ÿqŽœÿsžÿsžÿrÿrÿsžÿsžÿqŽœÿp›ÿqŽœÿr›ÿsŽœÿtÿtÿtÿtÿsŽœÿr›ÿqŒšÿqŒšÿqŒšÿp‹™ÿqŒšÿsŽœÿr›ÿoŠ˜ÿrŒšÿrŒšÿs›ÿs›ÿtŽœÿtŽœÿsŽœÿsŽœÿr›ÿsŽœÿsŽœÿtÿrÿqŽœÿqŽœÿqŽœÿpœÿqŽÿržÿržÿsÿrŒœÿr›ÿsŽœÿqŒšÿqŒšÿp‹™ÿqŒšÿs›ÿs›ÿq‹™ÿo‰—ÿqˆ˜ÿr‰™ÿsŠšÿsŠšÿr‰™ÿr‰™ÿsŠšÿt‹›ÿo†–ÿr‰™ÿt‹›ÿsŠšÿp‡—ÿp‡—ÿsŠšÿvÿr‹›ÿoˆ˜ÿoˆ˜ÿp‰™ÿsŠšÿsŠšÿr‰™ÿr‰™ÿqˆ˜ÿqˆ˜ÿqˆ˜ÿqˆ˜ÿs‡˜ÿs‡˜ÿq…–ÿp…”ÿr…’ÿq…ÿq…ÿr†‘ÿs‡’ÿs‡’ÿr…’ÿq„‘ÿo‚ÿq„‘ÿq‡“ÿq‡“ÿp…”ÿq†•ÿsˆ—ÿuŠ™ÿt¡ÿs ÿrŽŸÿrŽŸÿrŽŸÿrŽŸÿqžÿpŒÿv’£ÿs ÿqžÿqžÿs ÿs ÿrŽŸÿpœÿoŒšÿrÿu’ ÿu’ ÿrÿqŽœÿqŽœÿqŽœÿqŽœÿoŒšÿoŒšÿqŽœÿp›ÿmŠ˜ÿl‰—ÿmŠ˜ÿoŠ˜ÿp‹™ÿr›ÿsŽœÿsŽœÿr›ÿp‹™ÿoŠ˜ÿn‰—ÿp‹™ÿqŒšÿqŒšÿsŽœÿsŽœÿp‹™ÿmˆ–ÿtŽœÿs›ÿs›ÿrŒšÿrŒšÿrŒšÿqŒšÿr›ÿr›ÿsŽœÿtÿužÿužÿsžÿtÿqŽœÿn‹šÿpœÿqŽÿržÿsÿq‹›ÿqŒšÿqŒšÿqŒšÿp‹™ÿp‹™ÿp‹™ÿqŒšÿp‹™ÿpŠ˜ÿo‰—ÿoˆ˜ÿr‰™ÿsŠšÿr‰™ÿqˆ˜ÿp‡—ÿqˆ˜ÿr‰™ÿr‰™ÿt‹›ÿvÿsŠšÿp‡—ÿn…•ÿqˆ˜ÿt‹›ÿr‹›ÿpŠ˜ÿoˆ˜ÿq‹™ÿt‹›ÿsŠ™ÿr‰™ÿr‰˜ÿr‰™ÿr‰˜ÿqˆ˜ÿqˆ—ÿs‡˜ÿsˆ—ÿq…–ÿp…”ÿt‡”ÿr†‘ÿp„ÿr†‘ÿu‰”ÿu‰”ÿs†“ÿpƒÿr…’ÿt‡”ÿs‰•ÿq‡“ÿnƒ’ÿm‚‘ÿnƒ’ÿo„“ÿr„ÿr„ÿp„ÿoƒŽÿo‚ÿn„ÿo…‘ÿo…‘ÿrŠ–ÿrŠ–ÿtŠ–ÿtŠ–ÿs‰•ÿrˆ”ÿp†’ÿp†’ÿvŒ˜ÿs‰•ÿp†’ÿq‡“ÿu‹—ÿvŒ˜ÿuˆ—ÿr…”ÿuˆ—ÿuˆ—ÿt‡–ÿs†•ÿs†•ÿt‡–ÿuˆ—ÿv‰˜ÿvˆ™ÿs‡˜ÿw‰šÿyžÿ{žÿvŠ›ÿvˆ™ÿu‰šÿxŒÿvŠ›ÿvˆ™ÿvˆ™ÿy‹œÿzŒÿy‹œÿw‰šÿuˆ—ÿx‹šÿzœÿx‹šÿt‡–ÿq„“ÿs†•ÿv‰˜ÿwŠ—ÿwŠ—ÿz‹˜ÿ|šÿ}Ž›ÿÿ€‘žÿ’Ÿÿ„•¢ÿ€“ ÿ}ÿzšÿzšÿ{Ž›ÿ~‘ ÿ‚“ ÿ‚“ ÿ„”¡ÿ‚ÿƒ‘ÿ™¥ÿ‹—¡ÿ‰“ÿ˜ ÿ‡“™ÿ‹—›ÿ‰•™ÿŽšžÿœ«®ÿ¥´·ÿ¨¹¼ÿ±ÂÅÿ±ÂÅÿ¶ÇÊÿ»ÌÏÿ½ÎÑÿ¿ÎÑÿÁÐÓÿÄÓÖÿÆÕØÿÃÕÖÿÄÖ×ÿÅ×ØÿÅ×ØÿÄÖ×ÿÃÕÖÿÃÕÖÿÄÖ×ÿÌÛÝÿÉØÚÿÆÕ×ÿÅÔÖÿÆÕ×ÿÇÖØÿÇÖØÿÇÖØÿÄÔÓÿÄÔÓÿÅÕÔÿÇ×ÖÿÉÙØÿÉÙØÿÆÕ×ÿÄÓÕÿÁÐÒÿÃÓÒÿÄÓÕÿÅÕÔÿÄÓÕÿÂÒÑÿÁÐÒÿÁÑÐÿu†“ÿt†‘ÿr†‘ÿr†‘ÿp†’ÿq‡“ÿrˆ”ÿrˆ”ÿrŠ–ÿq‰•ÿs‰•ÿrˆ”ÿrˆ”ÿrˆ”ÿs‰•ÿs‰•ÿs‰•ÿq‡“ÿn„ÿo…‘ÿrˆ”ÿs‰•ÿs†•ÿpƒ’ÿt‡–ÿs†•ÿr…”ÿq„“ÿpƒ’ÿq„“ÿr…”ÿp…”ÿs‡˜ÿr†—ÿr†—ÿtˆ™ÿtˆ™ÿr†—ÿr†—ÿtˆ™ÿtˆ™ÿq…–ÿqƒ”ÿr„•ÿs…–ÿt†—ÿs…–ÿr„•ÿo„“ÿq†•ÿuˆ—ÿs†•ÿpƒ’ÿnÿpƒ’ÿr…”ÿr…’ÿr…’ÿu†“ÿwˆ•ÿx‰–ÿyŠ—ÿz‹˜ÿyŒ™ÿ€“ ÿ’Ÿÿ|œÿzšÿzšÿy›ÿ|žÿ}Ÿÿ’Ÿÿƒ”¡ÿ‘žÿ…’ ÿ‹™¥ÿ‹—£ÿ‰“ÿŽ™¡ÿœ¢ÿ•¡¥ÿ“Ÿ£ÿ“¢¥ÿž­°ÿ¤³¶ÿ¥¶¹ÿ­¾Áÿ¸ÉÌÿ¼ÍÐÿ¿ÐÓÿÀÑÔÿÃÒÕÿÅÔ×ÿÅÔ×ÿÅÔ×ÿÃÕÖÿÄÖ×ÿÅ×ØÿÄÖ×ÿÃÕÖÿÂÔÕÿÃÕÖÿÄÖ×ÿÌÛÝÿÊÙÛÿÈ×ÙÿÇÖØÿÈ×ÙÿÉØÚÿÈ×ÙÿÈ×ÙÿÉØÚÿÈØ×ÿÈØ×ÿÉÙØÿÉÙØÿÉÙØÿÆÕ×ÿÄÓÕÿÄÓÕÿÅÔÖÿÅÔÖÿÅÔÖÿÄÓÕÿÄÓÕÿÅÔ×ÿÆÕ×ÿv‡”ÿv‡”ÿt‡”ÿt‡”ÿrˆ”ÿs‰•ÿtŠ–ÿu‹—ÿrŠ–ÿq‰•ÿq‡“ÿp†’ÿq‡“ÿrˆ”ÿtŠ–ÿvŒ˜ÿt‡”ÿr…’ÿpƒÿq„‘ÿs†“ÿs†“ÿr…’ÿo‚ÿt‡–ÿs†•ÿp…”ÿo„“ÿn‚“ÿoƒ”ÿoƒ”ÿp„•ÿtˆ™ÿqˆ˜ÿp‡—ÿo†–ÿo†–ÿo†–ÿr†—ÿs‡˜ÿr†—ÿp„•ÿoƒ”ÿn‚“ÿqƒ”ÿr„•ÿqƒ”ÿp‚“ÿo„“ÿp…”ÿp…”ÿo„“ÿnƒ’ÿnƒ’ÿnƒ’ÿnƒ’ÿpƒÿpƒÿq„‘ÿr…’ÿr…’ÿs†“ÿt‡”ÿt‡”ÿx‹˜ÿvŒ˜ÿuŠ™ÿuŠ™ÿuŠ™ÿt‹šÿwŒ›ÿxœÿyŽÿ€“¢ÿ€‘žÿ‚’ŸÿŠ˜¤ÿˆ–¢ÿˆ” ÿ›¥ÿ‘œ¤ÿš¦¬ÿ›ª­ÿ ¯²ÿª¹¼ÿ¬½Àÿ®¿Âÿ¶ÇÊÿ¾ÏÒÿÀÑÔÿÂÓÖÿÂÓÖÿÅÔ×ÿÇÖÙÿÅÔÖÿÃÒÔÿÃÕÖÿÃÕÖÿÄÖ×ÿÃÕÖÿÂÔÕÿÂÔÕÿÃÔ×ÿÄÕØÿÊÙÜÿÉØÛÿÈ×ÚÿÈ×ÚÿÉØÛÿÊÙÜÿÉØÛÿÈ×ÙÿÉÛÜÿÈÚÛÿÇÙÚÿÇÙÚÿÇÙÚÿÇÙÚÿÆØÙÿÄÖ×ÿÅÖÙÿÄÕØÿÃÔ×ÿÂÓÖÿÂÓÖÿÄÕØÿÅÕÛÿÆ×Úÿt…’ÿt…’ÿr…’ÿr…’ÿq‡“ÿrˆ”ÿs‰•ÿtŠ–ÿq‰•ÿq‰•ÿrˆ”ÿq‡“ÿq‡“ÿrˆ”ÿs‰•ÿs‰•ÿuˆ•ÿs†“ÿr…’ÿr…’ÿs†“ÿt‡”ÿr…’ÿq„‘ÿr…”ÿr…”ÿo„“ÿo„“ÿoƒ”ÿp„•ÿq…–ÿq…–ÿqˆ˜ÿqˆ˜ÿqˆ˜ÿp‡—ÿo†–ÿp‡—ÿr†—ÿr†—ÿs‡˜ÿr†—ÿq…–ÿp„•ÿr„•ÿr„•ÿr„•ÿr„•ÿr‡–ÿq†•ÿp…”ÿp…”ÿq†•ÿq†•ÿp…”ÿo„“ÿs†“ÿs†“ÿs†“ÿt‡”ÿt‡”ÿt‡”ÿuˆ•ÿuˆ•ÿo…‘ÿp†’ÿq†•ÿsˆ—ÿr‰˜ÿt‹šÿt‹šÿuŒ›ÿv‹šÿ{Ÿÿ|œÿÿ…•¡ÿˆ–¢ÿ‰—£ÿ•¡«ÿ”Ÿ§ÿ ¬²ÿ¥´·ÿ¬»¾ÿ³ÄÇÿµÆÉÿµÆÉÿ½ÎÑÿ½ÎÑÿÀÑÔÿÂÓÖÿÂÓÖÿÄÓÖÿÅÔ×ÿÄÓÕÿÂÑÓÿÀÒÓÿÁÓÔÿÂÔÕÿÁÓÔÿÁÓÔÿÂÔÕÿÄÕØÿÆ×ÚÿÈ×ÚÿÇÖÙÿÇÖÙÿÈ×ÚÿÉØÛÿÉØÛÿÈ×ÚÿÆÕØÿÆØÙÿÄÖ×ÿÃÕÖÿÄÖ×ÿÅ×ØÿÇÙÚÿÇÙÚÿÆØÙÿÃÔ×ÿÂÓÖÿÁÒÕÿÁÒÕÿÁÑ×ÿÁÑ×ÿÁÑ×ÿÁÑ×ÿs„‘ÿs„‘ÿq„‘ÿq„‘ÿr…’ÿs†“ÿrˆ”ÿs‰•ÿrˆ”ÿrˆ”ÿs‰•ÿs‰•ÿrˆ“ÿq‡’ÿr†‘ÿq…ÿu‡’ÿt†‘ÿt†‘ÿt†‘ÿr†‘ÿr†‘ÿr…’ÿq„‘ÿpƒ’ÿpƒ’ÿnƒ’ÿo„“ÿp„•ÿq…–ÿr†—ÿs‡˜ÿm„“ÿnˆ–ÿo‰—ÿnˆ–ÿp‡–ÿp‡–ÿo†•ÿlƒ’ÿr‡–ÿr‡–ÿt‡–ÿr…”ÿr…”ÿq„“ÿr…”ÿr…”ÿr‡–ÿp…”ÿo„“ÿp…”ÿr‡–ÿsˆ—ÿq‡“ÿp†’ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿrˆ”ÿs‰•ÿt‰˜ÿv‹šÿuŒ›ÿvœÿtŽœÿtŽœÿt‹šÿ{Ÿÿ{Ž›ÿ}Ž›ÿƒ• ÿ‡—£ÿ©ÿ›ª³ÿ¢¯·ÿ¬ºÀÿ°¾Äÿ±¿Åÿ³ÄÇÿ²ÃÆÿ±ÂÅÿ¸ÉÌÿ·ÈËÿ¼ÍÐÿÀÑÔÿÁÒÕÿÂÑÓÿÂÑÓÿÅÒÔÿÂÑÓÿ¾ÐÑÿ¿ÑÒÿÀÒÓÿÀÒÓÿÀÑÔÿÂÓÖÿÇÖÙÿÉØÛÿÇÖÙÿÇÖÙÿÆÔÚÿÇÕÛÿÈÖÜÿÈÖÜÿÇÕÛÿÆÕØÿÄÖ×ÿÀÔÕÿ¿ÓÔÿ¿ÓÔÿÁÔ×ÿÁÔ×ÿÁÔ×ÿÁÔ×ÿ½ÐÕÿ¼ÏÔÿ¼ÏÔÿ¼ÏÔÿ½ÏÖÿ¼ÎÕÿ¸ÊÑÿµÈÍÿt…’ÿt…’ÿr…’ÿr…’ÿs†“ÿs†“ÿrˆ”ÿs‰•ÿrˆ”ÿs‰•ÿtŠ–ÿtŠ–ÿs‰”ÿq‡’ÿq…ÿoƒŽÿr„ÿs…ÿs…ÿs…ÿq…ÿq…ÿq„‘ÿq„‘ÿq„“ÿq„“ÿp…”ÿq†•ÿr†—ÿs‡˜ÿtˆ™ÿsŠšÿm„“ÿpŠ˜ÿrŒšÿpŠ˜ÿr‰˜ÿsŠ™ÿqˆ—ÿm„“ÿr‡–ÿsˆ—ÿuˆ—ÿt‡–ÿr…”ÿr…”ÿs†•ÿt‡–ÿr‡–ÿq†•ÿp…”ÿq†•ÿsˆ—ÿt‰˜ÿs‰•ÿrˆ”ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿw™ÿw™ÿwŒ›ÿxœÿvœÿuŒ›ÿs›ÿrŒšÿvœÿz‘ ÿzœÿ|œÿ„–¡ÿˆš¥ÿ ¬ÿŸ®·ÿª·¿ÿ²ÀÆÿ²ÀÆÿ°¾Äÿ±ÂÅÿ°ÁÄÿ±ÂÅÿºËÎÿ´ÅÈÿºËÎÿ¿ÐÓÿÀÑÔÿÁÐÒÿÂÑÓÿÅÒÔÿÄÓÕÿ¿ÎÐÿ¿ÑÒÿÀÒÓÿÀÒÓÿÀÑÔÿÁÒÕÿÅÔ×ÿÇÖÙÿÇÖÙÿÆÕØÿÅÓÙÿÅÓÙÿÆÔÚÿÇÕÛÿÆÔÚÿÅÔ×ÿÃÔ×ÿÀÔÕÿ¾ÒÓÿ½ÑÒÿ½ÐÓÿ¼ÏÒÿºÍÐÿ¸ËÎÿ¸ËÐÿ·ÊÏÿ·ÊÏÿ¸ËÐÿ¹ËÒÿ·ÉÐÿ²ÄËÿ®ÀÇÿwˆ•ÿv‡”ÿv‡”ÿv‡”ÿtˆ“ÿu‰”ÿtŠ•ÿtŠ•ÿs‰”ÿs‰”ÿs‰”ÿtŠ•ÿu‰”ÿtˆ“ÿs‡’ÿs‡’ÿs†Žÿt‡ÿt‡ÿuˆÿt†‘ÿt†‘ÿs†“ÿt‡”ÿuˆ•ÿuˆ•ÿsˆ—ÿt‰˜ÿtˆ™ÿu‰šÿu‰šÿt‹›ÿo†•ÿrŒšÿs›ÿpŠ˜ÿr‰˜ÿuŒ›ÿuŒ›ÿp‡–ÿr‡–ÿsˆ—ÿv‰˜ÿuˆ—ÿs†•ÿr…”ÿv†–ÿv‰˜ÿsˆ—ÿr‡–ÿr‡–ÿsˆ—ÿu‹—ÿvŒ˜ÿvŒ˜ÿu‹—ÿv‰–ÿv‰–ÿv‰–ÿv‰–ÿvŠ•ÿvŠ•ÿvŠ•ÿvŠ•ÿwŠ—ÿwŠ—ÿuŠ™ÿv‹šÿt‹šÿrŒšÿs›ÿs›ÿtŽœÿ{’¡ÿ{‘ÿ~‘žÿ‡™¤ÿ‰›¦ÿŽžªÿœ«´ÿ¡®¶ÿª¸¾ÿ«¹¿ÿ¬ºÀÿ¯¿Åÿ°ÀÆÿ±ÂÅÿºËÎÿ´ÅÈÿ¹ÊÍÿÀÏÑÿÁÐÒÿÂÑÓÿÃÒÔÿÆÓÕÿÃÒÔÿÁÐÒÿÀÒÓÿÁÓÔÿÁÓÔÿÁÐÓÿÁÐÓÿÂÑÔÿÃÒÕÿÆÔÚÿÄÒØÿÂÐÖÿÁÏÕÿÄÐÖÿÅÑ×ÿÅÑ×ÿÂÑÔÿ¿ÐÓÿ»ÏÐÿºÎÏÿºÎÏÿ¹ÌÏÿ·ÊÍÿ´ÇÌÿ±ÄÉÿ³ÆËÿ±ÄÉÿ¯ÁÈÿ±ÃÊÿ³ÄÍÿ³ÄÍÿ¯ÀÉÿ«½Äÿv‰–ÿuˆ•ÿuˆ•ÿuˆ•ÿu‰”ÿs‰”ÿtŠ•ÿtŠ•ÿtŠ•ÿs‰”ÿs‰”ÿrˆ“ÿs‰”ÿs‰”ÿvŠ•ÿw‹–ÿs‡’ÿuŠ’ÿvŠ•ÿvŠ•ÿvŠ•ÿvŠ•ÿwŠ—ÿvŒ˜ÿuˆ•ÿs‰•ÿsˆ—ÿqˆ—ÿs‡˜ÿqˆ˜ÿs‡˜ÿqˆ˜ÿp‡–ÿrŒšÿsŠ™ÿn…”ÿo†•ÿt‹šÿuŒ›ÿqˆ—ÿp…”ÿr‡–ÿuˆ—ÿt‡–ÿq„“ÿq„“ÿs†•ÿuˆ—ÿr‡–ÿr‡–ÿr‡–ÿsˆ—ÿtŠ–ÿu‹—ÿu‹—ÿu‹—ÿwŠ—ÿwŠ—ÿwŠ—ÿwŠ—ÿw‹–ÿw‹–ÿw‹–ÿw‹–ÿs†“ÿq†•ÿr‡–ÿr‰˜ÿt‹›ÿtŽœÿvŸÿw‘ŸÿsŒœÿx’ ÿz‘ ÿ}’¡ÿ†™¦ÿ†™¦ÿŠ›¨ÿ”¤°ÿ–¦­ÿ °¶ÿ¦³»ÿ¦¶¼ÿ¬¼ÃÿªºÀÿ©¹¿ÿ¯¿ÅÿµÅËÿ¹ÉÏÿ¼ÍÐÿ¾ÏÒÿÂÑÔÿÄÓÖÿÃÒÕÿÁÐÓÿÃÒÔÿÂÔÕÿÂÔÕÿÁÓÔÿÁÐÓÿ¿ÎÑÿ¿ÎÑÿÀÏÒÿÄÒØÿÁÏÕÿ¿ÍÓÿ½ËÑÿ¾ÌÒÿ¿ÍÓÿÁÍÓÿ¿ÍÓÿ¸ÉÌÿ·ÉÊÿ·ÉÊÿ¸ÊËÿ¸ÉÌÿ¶ÇÊÿ³ÃÉÿ±ÁÇÿ±ÁÇÿ®¾Äÿ«»Áÿ¬¼Âÿ°ÀÇÿ±ÁÈÿ¯¿Æÿ¬¼ÂÿÄÔÓÿÁÑÐÿÀÐÏÿÄÔÓÿÄÔÓÿÂÒÑÿÅÓÒÿÉ×ÖÿÂÐÏÿÀÎÍÿ¿ÍÌÿÁÏÎÿÃÑÐÿÅÓÒÿÄÒÑÿÂÐÏÿÁÎÌÿÁÎÌÿÂÏÍÿÃÐÎÿÃÐÎÿÃÐÎÿÃÐÎÿÃÐÎÿÁÏËÿÁÏËÿÂÐÌÿÃÑÍÿÂÐÌÿÁÏËÿÀÎÊÿ¿ÍÉÿÃÎÌÿÂÍËÿÁÌÊÿÀËÉÿÀËÈÿÀËÈÿÁÌÉÿÂÍÊÿÁÌÉÿÁÌÉÿÂÍÊÿÂÍÊÿÂÎÈÿÁÍÇÿÀÌÆÿÀÌÆÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀÌÆÿÀÌÆÿÁÍÇÿÁÍÇÿÁÍÇÿÁÍÇÿÀÌÆÿÀÌÆÿ¿ËÅÿ¿ËÅÿ¿ËÅÿ¿ËÅÿ¿ËÅÿ¿ËÅÿ¿ËÅÿ¿ËÅÿÃÍÇÿÃÍÇÿÂÌÆÿÁËÅÿÂÌÆÿÃÍÇÿÄÎÈÿÅÏÉÿÃÍÇÿÂÌÆÿÁËÅÿÂÌÆÿÃÍÇÿÃÍÇÿÂÌÆÿÁËÅÿÂÍÅÿÂÍÅÿÂÍÅÿÂÍÅÿÂÍÅÿÁÌÄÿÁÌÄÿÀËÃÿÁÌÄÿÁÌÄÿÀËÃÿÀËÃÿÀËÃÿÀËÃÿ¿ÊÂÿ¿ÊÂÿÁÈÃÿÁÈÃÿÂÉÄÿÂÉÄÿÂÉÄÿÂÉÄÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÂÉÄÿÂÉÄÿÂÉÄÿÁÈÃÿÀÇÂÿÅÔÖÿÁÑÐÿ¿ÏÎÿÁÑÐÿÁÑÐÿÀÐÏÿÃÑÐÿÇÕÔÿÇÕÔÿÅÓÒÿÄÒÑÿÄÒÑÿÆÔÓÿÆÔÓÿÅÓÒÿÃÑÐÿÄÐÐÿÄÑÏÿÅÒÐÿÅÒÐÿÅÒÐÿÅÒÐÿÅÒÐÿÄÑÏÿÃÑÍÿÃÑÍÿÄÒÎÿÄÒÎÿÃÑÍÿÃÑÍÿÂÐÌÿÂÐÌÿÄÏÍÿÄÏÍÿÃÎÌÿÂÍËÿÂÍÊÿÂÍÊÿÂÍÊÿÃÎËÿÂÍÊÿÂÍÊÿÃÎËÿÃÎËÿÃÏÉÿÂÎÈÿÁÍÇÿÁÍÇÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀËÈÿÀÌÆÿÀÌÆÿÁÍÇÿÁÍÇÿÁÍÇÿÀÌÆÿÀÌÆÿ¿ËÅÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÂÌÆÿÂÌÆÿÂÌÆÿÂÌÆÿÂÌÆÿÂÌÆÿÃÍÇÿÃÍÇÿÃÍÇÿÂÌÆÿÁËÅÿÂÌÆÿÃÍÇÿÃÍÇÿÂÌÆÿÁËÅÿÂÍÅÿÂÍÅÿÂÍÅÿÂÍÅÿÂÍÅÿÁÌÄÿÁÌÄÿÀËÃÿÁÌÄÿÁÌÄÿÁÌÄÿÀËÃÿÀËÃÿÀËÃÿÀËÃÿÀËÃÿÄËÆÿÄËÆÿÄËÆÿÄËÆÿÄËÆÿÄËÆÿÄËÆÿÄËÆÿÁÈÃÿÂÉÄÿÃÊÅÿÃÊÅÿÂÉÄÿÂÉÄÿÂÉÄÿÂÉÄÿÂÔÕÿ¿ÑÒÿ¼ÎÏÿ½ÏÐÿ½ÏÐÿ¼ÎÏÿÀÏÑÿÃÒÔÿÃÒÔÿÂÑÓÿÁÐÒÿÂÑÓÿÃÒÔÿÄÓÕÿÃÒÔÿÄÒÑÿÆÒÒÿÇÓÓÿÇÓÓÿÈÔÔÿÇÔÒÿÇÔÒÿÆÓÑÿÆÓÑÿÆÓÑÿÅÒÐÿÅÒÐÿÄÑÏÿÄÒÎÿÄÒÎÿÄÒÎÿÄÒÎÿÃÐÎÿÃÐÎÿÄÑÏÿÄÑÏÿÃÐÎÿÃÐÎÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÁÏËÿÁÏËÿÁÏËÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÁÌÉÿÁÌÉÿÁÌÉÿÁÌÉÿÁÌÉÿÁÌÉÿÁÌÉÿÁÌÉÿÁÍÇÿÁÍÇÿÁÍÇÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿ¿ËÅÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÁÍÇÿÀÌÆÿÀÌÆÿÀÌÆÿ¿ËÅÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿ¿ÌÄÿ¿ÌÄÿ¾ËÃÿ¿ÌÄÿ¿ÌÄÿ¿ÌÄÿ¿ÌÄÿ¾ËÃÿ¾ËÃÿ¾ËÃÿ¾ËÃÿÁËÅÿÁËÅÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿÀÊÄÿÁËÅÿÁËÅÿ¿ÉÃÿÁËÅÿÃÍÇÿÂÌÆÿÁËÅÿ¿ÉÃÿÀÊÄÿÁËÅÿ½ÎÑÿ¼ÎÏÿ¼ÎÏÿ¼ÎÏÿ¼ÎÏÿ¼ÎÏÿ¿ÎÐÿÀÏÑÿ¼ËÍÿ½ÌÎÿ½ÌÎÿ¿ÎÐÿÁÐÒÿÂÑÓÿÃÒÔÿÃÒÔÿÄÒÑÿÆÒÒÿÆÒÒÿÇÓÓÿÇÔÒÿÆÓÑÿÆÓÑÿÅÒÐÿÇÔÒÿÆÓÑÿÄÑÏÿÃÐÎÿÃÑÍÿÄÒÎÿÅÓÏÿÅÓÏÿÄÑÏÿÄÑÏÿÅÒÐÿÆÓÑÿÅÒÐÿÄÑÏÿÃÑÍÿÂÐÌÿÄÒÎÿÄÒÎÿÄÒÎÿÃÑÍÿÃÑÍÿÃÑÍÿÂÐÌÿÂÐÌÿÃÎËÿÃÎËÿÃÎËÿÃÎËÿÃÎËÿÃÎËÿÃÎËÿÃÎËÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÍÊÿÂÎÈÿÂÎÈÿÂÎÈÿÂÎÈÿÂÎÈÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÀÌÆÿÁÍÇÿÂÎÈÿÂÎÈÿÁÍÇÿ¿ËÅÿ¾ÊÄÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿ¿ÌÄÿ¿ÌÄÿ¾ËÃÿÀÍÅÿÀÍÅÿ¿ÌÄÿ¿ÌÄÿ¿ÌÄÿ¿ÌÄÿ¾ËÃÿ¾ËÃÿÁËÅÿÀÊÄÿ¿ÉÃÿ½ÇÁÿ½ÇÁÿ¿ÉÃÿÀÊÄÿÁËÅÿ¿ÉÃÿÁËÅÿÃÍÇÿÃÍÇÿÀÊÄÿ¿ÉÃÿÀÊÄÿÂÌÆÿ´ÇÊÿ¶ÉÌÿ¸ËÎÿ¹ÌÏÿ¼ÍÐÿ¼ÍÐÿ¼ÍÐÿ»ÌÏÿ·ÈËÿ¸ÉÌÿ¹ÊÍÿ»ÌÏÿ¼ÍÐÿ½ÎÑÿÁÐÓÿÂÑÓÿ¿ÍÌÿÀÎÍÿÁÏÎÿÂÐÏÿÃÑÐÿÃÑÐÿÃÑÐÿÂÐÏÿÆÔÒÿÅÓÑÿÄÒÐÿÃÑÏÿÂÐÎÿÃÑÏÿÄÒÐÿÄÒÐÿÄÑÏÿÅÒÐÿÆÓÑÿÆÓÑÿÆÓÑÿÅÒÐÿÃÐÎÿÃÐÎÿÄÒÎÿÄÒÎÿÄÒÎÿÄÒÎÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÁÏËÿÁÏËÿÁÏËÿÁÏËÿÁÏËÿÁÏËÿÁÏËÿÁÏËÿÁÏÉÿÂÐÊÿÂÐÊÿÂÐÊÿÁÏÉÿÀÎÈÿ¿ÍÇÿ¿ÍÇÿ¾ÌÆÿ¾ÌÆÿ¾ÌÆÿ¾ÌÆÿ¾ÌÆÿ¾ÌÆÿ¾ÌÆÿ¾ÌÆÿÁÍÇÿÁÍÇÿÂÎÈÿÃÏÉÿÂÎÈÿÁÍÇÿÀÌÆÿ¿ËÅÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿ¿ÌÄÿ¿ÌÄÿ¾ËÃÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿ¿ÌÄÿ¿ÌÄÿ¿ÌÄÿÅÏÉÿÃÍÇÿÂÌÆÿÁËÅÿÁËÅÿÂÌÆÿÃÍÇÿÅÏÉÿ¾ÈÂÿÁËÅÿÃÍÇÿÃÍÇÿÀÊÄÿ¿ÉÃÿÀÊÄÿÂÌÆÿ®ÁÆÿ±ÄÇÿ³ÆÉÿ³ÆÉÿ¶ÇÊÿ¸ÉÌÿ·ÈËÿµÆÉÿ´ÅÈÿµÆÉÿ¶ÇÊÿ¶ÇÊÿ¶ÇÊÿµÆÉÿ¹ÈËÿºÉËÿ¹ÆÈÿºÈÇÿ¼ÊÉÿ¾ÌËÿ¿ÍÌÿÁÏÎÿÁÏÎÿÁÏÎÿÅÓÑÿÅÓÑÿÄÒÐÿÄÒÐÿÄÒÐÿÄÒÐÿÄÒÐÿÄÒÐÿÄÑÏÿÅÒÐÿÅÒÐÿÅÒÐÿÅÒÐÿÄÑÏÿÃÐÎÿÃÐÎÿÄÒÎÿÄÒÎÿÄÒÎÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÃÑÍÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÊÿÂÐÊÿÃÑËÿÃÑËÿÂÐÊÿÁÏÉÿÁÏÉÿÀÎÈÿ¿ÍÇÿ¿ÍÇÿ¿ÍÇÿ¿ÍÇÿ¿ÍÇÿ¿ÍÇÿ¿ÍÇÿ¿ÍÇÿÂÎÈÿÂÎÈÿÂÎÈÿÂÎÈÿÂÎÈÿÂÎÈÿÁÍÇÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿ¿ÌÄÿ¿ÌÄÿ¾ËÃÿÁÎÆÿÁÎÆÿÁÎÆÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿ¿ÌÄÿÃÍÇÿÂÌÆÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÂÌÆÿÃÍÇÿ¿ÉÃÿÁËÅÿÃÍÇÿÃÍÇÿÁËÅÿÀÊÄÿÁËÅÿÂÌÆÿª½Âÿ­ÀÃÿ¬¿Âÿ©¼¿ÿ©¼¿ÿ­ÀÃÿ®ÁÄÿ¬¿Âÿ­¾Áÿ®¿Âÿ°ÁÄÿ°ÁÄÿ®¿Âÿ®¿Âÿ¯ÀÃÿ³ÂÄÿµÂÄÿ¶ÄÃÿ¸ÆÅÿ»ÉÈÿ¾ÌËÿÀÎÍÿÂÐÏÿÂÐÏÿÃÑÐÿÄÒÑÿÄÒÐÿÄÒÐÿÄÒÐÿÃÑÏÿÂÐÎÿÂÐÎÿÅÒÐÿÅÒÐÿÄÑÏÿÄÑÏÿÃÐÎÿÃÐÎÿÄÑÏÿÄÑÏÿÄÒÎÿÃÑÍÿÃÑÍÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÐÌÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÏÍÿÂÐÌÿÂÐÊÿÂÐÊÿÂÐÊÿÃÑËÿÂÐÊÿÂÐÊÿÁÏÉÿÁÏÉÿÀÎÈÿÀÎÈÿÀÎÈÿÀÎÈÿÀÎÈÿÀÎÈÿÀÎÈÿÀÎÈÿÂÎÈÿÂÎÈÿÁÍÇÿÁÍÇÿÁÍÇÿÂÎÈÿÂÎÈÿÂÎÈÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿ¿ÌÄÿ¿ÌÄÿ¾ËÃÿÁÎÆÿÁÎÆÿÁÎÆÿÁÎÆÿÀÍÅÿÀÍÅÿÀÍÅÿÀÍÅÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÁËÅÿÂÌÆÿÃÍÇÿÃÍÇÿÂÌÆÿÂÌÆÿÂÌÆÿÂÌÆÿ«»Áÿª½Àÿ©º½ÿ¡´·ÿ¢³¶ÿ¦¹¼ÿª»¾ÿ©º½ÿ¦·ºÿ©º½ÿ«¼¿ÿ¬½Àÿ«¼¿ÿ«¼¿ÿ®¿Âÿ³ÂÅÿ²¿Áÿ´ÂÁÿ·ÄÆÿ»ÉÈÿ¾ËÍÿÁÏÎÿÃÐÒÿÄÒÑÿÁÏÎÿÂÐÏÿÂÐÏÿÃÑÏÿÃÑÐÿÂÐÎÿÀÎÍÿ¿ÍËÿÆÓÑÿÅÒÐÿÄÑÏÿÃÐÎÿÃÐÎÿÃÐÎÿÄÑÏÿÅÒÐÿÃÑÍÿÃÑÍÿÂÐÌÿÁÏËÿÁÏËÿÁÏËÿÁÏËÿÂÐÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÎÌÿÁÏËÿÁÏËÿÁÏÉÿÂÐÊÿÂÐÊÿÂÐÊÿÂÐÊÿÁÏÉÿÁÏÉÿÁÏÉÿÁÏÉÿÁÏÉÿÁÏÉÿÁÏÉÿÁÏÉÿÁÏÉÿÁÏÉÿÂÎÈÿÁÍÇÿÀÌÆÿÀÌÆÿÀÌÆÿÁÍÇÿÂÎÈÿÃÏÉÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÁÍÇÿÁÍÇÿÀÌÆÿ¿ËÅÿÀÌÆÿÀÍÅÿÀÌÆÿÀÍÅÿÀÌÆÿ¿ÌÄÿ¿ËÅÿ¾ËÃÿÁÍÇÿÁÎÆÿÁÍÇÿÁÎÆÿÁÍÇÿÀÍÅÿÀÌÆÿÀÌÆÿÂÌÆÿÂÌÆÿÃÍÇÿÃÍÇÿÃÍÇÿÃÍÇÿÂÌÆÿÂÌÆÿÂÌÆÿÃÍÇÿÃÍÇÿÃÍÇÿÄÎÈÿÃÍÇÿÃÍÇÿÂÌÆÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÂÉÄÿÂÉÄÿÃÊÅÿÃÊÅÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿ¿ÇÀÿ¾Ç½ÿÀÉ¿ÿÁÊÀÿÃÌÂÿÄÍÃÿÃÌÂÿÂËÁÿÁÊÀÿÀÉ¿ÿÀÉ¿ÿÀÉ¿ÿÀÉ¿ÿÀÉ¿ÿÀÉ¿ÿÀÉ¿ÿÀÉ¿ÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿ¿ÇÀÿÁÉÂÿÁÉÂÿÁÉÂÿÀÈÁÿÀÈÁÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿ¿ÇÀÿ¿ÇÀÿ¾Æ¿ÿ¾Æ¿ÿ¿ÇÀÿ¿ÇÀÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿ¾Æ¿ÿ¿ÇÀÿÀÈÁÿ¿ÇÀÿ¾Æ¿ÿ½Å¾ÿ¾Æ¿ÿ¿ÇÀÿÁÈÁÿÁÈÁÿÀÇÀÿÀÇÀÿÀÇÀÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¿Æ¿ÿ¿Æ¿ÿÀÇÀÿÀÇÀÿÀÇÀÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿÁÅ¿ÿÁÅ¿ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿÂÉÄÿÂÉÄÿÂÉÄÿÂÉÄÿÂÉÄÿÂÉÄÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÈÁÿÀÉ¿ÿÁÊÀÿÂËÁÿÁÊÀÿÁÊÀÿÀÉ¿ÿ¿È¾ÿÁÊÀÿÁÊÀÿÁÊÀÿÁÊÀÿÁÊÀÿÁÊÀÿÁÊÀÿÁÊÀÿÁÉÂÿÀÈÁÿ¿ÇÀÿÀÈÁÿÁÉÂÿÂÊÃÿÁÉÂÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿ¿ÇÀÿ¿ÇÀÿ¿ÇÀÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿ¿ÇÀÿ¾Æ¿ÿ¿ÇÀÿÀÈÁÿÀÈÁÿ¿ÇÀÿ¾Æ¿ÿ¿ÇÀÿÀÈÁÿÁÈÁÿÁÈÁÿÀÇÀÿÀÇÀÿÀÇÀÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿÀÇÀÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿÂÆÀÿÁÅ¿ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿÁËÅÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿ¾ÈÂÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¾ÈÂÿ¾ÈÂÿ¾ÈÂÿÂÊÃÿÂÊÃÿÁÉÂÿÁÉÂÿÀÈÁÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÁÈÃÿÀÇÂÿÀÇÂÿÁÈÃÿÂÉÄÿÃÊÅÿÂÉÄÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿ¿ÆÁÿ¿ÆÁÿ¿ÇÀÿÀÈÁÿÀÈÁÿÁÉÂÿÁÉÂÿÀÈÁÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿÀÈÁÿÁÉÂÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿÀÈÁÿÁÉÂÿÁÇÂÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿ¿ÅÀÿÀÆÁÿÀÆÁÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿ¿ÅÀÿ¿ÅÀÿ¾Ä¿ÿ¾Ä¿ÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿÀÇÀÿÀÇÀÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ½Ä½ÿ½Ä½ÿÁËÅÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿÀÊÄÿÀÊÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿÄÌÅÿÃËÄÿÂÊÃÿÁÉÂÿÁÉÂÿÁÉÂÿÂÊÃÿÂÊÃÿÁÉÂÿÁÉÂÿÁÉÂÿÁÉÂÿÁÉÂÿÁÉÂÿÁÉÂÿÁÉÂÿÁÈÃÿÀÇÂÿÀÇÂÿÁÈÃÿÂÉÄÿÃÊÅÿÂÉÄÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿÀÈÁÿÀÈÁÿÀÈÁÿÁÉÂÿÁÉÂÿÀÈÁÿÀÈÁÿÀÈÁÿ¿ÇÀÿÀÈÁÿÁÉÂÿÀÈÁÿ¿ÇÀÿ¿ÇÀÿÀÈÁÿÁÉÂÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÁÇÂÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÁÈÁÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿÃËÄÿÂÊÃÿÁÉÂÿÁÉÂÿÁÉÂÿÂÊÃÿÃËÄÿÄÌÅÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿ¿ÉÃÿ¾ÈÂÿ¾ÈÂÿ¾ÈÂÿÀÊÄÿÀÊÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿ¾ÈÂÿ¾ÈÂÿ¾ÈÂÿ¾ÈÂÿ½ÇÁÿ½ÇÁÿ½ÇÁÿ¾ÉÁÿ¾ÉÁÿ¿ÊÂÿ¿ÊÂÿ¿ÊÂÿ¿ÊÂÿ¾ÉÁÿ¾ÉÁÿ½ÈÀÿ¾ÉÁÿ¾ÉÁÿ¾ÉÁÿ½ÈÀÿ¼Ç¿ÿ½ÈÀÿ¾ÉÁÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿÀÇÂÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÁÈÁÿÁÈÁÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿÀÇÀÿÀÇÀÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¿ÉÃÿ¿ÉÃÿÀÊÄÿÀÊÄÿÁËÅÿÁËÅÿÂÌÆÿÂÌÆÿÁËÅÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÁÉÂÿÁÉÂÿÀÈÁÿÀÈÁÿÁÉÂÿÂÊÃÿÃËÄÿÄÌÅÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿÀÈÁÿ¿ÉÃÿ¾ÈÂÿ¾ÈÂÿ¾ÈÂÿÀÊÄÿÀÊÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¾ÈÂÿ¾ÈÂÿ¾ÈÂÿ¾ÈÂÿ¾ÉÁÿ¾ÉÁÿ¿ÊÂÿ¿ÊÂÿ¿ÊÂÿ¿ÊÂÿ¾ÉÁÿ¾ÉÁÿ½ÈÀÿ¾ÉÁÿ¿ÊÂÿ¾ÉÁÿ½ÈÀÿ¼Ç¿ÿ½ÈÀÿ¾ÉÁÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿ¿ÆÁÿ¿ÆÁÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÁÈÃÿÀÇÂÿÀÇÂÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÂÉÂÿÁÈÁÿÀÇÀÿÀÇÀÿ¿Æ¿ÿÀÇÀÿÀÇÀÿÀÇÀÿÀÇÀÿÀÇÀÿÀÇÀÿÀÇÀÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿÀÊÄÿÁÉÂÿÁÉÂÿÁÉÂÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÂÊÃÿÀÊÄÿ¿ÉÃÿ¾ÈÂÿ¿ÉÃÿÀÊÄÿÁËÅÿÀÊÄÿ¿ÉÃÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿ¿ÉÃÿ¾ÉÁÿ¿ÊÂÿ¿ÊÂÿÀËÃÿÀËÃÿ¿ÊÂÿ¿ÊÂÿ¾ÉÁÿ½ÈÀÿ¾ÉÁÿ¿ÊÂÿ¿ÊÂÿ¾ÉÁÿ½ÈÀÿ¾ÉÁÿ¿ÊÂÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿÂÈÃÿÂÈÃÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿÁÇÂÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿ¿ÅÀÿ¿ÅÀÿÂÌÆÿÂÌÆÿÂÌÆÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿÀÊÄÿÂÌÆÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿÀÊÄÿÃËÄÿÃËÄÿÄÌÅÿÄÌÅÿÃËÄÿÂÊÃÿÁÉÂÿÁÉÂÿÃËÄÿÃËÄÿÃËÄÿÃËÄÿÃËÄÿÃËÄÿÃËÄÿÃËÄÿÀÊÄÿ¿ÉÃÿ¿ÉÃÿÀÊÄÿÁËÅÿÂÌÆÿÁËÅÿÀÊÄÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÁËÅÿÀÊÄÿÀÊÄÿÀÊÄÿ¾ÉÁÿ¿ÊÂÿ¿ÊÂÿÀËÃÿÀËÃÿ¿ÊÂÿ¿ÊÂÿ¾ÉÁÿ¾ÉÁÿ¿ÊÂÿÀËÃÿ¿ÊÂÿ¾ÉÁÿ¾ÉÁÿ¿ÊÂÿÀËÃÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÂÉÄÿÂÉÄÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÃÿÁÈÅÿÁÈÃÿÂÉÄÿÂÉÄÿÁÈÃÿÁÈÃÿÀÇÂÿÀÇÂÿÀÇÂÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿ¿ÆÁÿÂÈÃÿÂÈÃÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿ¿ÅÀÿÀÄ¾ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿÁÃ½ÿÀÂ¼ÿÀÂ¼ÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿ¿Â¹ÿ¿Â¹ÿ¿Â¹ÿ¿Â¹ÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿ¾Â·ÿ¿Ã¸ÿÀÄ¹ÿÀÄ¹ÿ¿Ã¸ÿ¾Â·ÿ¿Ã¸ÿÀÄ¹ÿÀÄ¹ÿÀÄ¹ÿÀÄ¹ÿ¿Ã¸ÿ¿Ã¸ÿ¿Ã¸ÿ¿Ã¸ÿ¾Â·ÿÀÄ¹ÿ¾Ä¹ÿ½Ã¸ÿ½Ã¸ÿ½Ã¸ÿ½Ã¸ÿ¾Ä¹ÿ¾Ä¹ÿ½Ã¸ÿ½Ã¸ÿ½Ã¸ÿ½Ã¸ÿ½Ã¸ÿ¼Â·ÿ¼Â·ÿ¼Ã¶ÿÀÄ¸ÿ¿Ã·ÿ¾Â¶ÿ½Áµÿ½Áµÿ¾Â¶ÿÁÃ·ÿÂÄ¸ÿÂÄ¸ÿÀÂ¶ÿ¾À´ÿ¿ÁµÿÁÃ·ÿÂÄ¸ÿÂÂ¶ÿÀÀ´ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÀÀ´ÿÀÀ´ÿ¿¿³ÿÀÀ´ÿÀÀ´ÿÁ¿´ÿÁ¿´ÿÁ¿´ÿÀ¾³ÿÀ¾³ÿÀ¾³ÿÁ¿´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿ¿¿³ÿ¿¿³ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿ¿¿³ÿ¿¿³ÿÀÀ´ÿÀÀ´ÿÁÁµÿÁÁµÿÂÂ¶ÿÂÂ¶ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿ¾Â¼ÿ¿Ã½ÿ¿Ã½ÿ¾Â¼ÿ¾Â¼ÿÀÂ¼ÿÀÂ¼ÿ¿Á»ÿ¿Á»ÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿ¿Â¹ÿ¿Â¹ÿ¿Â¹ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿ¿Ã¸ÿÀÄ¹ÿÁÅºÿÀÄ¹ÿ¿Ã¸ÿ¿Ã¸ÿ¿Ã¸ÿÁÅºÿ¾Â·ÿ¾Â·ÿ¿Ã¸ÿÀÄ¹ÿÀÄ¹ÿÁÅºÿÂÆ»ÿÂÆ»ÿ¿Åºÿ¾Ä¹ÿ¾Ä¹ÿ½Ã¸ÿ½Ã¸ÿ¾Ä¹ÿ¾Ä¹ÿ¿Åºÿ¾Ä¹ÿ¾Ä¹ÿ¾Ä¹ÿ½Ã¸ÿ½Ã¸ÿ½Ã¸ÿ½Ã¸ÿ¼Â·ÿ¾Â¶ÿ¾Â¶ÿ¿Ã·ÿ¿Ã·ÿ¿Ã·ÿ¿Ã·ÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿ¿Áµÿ¾À´ÿ¿ÁµÿÁÃ·ÿÁÃ·ÿÂÂ¶ÿÀÀ´ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÁÁµÿÀÀ´ÿÀÀ´ÿÁÁµÿÁÁµÿÁ¿´ÿÁ¿´ÿÁ¿´ÿÁ¿´ÿÀ¾³ÿÀ¾³ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÀÀ´ÿÀÀ´ÿ¾Å¾ÿ¾Å¾ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿ¼Ã¼ÿ¼Ã¼ÿ¼Ã¼ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿ¾Â¼ÿ¾Â¼ÿ¾Â¼ÿ¾Â¼ÿ¾Â¼ÿÁÄ»ÿÁÄ»ÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿ¿Â¹ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿ¿Â¹ÿÀÃºÿÁÄ»ÿÁÄ»ÿ¿Â¹ÿ¿Â¹ÿÀÃºÿÁÄ»ÿ¾Á¸ÿ¾Á¸ÿ¿Â¹ÿÀÃºÿÀÃºÿÁÄ»ÿÂÅ¼ÿÂÅ¼ÿ¿Åºÿ½Åºÿ¼Ä¹ÿ¼Ä¹ÿ¼Ä¹ÿ¼Ä¹ÿ½Åºÿ½Åºÿ½Åºÿ½Åºÿ¼Ä¹ÿ¼Ä¹ÿ¼Ä¹ÿ¼Ä¹ÿ»Ã¸ÿ½Ã¸ÿ½Áµÿ¾Â¶ÿ¿Ã·ÿÀÄ¸ÿÀÄ¸ÿ¿Ã·ÿ¾Â¶ÿ½Áµÿ¿Ã·ÿ½Áµÿ¿Áµÿ¿ÁµÿÀÂ¶ÿÁÃ·ÿÀÂ¶ÿ¿ÁµÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÁÁµÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÁ¿´ÿÁ¿´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÀÀ´ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÃÃ·ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÀÀ´ÿÀÀ´ÿÀÀ´ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ½Ä½ÿ½Ä½ÿ½Ä½ÿÁÅ¿ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÁÄ»ÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿ¿Â¹ÿÀÃºÿÁÄ»ÿÁÄ»ÿ¿Â¹ÿ¿Â¹ÿÀÃºÿÁÄ»ÿÀÃºÿÀÃºÿÀÃºÿ¿Â¹ÿ¿Â¹ÿ¿Â¹ÿ¿Â¹ÿ¿Â¹ÿ¿Åºÿ½Åºÿ¼Ä¹ÿ¼Ä¹ÿ¼Ä¹ÿ¼Ä¹ÿ½Åºÿ½Åºÿ½Åºÿ½Åºÿ½Åºÿ½Åºÿ½Åºÿ¼Ä¹ÿ¼Ä¹ÿ¾Ä¹ÿ¼Ã¶ÿ¾Â¶ÿ¿Ã·ÿÀÄ¸ÿÀÄ¸ÿ¿Ã·ÿ¾Â¶ÿ¾Â¶ÿ¿Ã·ÿ¾Â¶ÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿÁÃ·ÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÃÃ·ÿÃÃ·ÿÂÂ¶ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÀÀ´ÿÁ¿´ÿÀÀ´ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÃÃ·ÿÃÃ·ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿ¿ÇÀÿ¿ÇÀÿ¾Æ¿ÿ¾Æ¿ÿ¾Å¾ÿ¾Å¾ÿ½Ä½ÿ½Ä½ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿ¿Æ¿ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÂÄ¾ÿÂÄ¾ÿÂÄ¾ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÀÂ¼ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿ¿Â¹ÿÀÃºÿÁÄ»ÿÁÄ»ÿ¿Â¹ÿ¿Â¹ÿÀÃºÿÁÄ»ÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿÀÃºÿ¿Â¹ÿ¿Â¹ÿ¿Â¹ÿ¿Ä»ÿ¿Ä»ÿ¾Ãºÿ¾Ãºÿ¾Ãºÿ¾Ãºÿ¿Ä»ÿ¿Ä»ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿ¿Åºÿ¾Å¸ÿ¾Å¸ÿ½Ä·ÿ¼Ã¶ÿ¾Â¶ÿ¿Ã·ÿÀÄ¸ÿÀÄ¸ÿ¿Ã·ÿÀÄ¸ÿÀÄ¸ÿÀÄ¸ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÂÄ¸ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿÁÁµÿ¿Áµÿ¿Áµÿ¿Áµÿ¿Áµÿ¿Áµÿ¿Áµÿ¿ÁµÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿ¿Áµÿ¿ÁµÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿ¾Æ¿ÿ¾Æ¿ÿ¾Æ¿ÿ¾Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿ½Ä½ÿ¿Æ¿ÿ¾Å¾ÿ¾Å¾ÿ¾Å¾ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿÂÄ¾ÿÂÄ¾ÿÂÄ¾ÿÂÄ¾ÿÂÄ¾ÿÁÃ½ÿÁÃ½ÿÁÃ½ÿÃÅ¿ÿÃÅ¿ÿÃÅ¿ÿÃÅ¿ÿÃÅ¿ÿÃÅ¿ÿÃÅ¿ÿÃÅ¿ÿÀÃºÿÁÄ»ÿÂÅ¼ÿÁÄ»ÿÀÃºÿÀÃºÿÀÃºÿÁÄ»ÿ¿Â¹ÿÀÃºÿÀÃºÿÁÄ»ÿÂÅ¼ÿÃÆ½ÿÃÆ½ÿÄÇ¾ÿ¿Ä»ÿ¿Ä»ÿ¾Ãºÿ¾Ãºÿ¾Ãºÿ¾Ãºÿ¿Ä»ÿ¿Ä»ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿ¿Åºÿ¿Åºÿ¾Å¸ÿ½Ä·ÿ¼Ã¶ÿ¾Â¶ÿ¿Ã·ÿÀÄ¸ÿÁÅ¹ÿ¿Ã·ÿÁÅ¹ÿÁÅ¹ÿÁÅ¹ÿÂÄ¸ÿÁÃ·ÿÂÄ¸ÿÃÅ¹ÿÂÄ¸ÿÂÄ¸ÿÂÄ¸ÿÂÄ¸ÿÂÄ¸ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÃÃ·ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÁÁµÿÁÁµÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÂÄ¸ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿ¿Áµÿ¿ÁµÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿÁÃ·ÿÂÄ¸ÿÂÄ¸ÿ¿ÆÁÿ¿ÆÁÿ¾ÅÀÿ¾ÅÀÿ¾ÅÀÿ¾ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿ¾Ä¿ÿ¾Ä¿ÿ¾Ä¿ÿÀÄ¿ÿÀÄ¿ÿÁÅ¿ÿÁÅ¿ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿÂÆÀÿÂÆÀÿÂÆÀÿÂÆÀÿÂÆÀÿÂÆÀÿÂÆÀÿÂÆÀÿ¿Ã½ÿÀÄ¾ÿÁÅ¿ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿÀÄ¾ÿÁÅ¿ÿ¾Â¼ÿ¿Ã½ÿ¿Ã½ÿÀÄ¾ÿÁÅ¿ÿÂÆÀÿÂÆÀÿÂÆÀÿÀÅ¼ÿ¿Ä»ÿ¿Ä»ÿ¾Ãºÿ¾Ãºÿ¿Ä»ÿ¿Ä»ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿ¿Åºÿ¾Ä¹ÿ¾Å¸ÿ½Ä·ÿ½Ä·ÿ½Ä·ÿ½Ä·ÿÀÄ¸ÿÀÄ¸ÿ¿Ã·ÿÁÅ¹ÿÂÆºÿÁÅ¹ÿ¿Ã·ÿ¿Ã·ÿÀÄ¸ÿÂÆºÿÃÅ¹ÿÂÄ¸ÿÂÄ¸ÿÂÄ¸ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÃÃ·ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÂÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÀÂ¶ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÂÄ¸ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÁÃ·ÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÀÇÂÿÁÇÂÿÁÇÂÿÀÆÁÿÀÆÁÿÀÆÁÿÀÆÁÿ¿ÅÀÿ¿ÅÀÿ¿ÅÀÿÁÅÀÿÁÅ¿ÿÁÅ¿ÿÁÅ¿ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÁÅ¿ÿÁÅ¿ÿÁÅ¿ÿÁÅ¿ÿÁÅ¿ÿÁÅ¿ÿÁÅ¿ÿÁÅ¿ÿÀÄ¾ÿÁÅ¿ÿÂÆÀÿÁÅ¿ÿÀÄ¾ÿÀÄ¾ÿÁÅ¿ÿÂÆÀÿÁÅ¿ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿÀÄ¾ÿ¿Ã½ÿ¿Ã½ÿ¿Ã½ÿÀÅ¼ÿÀÅ¼ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿÀÅ¼ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿ¿Ä»ÿ¼Â·ÿ½Ä·ÿ¾Ä¹ÿ¿Æ¹ÿ¿Åºÿ¾Å¸ÿ¿Ã¸ÿ¾Â¶ÿ¾Â·ÿÀÄ¸ÿÂÆ»ÿÁÅ¹ÿ¿Ã¸ÿ¾Â¶ÿÀÄ¹ÿÂÆºÿÃÄºÿÃÅ¹ÿÂÃ¹ÿÂÄ¸ÿÁÂ¸ÿÁÃ·ÿÀÁ·ÿÀÂ¶ÿÁÂ¸ÿÁÃ·ÿÃÂ¸ÿÃÃ·ÿÂÁ·ÿÂÂ¶ÿÂÁ·ÿÀÂ¶ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÀÁ·ÿÀÂ¶ÿÀÁ·ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÁÂ¸ÿÁÃ·ÿÂÃ¹ÿÂÄ¸ÿÂÃ¹ÿÂÄ¸ÿÁÂ¸ÿÁÃ·ÿÀÁ·ÿÀÂ¶ÿX || x - fromX <= toX - x ? from : to;
        var xDiff = x - (ch == from ? fromX : toX);
        while (isExtendingChar(lineObj.text.charAt(ch))) ++ch;
        var pos = PosWithInfo(lineNo, ch, ch == from ? fromOutside : toOutside,
                              xDiff < -1 ? -1 : xDiff > 1 ? 1 : 0);
        return pos;
      }
      var step = Math.ceil(dist / 2), middle = from + step;
      if (bidi) {
        middle = from;
        for (var i = 0; i < step; ++i) middle = moveVisually(lineObj, middle, 1);
      }
      var middleX = getX(middle);
      if (middleX > x) {to = middle; toX = middleX; if (toOutside = wrongLine) toX += 1000; dist = step;}
      else {from = middle; fromX = middleX; fromOutside = wrongLine; dist -= step;}
    }
  }

  var measureText;
  // Compute the default text height.
  function textHeight(display) {
    if (display.cachedTextHeight != null) return display.cachedTextHeight;
    if (measureText == null) {
      measureText = elt("pre");
      // Measure a bunch of lines, for browsers that compute
      // fractional heights.
      for (var i = 0; i < 49; ++i) {
        measureText.appendChild(document.createTextNode("x"));
        measureText.appendChild(elt("br"));
      }
      measureText.appendChild(document.createTextNode("x"));
    }
    removeChildrenAndAdd(display.measure, measureText);
    var height = measureText.offsetHeight / 50;
    if (height > 3) display.cachedTextHeight = height;
    removeChildren(display.measure);
    return height || 1;
  }

  // Compute the default character width.
  function charWidth(display) {
    if (display.cachedCharWidth != null) return display.cachedCharWidth;
    var anchor = elt("span", "xxxxxxxxxx");
    var pre = elt("pre", [anchor]);
    removeChildrenAndAdd(display.measure, pre);
    var rect = anchor.getBoundingClientRect(), width = (rect.right - rect.left) / 10;
    if (width > 2) display.cachedCharWidth = width;
    return width || 10;
  }

  // OPERATIONS

  // Operations are used to wrap a series of changes to the editor
  // state in such a way that each change won't have to update the
  // cursor and display (which would be awkward, slow, and
  // error-prone). Instead, display updates are batched and then all
  // combined and executed at once.

  var operationGroup = null;

  var nextOpId = 0;
  // Start a new operation.
  function startOperation(cm) {
    cm.curOp = {
      cm: cm,
      viewChanged: false,      // Flag that indicates that lines might need to be redrawn
      startHeight: cm.doc.height, // Used to detect need to update scrollbar
      forceUpdate: false,      // Used to force a redraw
      updateInput: null,       // Whether to reset the input textarea
      typing: false,           // Whether this reset should be careful to leave existing text (for compositing)
      changeObjs: null,        // Accumulated changes, for firing change events
      cursorActivityHandlers: null, // Set of handlers to fire cursorActivity on
      cursorActivityCalled: 0, // Tracks which cursorActivity handlers have been called already
      selectionChanged: false, // Whether the selection needs to be redrawn
      updateMaxLine: false,    // Set when the widest line needs to be determined anew
      scrollLeft: null, scrollTop: null, // Intermediate scroll position, not pushed to DOM yet
      scrollToPos: null,       // Used to scroll to a specific position
      focus: false,
      id: ++nextOpId           // Unique ID
    };
    if (operationGroup) {
      operationGroup.ops.push(cm.curOp);
    } else {
      cm.curOp.ownsGroup = operationGroup = {
        ops: [cm.curOp],
        delayedCallbacks: []
      };
    }
  }

  function fireCallbacksForOps(group) {
    // Calls delayed callbacks and cursorActivity handlers until no
    // new ones appear
    var callbacks = group.delayedCallbacks, i = 0;
    do {
      for (; i < callbacks.length; i++)
        callbacks[i].call(null);
      for (var j = 0; j < group.ops.length; j++) {
     â;[å<_˜EXÊÖð …€‡Oµì(  …P’€  òÌ…]é˜¿HzãØKyä h2ãˆ$ ø¥B;í  êªhwåËÕ´Oè]á¢(Ø‘ïŽ…õ´ÔÏÒE @ ·’íSÔL¾ ®ü8(Xüç“•tžœu/K°Ç  „ ¼·”p04>áúÌŽÀˆvjÆØÁ#cŒÒŽ  @hÌ@¥¢,}¢·ŠuZ´”„—ÏGaíN§!{›"P  „H~ÕN™ôÏÍû¬¤¢ï™‘˜3Ìs¤•`RU!„  @XÑ2aÇÁc,ãš(reÓ2?>p3dp“t¼€  @Ž]@­7`®Cr¿
Š»æƒ˜,€o]úÉëÆ”Iö  ù¦”±þ>lÔ<Qw0¶9¤ø‡GÓbâé&¬° € ¸1vU‡óuÓ #†¡Þ´.ÝMwÓXNÈ“ÙN  x‡ìšú°$
¨(ñJ€ÝH<]Š+t•gbE2 €IÀû1	AMçÇÐü±ÞÈÏd3dë•HßÐ  b½åà‡ÁÀN0‘hvšœ$÷Wmßà¬ìú  	ô¾<ôO»)‹¾y½ X¡#Òð…MýÌ99¨É   ÛØ¨;Ùm,ý"uKœ'rÒj úÛï‘šò5[Y•›ã  RÊ?|º˜øt:fv·EÆ³9 	ÔŒJ +º7² € ‹ÿ.‚×¥¦ :8I‘ÄÞÔä	â‘Kì¶´Ä÷eY  Õ*!Ià0ä¤  Ú‰ï£!'¶x)uô™íÃ £	R  !@Ï¶ø'£Œ¸Gp+âŸJS°ïÆÐþx”PÛ!  þiÜ½T—û‰šH®µwN_fSX`q‹Û  ÈgCE¯Ô!¯ÄbÚt"¡ Otp€ï<aÊnÒ !  	ú:Ø—'šÖ¯ç"€Ž_{KºÏ|9û'ðŠ   ÝàYÑDÁˆÇŠÚ›ëîÉ1c³Ìƒa  B r2àü˜,& õ·ß5 çèf•ŒÃt$¯  @å°»(VYH‡‡Çžý")“ï´G0´Ý:¼À  ˆÓ¸H:Æi`3îÄÎ–NKò8ù:âÐžãät €9©&H¢O#ªþ7Ö›)…äçP|7Fà¡£EÏìñ·€  ci?Ÿ:R¨×Ÿáïð°’lwpðÌhºJäçäÓKÿV B  RƒÇ}ÜíxÞõ  %™Þv¿º;…à(£ÞÙo   ÑÇýÁBâ¤ÃÎÄÃ(Ø"oEm
Ëo¢Lli  B u>†½1¤ À&­·ô>Ì—iFàLVSn"  @Yú
0/½ðzôœŠ;d¡LÚÚ6ñCÅ#Ê"þ–®@  „ìß)ä9”æºØãÀ¡Ê¼Ú'¥	Ê7B¸lºXP¾ž‰„  @Œl
&{ßŠ< ñQ,îêÉ‰õºt`Â0…ÆÁ@  @øùLŽà0b§Á‹io6ªæpåÁg#yÈLŽM „  •Fª9”òG»Ã§Û5€ÒIƒu ÑcìÇdƒÚÁL @ ùúg2ÓŒu`G8Î}zà–”AR¯®ãrò  „ ã½:Š(€ âñgzµÑìŠªZ.Ò¥Þ¬þË €¬° Bô*à8µcí-X‰åªI¦ÝU§·À !  ²&ZO* «ªv]ù9”Ülµ¾ÕHM·ÐçšÄ  ‚|«&ã3¸%ÄzíÂ„dÕðƒ;YàÃMÃÚ†u !  ^M4È-ìä5ð£Éç˜að!zœËHpî—Òòy  ä ºUâÓ#©rÓlŠ ú±™W5Uæ@Å~ñ;(k— € žlÅ)æª=åJ‘àÓ©³Õn‘fÿ@Z˜'ÒÑ  ôôÙ¡= ÒÏ¶[µÕI]QXtªaªŒ˜w:èà €s0u>Ò¤_t“6C–œ_çSš»„D”]w:@!  ñÇ8Z:´ptE¿ˆUo†âX/RÊéyP}¾š   Ë˜Æò¯½jšés#g}W9ëW`†ÎÄ%P§üf" „  xÇÐ&èÙw4è˜Åú£p¨¶cZ6
)š7z-š¢ € Íã	‰^ìeuÔ€øuø¶(“ÿâHAÙ·?S«i  ï	tª²D"šÐÍúòªgÌSƒt›µ§{å‚  ! ï.&û€&ý™‡±$aÑY½¿½7Nø9ã°À!  z½ˆ1KÉVGK 'çtÅŽ07Û0ÇÀ'’JB  ´ºÇÑ¶9UÅã‚7ÔœûqÐÞ¹Sb<m !  5ÏúZ/ˆ…ó™&šë	àM+zCêë†7„Ž† @ 0•©cxUãÚ”Ùåð©Q:)ŸG²òãçˆíxtÛ  A ´÷ÑžÎÂ ú(à™Æ(Ø"ûeVBŸ%˜©:´•iDœ  ó†±ÍÿfaQÌöc33qlU{vÂJùýçFº  " )ÜA.ÐÆlë‘I`HmÞ¼šüÝ`0ô’B   Øo9R]Û–ªÃž ¼Ðšëá@î~…´E@  A&#àS¶eS–»r‚¦ P4'úÔÝŠ[úÓ ˆ  ‡.o^°d#÷`Ær?`ûàúzCê™Éôé|Êõ € `lŽ[nh{æpM8¯Y×7Ê}Vxã“´²ÎÓ™Lå  ,.n@€¢†Îk^ÙÆFëiE6D[¸èFŽ,åg  !@-g‡9ƒDÃ9ÅaŽ½Ì«kÁp²† ‘!  ”Â­AªçQŒþ2ÐÃ=‚7`™¹Q„°<v]÷  Çyôè	`I-À{¾ÞA.£ÀÄ9»ƒSW !  çSýó- 8êÇ†£e†{ÐCc§Ÿñ¤Ë¶Ü‹  ®sà+fá:'ÖkºàHz“Ú"Y›ÿ@“Õ`…¥¢  D >“¾géXâðÊ§wÚ+zU˜ x0†SÀ–ÙHÐ>£  /µ  ù5¶OÄƒ9¥Æ‹žQEí„…díè3)T€Z=ˆ  "?òDZK±Û•ž)2b!P’'Ö,”‡ÇàrÃ úŸ„  @Íú5¬á¼žA'n“ÅV– )ô«÷Y06]iYó¶@  "ï£;2“üÉ$´¢&„Þ”!ê@këŽ¼BÖŠ´' „  ¥@uêñgpÛtŠ`PÉ OZ0Ècü•ý³ÑÔEJ € L¤³É_3È`Re¤ºª²>ƒ„u>9åëÓ  	!âðFp[ØmZ9|{ùøßæ…uj6Ðp7Ë  !€–˜þ‹9¾õ„ÁíŒ`–-†¸r¹)m§tnOB   çHz:Eó ^P(2W¤ 7ŠÜ%îû He‹©9Œ   “î>xv\x ¢°égfîÅd3™°!s¹2÷×ô<¶ D  öê#14WÒE½ÆWœÅzqÀ@`uŸ±Ó£ÕóJPÅ € R–×Hæ_1SdTÐDcšVªão¸çÚ7@Q!|]›  ÿC¶º£à)•s9±DÐ¡‰ç_[ùÛ=  ØðdæÉÔÕ+©v6Heú{¤ÑqàÂ¹«î ú  8HÅ9JK²>4‚ž¹Å4ƒÿ[×Ð_¿ÄäÍ €sY¡LŠõb›¥C¯¸¢;P w˜’–:ƒ€  LÇ”ÍØ€jö úŽ‹¥0³žæ¦0€JT  Æ~ßKØå¬£–ì3÷@6ÝI7³»ä*‡Ré«0é  ! ³«rQío„¥Pû‡„y9/þ,ŸÊdÓûÊÉ¬*ª£²  YâŠ`ÏË kýçÿóÑNÎ¶Ò/¾ì^T¸±c"«ø  !p9KæýClÆ«Ê¨€Å%E=aÞ™¨X¡8M€>B   K¦šAxýÈZZÏG:áÅ®ÛÆ‘jLšJfÑ9Õ   öý?©¹XqSZä³SÁ3'AÀ µÙÚüv	 B  ¡¸×´ÐÈ6@‹´¨{”°Ê8Ú
îêóúÜ-¡>   ÒåÞ wñËéQVÀ"oòºFÐ¦Õ~p¹¤i˜  „ Ï>aÅhžÐ•Tò=ÙØƒÖ¤ÝÒŒ»•G’2†ÿÄ“ @BèàÇàº¼ú~ŸJSKü’_{â­¢ÃÈïï#ð   à! úéF?­nÝF2.æmr¾à†Ô}¢  …€ÿÿÿ vÁ÷((              WóŒó°#(­4ap*Ñ™ÑÓ …€äj±à!   (  m'îûrŸ3È¯€œ"¯sŽÁ•¶ ”kÈ4  ãAˆ}>u¨¹£oÖFò;QF™0]§b<f5Ô‘ !  „úY¯¡;è¦»\[@†UÍ&„qãa}oà  µ2¶ B”ú”âÈ•P·íÄðãu¾'AÂ   ! 9ãGYŽ>¤ü`Ô—‰÷z‰4Ï«j—+¬	Äë.Ž  ‡0WUpºè?¨Šòh£yË¸hî¢Æ‹ê|ƒë4 €ß€#ë»T®Ñ½ÚTkåÀÖàz.è&Å	Ö  ÐŒŸL_#ôm¢?¼Yjp!¯»0èp oÀb¡ € ë×$2áBÍ]Ëƒœª$;¡°`F”¡¯Ó€  H2@ðíaâ×JÆÀ›p”Ô À£-íå8áãVv	*  ~Bki&LÃKDGLanÐuQzÆ0p“l¸±¾? € ó9Ã{k¨à‹˜Å*PÀ,R’Õ#hŽš·ÍÊ  ´ ð'ãtˆŠõg²ƒK„§RˆÃâé´G @ 
@&ä
‚¹ÔD¯Ùtv ño(’s‡ò!  øÞ%îõQ!<Íhv¦æëeßf’‰€Î]Í Â½hy €pƒƒi¬oŠµöà­¹ÆM¿cq0Oxý†Â€  Ú_×Fß‚2M>ÈCê®7@`®`n¡ç³u  ?Ý¶ñx:«fÞŒÎOP½¢AÔ{j.–ôEÃ‰ € Ò+è3ý‡ìl`!g¬Ùn§ ÙfmT¶šÙ?  º^büp(ºigìÙ(ªßÎç‹ÝôÖU¶@ñÁ €ê€e)øó(¼W*”6y4Y‹”A$x?R  ¢îÄÜÇŠ%3‚·îÔ† ÷ONnôúêäå¨ 'Æ.Q €H
Ï‡…=}kànÏk¸Ÿà³œ°Ã"²E¾J3€  wDT§‚TÜûõSo[P&ÀX5á‹4ü.Á×¶Ñ  ÿ_æ`vÈ‡Žj#Ã5Ð‰6	'¹d~4³Oæ6º € Ë~D,Ðtëe€àªç%øÈÃ¬–!	mÞ½ùuîx2  2|¬ðœãÅî"% ýQÈÕ¬„ß&š”WX €› úÃè[7V=9[ÚxÄPñŒ¬J‘ñ—Ë  k¸D=9zî±vkù)çÕ’‘˜´ ·­w Ÿ4O¾ €rHºH1‹	PA—3¼åÀÐ¦z0 ŽiÁz’ÃÇ "  Po •ùÚèaá0Ï™…“@„h|Š$–ï”   ¥‰jjŸÝ+Œ³ PH{>VZ`þ'g;¼+3a…P  „ ]ÌÙß1‡`åJŒê|ÔªûdÔGjéŒ¬p9òkžŸ  @ØpÁ6³ºO_™¹$ð~±nqË”^Þ)n‹€  ˆªNþÚ+ÖuOF«=•7Pæ½f½:éýU`ÖRV^  €9V¦úAíË¶é°pž¾íŒ%–-rø¦ýª/0›>ß B  Á‡.AC§œzUq›S°°?Í³¢’ÙŽq§Š+   ”ÞÜÓ:¿Ê GœÀÿú«z(w >A|™9cÐ¿È¶  „  §¬ê•ÅÐÓ1"ëÓ°ž42“¾™SÒeõuV÷oq¢  @Óà¢$­Ê`Wæ+¤¬†ú½Ü­´ùæ”ì4ð  „ü~Î‚NÁÍÆh0éÂà×5ýr¸[ò« úÍâD   ŠÞ¬¥Qæw [YrwÄK×’9™ƒv0z1s@  ,¸Ô©Ôì´¦…ó‚¹GV1òÈ ^ù™9TT³’ä „  þbìžÀ¹»lD:¬E0XT8–ßòþØVó® @ jR7ÁfY}@C¼v|øSbr|4{)&ì^œì  „ *¡º¥öŠPÔZü½"Ã(;Ë:Hqª‚éÑ6 €¥*`\@ûÚbç˜çÂÕFà(pëÉ’¦pvp  RC â9Qðší ¨¥h` ¶Äö²¬€0ÿ¶ú  ˜Ž[£’ß]ÿ2 l”¿çsK/@59AE¼¥9eiRù !  Æ0Æb7Š %~…Þ·³| <W:/­q˜?òŠo   ×]R”ÛXÞ—ŸøÁ°-PíUí³Ñ¦ëµ&ÅuÞ  D …Y¿ÑéÔFÀx©èÚfÛ•pŸ®Ø9í$±`Ó«ž>3  @4ÚÐ!·¦9=Oßl$·PMM
Ä°¨$W6ùà  „]ýêâC-¡0Áþ…£cûû}qŒÚÖðN¡B  @\kh
Y Š"uEQÙ×4±¹_.ö úgXL{   ðj\N…V£YyìòÄ_ØÕólV	­ÛqG B  «™¥)Eïè¾¾ÈÆÝ êåA>èi»{ÖÑü   N6}æp/‹á{0+å	·dã³”óDXé¶ic  B .Ó‡K’ÓÐ@Ç·MÆ_‚¿Éÿ?D×lñ'qý2  @¿ˆëPQ0ZcŸˆÎÜæJUßG‰l±Ö(¶`  ˆÛ†Ú¾C8)Q{{©sh3½g¿dWªp‚2þ~ €YÂ%E}Ud‹zMÜDÏ‚uÓ¥zª€éì¹åùu€  ¡¼®WM«¿­ŸJÊuþOj»²Ò4šMîÒÿ[]ü  ò0Ë*ì”’ùp÷J ç|8Kÿ³¢•YnþCä©â  ! œ­½Ž0º°Iç5‘AL‘¾ZwÛÆ _0Ê“úè~   ŸìaÀÿ §º!?û¬ÂˆwšYy<&ó÷Ý'Oâ¹—b  BÐcPØ9@aioAÊ_,)c,]ozP\“ºKûàIÜD   ŒÃ”7
òKÿeê J×‡Éà<	Òð=È;zÉ0   	BÈÈ)[HbH8ð")F úüeˆ"9±Õ…Mö B  |ÙOúè[±»ù½´aM YÌ Ð=:&§ÛpÖŽŽô¨g @  e‹fÁ¶šêÕN ÅÕÞÚJ*n÷1 ‘ÝfRá$  „ …ûÙµýî0nUK
r”üŒ»k+ƒCþ@QOz  @	@~YpIfq¸š€}T˜¿xæ-2n´/P  „Ø2P£)Þ˜à©u\ˆ¢/Çpä¢ö`oþ0 €ZTÄeÄýzMµ5NAÃš78äð;pSÁµºx¬å !  Z‰®ìûˆù÷ýY-ÀñýØæ€ÇXJ#rQ˜Üx  7h¢K€ÃÇžÒb%Cö¸–"ð¸ž	+r  " X<`j Û' ÃýˆÚFš$yUCö°Ù&‚çæánÛ   qTU°`ÿŸ9œt—7L‚9áWˆÆrõ“}æ×É4¡  DÀ	ë²:Ad^l¬"Ò|åj&;2º.—S9Ð¶IÕ„  @9¢'wB@~ÒïQûöâÉCàò”| €  Ç`úLeORQM‚Ì%Mo¿<ûÈðWÅ5z‚¥z+ÿÔ ˆ  Ì™”¥Í½:Áæ² d°3ºWù¬¯OýL"µÉ¿·  " êËbBß~H`ãàÚ£`;ÿ 0t57w=éæb   éQ* vÉ/9bmÚÂ=»íŠ&Áýû§›Ïe+$  D0ÿ.JtŸ> >tÇ™ªë­QFÆçÂ½@êÙ„  @ò9ÚlÍŸ‘¨“óÁ¶Ã¥ÙõŽ@¹±‹PXÞ0b9+@  ½ÄÍÀ¹ Ä¤ØœÍŠ!Ú(`¡7ÓhkÌòI¾- ˆ  \Š
Ÿœ¤Ìy&Âiû-ÓphÄ%Œh¿yº^L„Ñ € rfòz·W1[ €sbz9B-n‡Î*+=bB¢µXë¼  ©Ò³±¼ËÜUÜ‚’–#ÏÕ@â,ƒ)+ª%Ÿ €è '…\iÎ±d¡ý~˜Uë»0¯:·@–°  ªÑqç’#”äJžÍ	£ìõýJ#H¼KómÀ]î8¸ €«|ž^>“:ÙÀßã^ZÝ˜PÒ.q:Ð¤<ê:$6_d "  ÖÏ¢C	Ÿ¸Ñ®p×`3ÚÞàCV›ÚV¥Kv¼ˆH   Ñç.jü“ÊñðsoÖNÚ"-ï&”œ"óWx¬    ÖØöÎ‚ª  …€ Þgtº{ýZWÉ {Š¹¯ë}ò™  € ½Û©È<¯k™íº(  µuËî¶ÆTÇÔ|ÿÿ ó“«Ü¦  …€        ¹2]‰(  ùÝ‚Þ2ç-•ûªN
å´°0  € …€þÓ¿úÍ“†+ o›Ž.äKdÀå)¤£_@  ´Vó@Oà
ÓnßJ®¦Gät,PÃv” €dÁ%¹1Q·PhÇþrK4¤I/` kºä][€  ä2eËj QÄ1ž%ë^uHÒ‰p<hý¼åf6.  -_(ýÙZPÊÞPã·ñ€-s2ð¸›éýIT-;†a € uÃtì!¹ähÃÀ¨@“…º„ªG>Z~ê°Ý¥  î‹‚§ Üúd£Á«“GYÈ#wùCê#±vÎ· €á°†À¿§";ZÑe:S o¡¨á9ŠôŽÚÀ  ßoJçvQqÐþñ¨ú>¡Z˜ÀAeˆ5ˆÐ|ûwá €Dº/kåOi°x¸¨ p¨‡!VàÝäéÓ„   Xw³×n¡&Å`¯ÛðõdlšÓu¸“Æ=Pà  HwìZ…‰! šuÏ¯ñ9¨,¬Ð%hé1 k# € ð¬lü‡L5ÅŸÝ/§ÅM X©„µã}>Á®  ´>¥žü 9½¦šMsöGKïˆ–VÒÉÎœ2¦Eç   !0eAtŒ9WQ°aN ÕÌ‘¶z0½ÉIN·ð@©!  (‚éÏÛ!À#^¶ª•@ôþ?þ± ÈJ÷Pw±_QÚ   §-‰
PÂuq§‘þÖrèY`ENeôw+ B  ¯\²a³’4pá²c¼¦p'§wl}˜ ­¥I
š   å®	¢£ 7ät0-€.…èiX˜*Z]^ä£ZŠßÎ  „ ×3d$eôÒ1±áÃxç4üGÇ0F|‹’Ÿœ<í  @Ò ª9ôô<p’\"=Û‰ÅðzL7D)–°  ˆu<'º`3^»u:Ï<W¢-–‘À’î¹A €9}gR‰	õV¡ô>˜6œÆ6rÌ ÐIv«š£U(ä !  yx„š§ær¼	•>3AàÃ™ˆŽ9½år~Â;Gl  IÃà4ŽZc,z3 ðZe#:VüdMv‹…T‡"Ï  ! üäóŽÝ: úz2VºÒÕ£ãüêë¶VUÀîþ  ›åk#Ú]•
(¶Ôááã%ãH<ÈËÔˆ  B <Ÿ==ºÎ—Ò3Ø÷êü­Ÿ€¶40óºµ„  @ÐÕí3a5Ñ}=ùšYyž	ó¨Ú@zŽBÚÀø@  ÀÑÊ¿«t\vßeéo\vUßP k ÖL^YÍ\U „  ç{³)mj±â?º„ì¿4`=ö)Çzäòöž†/(­2 € ³¹|±Ø°0Aœp¨mËP405nx6àâ¬«€¦^  oþö„€)B_„,b£nÞ„°”·é‘·´v(Æà‚ €¼2z‚¢L·Ñ“ˆ¡H=£Ì ÀôŒƒ8   V€ùüh¢;
¯uI	¢J±Ž"À`ø%°‰lµ:  ÿZ%#Ä/Çªïþzö}U¤?1ˆþiÀ*-¨´9u¡ãõ !  ÃT.­Øíð¤wúû(«ƒ­ÐqÃUôn³…ÏÞ"0  ÖiÒHÐÁFáÖx†àVÍ7Rßm‹—§Ê´é/  ! ‹)ýªæ¦“ðÂé êóRÊ…×X8$ãn€Ò  4?X  úZ<‹fµÎ %ÛŒò£W¸Ì× ûs) €+Ún6‚>Urºº  ˆªº,D   +fHÀÛD¯ƒ®\š4Ì@fØ©€N~p0ur	 €Kª4ÿÑ
SÊã(®¦ûž½`Œ-î@ý«À¦‚E€  LÛÏ–FHËRq…3ÌTDeP$W,ñSÔžÃÚ  ´áQŸCí$ÞB§×î`-št0Ýš!Þ'ñ@"Ù € ¥"‘ØW: ™pû8í^Ù¬dÊÆS®é^l™l?  ´º.©©€T¹fâ;ªâ;BL´P³àÐ§Ûc[ €x¼(_1Ò	›­v--H?È”+¸dò$u—X   mòûE¹šÁ¾J„ØÀŠ¨‘ÏÒäî"¿Š°ƒQÙÓ €T’ø¼sÿ}ïå'ÚNÓI¦¨ÎÀ‡   ©€  ‘¾„¥ïC#ÃæÚòLl^ÔÐ¨”žjZ¨0!qÓ_  y"„ó)*ù°ÿà;d°vô+ÕÑJ[JQ­k  ! þ,•(¶Äðc¡€’m‘ª	–šø6è)âzÄIÀC  B 8åó ! …˜DÄ>æ'ú5~áþÜ @kìb]iÄ™cn €ê“úƒ
Î°Æ-ÖëáÒq‡Éò 2ou“y   g'Æ9—ùˆ)Ë>ÁÿñÑ'¡—(R00¦º3m €ï¿@X&&2@âYi¢ÓC–?@Žã®nºGÀÓ "  }nQö¬È[l‰ÛœÊû¥PÈÖZ')+,¤Ðó#   ŽÞ6CÚÕu¨g¿`·×Éz—êÍ
SÒ9	}	Â  „ ú&ŒÃÒpñèp«zò	cm2êüð^-.æ'gœ  €pv³Ú4%®Ø®ú:À
-”)Œ¦’‡zMÞ8@
^ï„   Ù[š)àòÈy¸Jú[]qnH#Ý	x„ ;+Ô¦ €  ?V_Ëu"ÌnC¿ð¦Û¸5¡?°g^ÄÚ…$4tÎÄÝ  òt`–Ã’ôQÀkÉ¼ü9‚+ù©­å{çD:a € µjLPÓ?Î€/ÐÆxýí+ŽMë\“qÖÇ+3  øå†8àÖÕ9/ŽG~(.~®Éí!C´¦  €åðl6le‘œe(k°b(º~Ã‘\ÔDI² "  „ÚJÿ×%è	Ôgí\]®Þg8¹Óªè±—’Ç @ÌÛl1`–ˆûî²oiÞ7rƒáUõ ëNr™ À "   üÝŸßƒ¤ÙÜ².d˜0S²z7ŸÀ&…¿õº @ ’ÏOëÆŠŒ6‚@aú:&=œ°$W¶2¶g8…ËTÑ  „ UÌ§ WPHæqY wsäö1(Ubb¬=]¸
Í<  @“ö`.Š²±ý>KLQBN$™ÄW¢ŠG;'„£p  „þg0ëÜÜÜ¯DÚÅ)ó2&=Àj4‰û€JJ( €:A^e¼ÿ³7¯mãÞBÄ\EÙþÂ>9›‡„€  :õ<Gcê’SkˆÐvl~ë ^P©Þ
ãeª:  ]g'¼]	ûqø}Áeë°òê–¥ÿ%çÌÓ8    ÚüÄŠE½ªÌ8À:£%JG1J#hÃ¨vÉ°ƒÙq   ‰ºÑVÐÖ£½ê}[®ïp!$ŒƒÞÁRü+ä(  Bà¢J6¸Y¯¶¢ŒšÜqÄ!ÊX~¯B{õÛ2Éð•D  @º`úéë+À,N¥"Œ ØQümV% #úÇECš;#P@  ý†fÈÝ‘Œ+N‹ãl©a>Ú3Y¶FOùú8 „  GÛ_e	¸¦¶#ËQ `•Qÿº3ZSÝåß2C_c € ü
Éð¨:%0W;é±WS¯<žBFlâZ™˜à  ÌÙ{ÀZ@:÷nËšÿÏtÑx‚Ö´<;$óôP‡ó  !P™ðØ‡Fe±Èð‹ZcÄAà˜¶D`¢"  Á¶Ÿ&Ýà`ÉÝ3C©üTwe½ïpˆ÷ÞšY   ï#Íêxù4½•s÷Á,: €ì›/s9´NYÛ# D  yÙéz<Å¨ÄÞ‰­¯¡lºN%Œ[Õnsdà € 
ÏÉïÀ‹uæ àO,:2´†@ÿ,’Å÷üd4¤ë  „^û°µD¡†ºNbœ×„Ïº]93ï$ ~n  !À—›	u)êºØ­¯ët¿Ž@­+	 ›YãÐý!  ©¬6F¨sÉ(ò“J‡$PšÃñÍä1jjàåOld:n@  ŸUíXT®$AÔa†
éœÒX¹õð…‚×Ú"vŒ7Ûšn B  1éÞJjoÇA¶ãi $ú£:î‰9Ÿqü´ö˜=Ë   ‰Gt4[´ïÓâîùØäZx'ØB<ñç*UkÀIˆ  „ 4Eþ ³ëö%úG=´úƒ
ö©m„æ8ÿ    ?0$ …€Üš(  PáÜ”ïH
öÝv)æM›ÿÿÿkO“öp               @$ …€Ë“‚£(  Êm¥]ùe¸í.dœe.  âŸÑzPÞ±¢ä®°;;ý‚.9Ò;¢D­Ä&òüš  !`ÍPR¾úHÙÎ}e¨”W5Èàkü¯n#¿ûp5!  ®áÞiÕ”ùeEOáž®VèÆJì»€O1r˜  ¼x¯´³bTÕ–UÊb«‡„¸:ç3¼kZ‡ÕŠ‡ B  ¨65BÂ'Æ6‰ ~Ô‹2†eÆ*uL×N   º â—Ó G@˜)°1Ž<E7t[óP‘QO†=Ò²{  B •ÌÌ³C^Ài¯¥Äö_Å¿×î0’ º¼)‚©Ó¢£   nN¸Ð~±Nhû®ôGàç&2Bqî™wþ  Bàô•ZY¿¸¢ÎU›"°fÙ&ñFAGhð§#!   Ÿb‹{tFÕzU›õïé!hÂ¸9 %zf•^>  ¤äÝ@KÌÜÂ‰ñÏ6þ„¶C×]5+¨~ !  Zà† cÈ!F?6Ì^x b‡Nn±]>Ä“Ói  N#þ(æãÔ{Ö"Þ0ØÙå’8í¡s+4½µzÔ  ! ò‡¡î¹y"ì@‰2åÃjÓ•¨Ý§Þ€¤z†Y   \mCP-¯Hþ_Ën.Ï=‹_©„sÝ$<Á¨  !`õ÷P'76@„¦õÝîÝpŽm(‹%œpk!  ÖÄiÕh«Í£=Kðò’ÄR§ä«×Ð†€òr6Â  ›²,ˆûsk¬žÎ,SbŒ!kÈk—Ÿ® !  {=-•ßL7¿‰²íjS• YFç?=úà£  -»hžÂ³†·Hú˜°4úøÍU¿;O7‚~ªC'É  ! äUœòèŸÈDÀfWþ)FÔÈÇe{Kx®Óâð´q‘  ƒÒ÷oÐé‘i0S}Â?è#CQgßVb“[=¦  !à»Žð|Óýæª`ÌQíß¡û#…¤‘”üðÀ  h§–#6x‹«†–½t-S´ÿÄñÖ[je &ú¾ÁXŽ €“[+»†	ÕIAÎŽ*X.\¦ƒ*ÿ	¯šü¦‚sß   ºF¨•rýu¯°ž!¹-a ›©ó:º¸ûÀ’  r<!¹QtNpÉ0áð8(9ï}_¤ü½Œ}É  ! ¸b-gT¬@aÌ7÷n$•«V2pƒœ;6ë°ä`   H¨ÜcP–óº“­ë{¹õÔmPÆòÓç±c  B`´¾lO9s¡Ö]IKV´ÐÊ+Sþ†‰wŸps±B   áÜÌÈÄQLüBoF­”Mú"1¤k€„©2   éãÍ"‰o ÙAŽ®v™„W™§É] >wu¬ý–ck B  öV6—îáWØgØŒ«ë .o;»zµp+©à.•*   
ŒÆœàóET°þ“?&§@ìÔ¦£Ü”½¤BP  B jZÜø/)À_ëiPb‰7ÒhW§Æ"Ó¨¦{ù  }åøÐÀ}·ž{1.s­VÐPl.Co›E&E‡É^à  3¿ÖÁ¡í¹©üè!ÀÄ?½	r5
ê÷ðM“šÌ„  €#ä˜öƒ+“°‹$CþžQv§ 'ú³ŠØ™Ú" 6€  Š;'W%kù=X­J$¡glÿAÝ"™œÂ®  —˜IamFðZæ` ¥”¨æÙ\‚óJ„£5 € S‹‡^Èh‚÷0´?½f/Ú¾wè•-ëÓèŽ.  —É!×Z@0jƒCƒ¥Qp–4ÜÌ¼4nÊÉéy:… €¥P±…A`À^|h&ºþŒ%gV‡`ˆ`!  äŠUÚ¶us¹NâÙ=Ó XÕÒ; p1$€íº   ôØ«ÂQVª'Â¦½ÑŒ~Y8€|Ldð:(Ö%	 „  Òºø’¸^ÆÚ$¤aÒ\élL õ½‰@c´ @ ØÒäD¸Ú¹p ®>>_Z9LF!üÝÖP yd›  ã\)¾X°³Cp0u*þ)ÁO ê„õ	*¾ÐÊ €ÓÀUË¥jó£'åRÃ  …~4¼8T»`Ð!  ÄÖáÚ9NñØ—	¿zC`W¤2+ÁƒÅ;3à­Ý9   LBJÖRÚ'Áªà!Âã^Ë/ð‘Èåº* –UÜÕ !  ï
Z¢–¦ûäºú&b'µŠ (ú !Ö9ËÊÜf,uàÚ  HãÅù‘Z¤	)†lÀå|dcÎÞ-Å
ªaÕd3  " ‹îýAÑ&‘ âbÄ:§ª‘Æ¹™ÕT^¨¶ìÒž:Ü  @wø!0ö«gÚ^Šî@{ŽÍwþÀ.{âV/ó2¼ñ@  „#˜ZY+ä•Ï,îdGL§îq6?+»%P©ôˆ  @ÈOdI–|(bG²SœD¶ªk”£T`m´g:/ÌT€  ØD©8Ï®°C…‡ów,j÷åpZs-9C|GuX-  H¯:Ã‡¼Ðò—rˆ)€eŽSö{‡)„£Þ¿i& € Ž%3¸»/…ßqq^ý*ðò°zƒmˆ[x S½  XlTm ªÖXZ\ø=IÍß$œ¨³:D7ñ¥ €‘°må¬!Ñ‰71OšÅÒ¥È8çÐ!òì¿ãÀ  ’ì3º9ÔÆi‘aFLît¥ÌRY‘¿`ÁÐn@ì' €<½Óße_Y¹ŒŒ+ˆ%|fÒ%–kàfo¶Xp½S€  ±6g|lc0èÎ*s4ê,Ãð—ßš‡p— ü ˆ  |•ÒžäªçùP¤Hù )úè^ÓZHø¿Pòåè¤Ü € ìÐF]c|Ö$§ó9&µºòàº^ÓŠcLQî  1Ú2‘ó MµÖrêM'li‰ÙØ:®SiG>á  0bM5(rB’«"{Ö‰û|æ_}¤@;ü@®!  ,à¢9³
÷›>Ãù¦õ‚,1h­GPxìÅ  iÑe…DÌb^²=â0Óf„y`„äžgJí; !  ÒÔný\›q{?´¼û§f.ph#ƒ´ŠuL^|¡  D)8UrÐŒ½ŸV€=ñ³z(@[üâI/d×±  B ],j‰ y;ªÛa®m›y8˜HùßÅ8cP%   S–Å 3OÕšþö9x?j¿¸ûùÀC$„p•°  „x˜ˆúÅmwíãfvuM»	æ×jÕ (G3ÀÈ¤ö„  @Ú˜ÂT1\•&õòqpƒàxR²œcÐµ¢„îA@  uâò{¦ñÇW‹ó
y1.öoúYàKžr…ERÏxÉ „  Á‡‹D†<QoSðžáëš2^ß´”-	{¸f @ (ßGî=*Æ *ú}$ŽÒšµ9MÝU…ô¬½ð  É±¨žnC5°Ž-WöÐj²´KYŸèõY`§üa  T ˆ Dúbót§³Q©*Õ¨¾|KüEýHq0D  Èã9Z0¢reƒéí“—‰.w	Ì &X@0æ:_Ð@  à0í¼%¢%Ó ¢¾ÌµÖ<Pìoµ:/§çØ|È  ™‚[J\hØr½‘``9”‡ørPü.ðPÁ‡é € ¢±ßaã“	jp`úg\/ÌNC…òûÞ™ëBJ›é  	²8É€^ÚƒÓÔeˆ¹W¯J]öª„l¥ö3- €Ôé4ÌÍ849}x7¦Cœé¢>D2Ð   \Úê‰ò2u"æûÊ_µˆŽdç	ú~,°Žœ €o°W4ÃäÌ¯åNRÎËÔ‹«ÀÃ<?  »;@  ²mòÂ‡Xt j‚ 0ö¢õü4ÐPò{?Z9::xžF  —‚õ­	)n÷Œ&Ò>càÖ”‡$ÞÓT#ºæÚÚú; € ³-ãgOetâð’Ê—k!”šqGEWúnŽ‚   „ P×éÿ½ +úµ‡“[Zx]’×†{Hþ
Õ5x6lW¡ €ÙúHÒE7‚œ‰á[—ñóCÄ÷ "  ìˆ£jº`\<íèpŸÉµ\XyÂ¾$$½bd0´BzÇ   `†:·º0,¾]Ò,oÀoI°@¶é%z: Lgu €  åºº±Ž
úâß´Pë^ðí(  ïD…Øs¨–ÿÿÿW¸ì¨Ë              tÏÈ.¢Ïy`+ …€$×µ9(  þé~Üy(Ø  £™¼6
Xçm±FpõŠ\
`1>œIM%¶±/d  ! ÒªpÑ0ÜÕ€¢©ü$*ô­r{Oaø‡dôÜ  £
Ü’¬õ´_ZèRø¯oŒhoéó[÷ÏûÑaw  B ¡M?-Þh/ÃiÀªŸÿÄ[½%èS° B   ­˜ÈÂûû‹qûWë¸&Êˆs›w'ÌÀf#Q(   ·¶ˆ+Ù‘Í
£Ò;	´xÓµÐÜË½e9šXž B  †¼ÜK¿ÜˆòÑNÊÜÉÕànÒ1Ø'¤»Úï“   „ƒLBEªW™2s‡ðË lv •-*?a0WÿË  ! /28çÖÝ ,:’l°yïöÃlq"ØÕá] 5Ø  YøÈþ2¿“÷ÌÓ‰ì>¼W–?>PoBµÈº  ! ÑÕËÒÞ0n23ïÝòã1fBˆ„ÇÁâŽ06!  0£·{„}b¢a—A/„¶;ö!$uÅƒ†@Bè  ]7íñ YÝ}ðvIÜO¯Ý¸VMfP¥ØÖ‰K») !  ¼L~àÒ?ön…9y>ç~mR`ä‰óó	Ex²¾$À  °ÒÈáÉùâ®‚
›pÖfôÝñÑzQ‘V—p|¬  ! Tí
@C‡€‚óÊg„[äë<ÍUõúXiãY…  ƒ¡HÏ¸v	½Üå~{ÝØã,cYCüc§ŸW  ! É¹êZm1~ö²ºô™ó-e³†°!!  Vj›xÅ¾xÍ9áAÚ ¬ª³úøÀÉ‰N:   ®Ð<6Ò‡ôKäæh«´Æ(ÐqÃêÚ±2“] B  {QP§¶•Žô+ZQÓà3IB¯ãú£±„´H   hÂ.Á™S/èð‚jš„°éìQ¢d¼fÜ  ! ¤òðw_U¤ -ú&â¬ýûÂŒyS5›/²žŒ/}þã  `v«7ÊÔ
¯ao§f –€^ðêaá  ! ¨Í½&(ø_Ê\®1ùQŽGÉŸ0l!  lÒæ\XdnI’÷­Ë2iâT¢lC™é@³,  Ù¯“ð¤Ynch^lÒô?G±PÁŠ=´6Wé' !  4{z£Y.<„©¾ýÉjT`¾a+î¾¥‹‚Ú¼   tÓ¤®l¬RÏÂòƒpŒSÚ"!¤œœn-¹Æ«WŸ  B ¡ÐôºÝ€Icÿº9M_÷¥ß®ËA©s?¥(T¶   ò*bI»U*ŒŽµkªßúµ¦aÔøK  B @®Âš PÙU…Ûá„ŽKû»©£&°	ª„  @*ŠG¼ÖZLh„{&ÿ]Žñ¢qzÀ­ñÈL@  å¹ÙöE_?ŽïfIéAêDÈÐjD9(z'½ ˜Í²  yS	Eü–æv;T ècàËM¸n7ÍœéÒ0eð¿÷ € Ý×#È«oÔ–ðv¼ÎjÑ×ï¯1+ï0J›T=  „ Íž¡ž: .úHì›²Ûôù3î«
 n²|É.7¨  @A?ÈH¶Š ÛÁ>=£ôÝ'~tN=!™$   „úê]	ú½u‰&ûÄ®q‹ãÇs+ç"æ0$ªv„  @>uÕkW—4ž‰IŠ^âíý]U@¥PðäÖ`@  †uÿsIª¤WëÛ9Ãµ±’P+ðúõ'²#E ˆ  ‡[%e_Dys@ç`¶`@›“š '8výa‰–½ÀM– € ’µfe‰`p’ÈÕƒ9JùKö3\Á[ÙQþW™b‰  Mægo€OºŸWûÒ+TubM×¬BDàpØÇ €& ÍIiYÜh‡U¹ÅÜátý­TûZ6/ !  ë@DÅÚÞÔÉßjtMë·æ0Ûƒ©Ü8Å°™Àá÷   ÚW}é	5Ìé Ö½nw.¾Õ!EÀå{˜Z+ãPìü B  &ƒJ@®‹Y÷%VÃ€0Ð8¤üô9‘ZàðN"3N  1 #ßs˜l]’ø5s3VzAA_sß~#ðs%‚…ÓÚz$  b©`Fðó3Áz»2àÎ§CçPFmŸ%U½ƒõ  ! /úùÎ0ˆæ»gý[ù$~¡¼H¼ëÞ¹S¼OÒ!  ÊtÚ^h2­8×ÝÞô«sk_Ùõ·[¨ µNY†  ×ò‚®ÒëöÛÄÌå[•p•°n0(»rI|cÀó !  GÙzMû`…a÷U½n@U|:àmá(åmòi   ½ŽZÐGW|Ó"PPD*B:•‹]Få½={)°\  B ú˜P¼mr`Üe;¾9Ï,ÅÂ‚ÚJ½lY|oW4£“7   ®ñp|§œ|œ¼ÿTP;-²õg‰"”0cqTxí  D€Ó0.®RqiÌŠËÛùã÷”/ùuÅff.éÞB„  @„9gåR{llÞrþEÀ{ñ¦= 	ÛwÆq0@  Ë1ÙXƒ¼
y$íçÏðs_+°â¶ss>–ÞÌü „  ÊÌXîP„ÉºmË¼FÀ1$&kÆDºç›Î
tÊ € ñKå¸h>¦ùùÐNÞ	úqìÝ•HŽ?…ÿ‡t  »¢,/\àëlúÕ”¸óÖÈ…ìK.ö—ß²¥_¬  !ð© «YÕ?›ðŽ•[ïï¯ó'/*.‘ 0ú  í¶DòU±ÉÒºßy†»k…ï¡u³Õ1ÜLp}™ €ºNQìÇÙŽ„ûEùYí%9„  šS)°.ßœù !  ¢ß¢&R).ÔX u§ÂÕ0îpéÿt¡t–   1Â$ÄyJvË—ÇÌ@
I-z˜-'$ŒIÕs-]:Í  B "7_Úc=Pf£f%ºN÷Ð9»ÌÃß
Ž½åÏ  @\B`FIÑdZ‚Ñ¤¡¨&åiJw¯ØONp  „ªÍøå
ˆY·k‰þÏgê oçŽá>ó€,?
 @‚ú¯^{}Ã¯dÎê¡ùo#Ëµ<#ëW‹ë:ê=Ø§ !  wÔÌFœëW=ËÃÄ°(ü À%Ž]9ô°¿Ì¬(s  ™lñ¿2îUâƒ³¨°åÕÖaåÓòº^F­é<x  ! ÄéE l`ÈÀŠkSä.Ž°´}=ód  Ï£½¬Ð2Xàú5Ô ¹í¯á’³ \E6ÊëÖ`ÿ  Bà4xZ
g4Z+¹d‰0äü*­¤ÁðŒŠÚB  @×Àñþ_‚ìBg¼KÖˆž"›Â!• 1úë´½ª©@  µî.ttñ¹Ø¬oM(+
}ÐZf/ƒÆ „  Å)ðsÙ#…Q´  °ºß¶9ê#š@½sÌ1 @ -0ÿ;ÖI©ØÕÁ0—3oí˜"Ø3ÛÝ8,½VÐ’¡  „ €±„²›
@€" ;g¾ê ã_kç÷? ÝÍóŸ @ô¾P!S™m:&òðs×`£®Óý ~a½<Vnj,`  ›*·ð$’s}æ:E
ÿ¬x½_¦FpEŠ€  ½;w&ë-iÔÕ¾3ýÐÍ€nö|9_“  !  "çrhzšP¨8¶/sœÉV;«QÐ–Z­žQS  rÚ'ø³ÃËc$@kR §¤87Ü.ƒy:O"h$  ! >Ðkx…i¦°Ø¡•Úaõºe¨š’u•[Êèª[˜   aœUÀ¿ëK×ìP±â·ñvŠ0ƒ´Ö  "Ð1š¨‘hz¼HK†ç’£–¶r³•[&„ämiNà!íB   Ÿ 9¼f¯Ípñ8õÒ’hN4j‘ rdwðU\Ûdúti   >*™,Ó|Ã(“üEôÇ 2Z{g¹wzLýê| ˆ  \ÖúOÏÂl¦e³ÅBSýZ]/áÒŠ•z9
 € É@üùL× áY‰49³WÒÔáÑ4<Ò‰pTî  d.6‚Ò0 xº!Ã½ÊÔÓÏ¨q­3GÁLÆ5°p»ß  !@Âná:/×Æ°•±^ž”Ñ§#=¡ÚP{Ð„   |‹Úù?”½ÄŽˆžü}ŸÄrÐ|Y¾Ã`¼ü‘O¶y    éŒ"FßÒ…–H×5|A >äp2 …€(Åð(ÿÿÿ  WñÇ?             7ØÙêA’£ñmsüýX6€2 …€OOäc(    Qãå[˜!Øã3êüº8{¿€ynMËï !  G±sKÝsƒ‚…LT¥±9 Swÿ²gÇK6£	[Ê  ˆÆ¾‚Ê)ê2ˆ°èC3küøÈêÜÀ@o†  ! nj|0À–IÀhY¬äÅ&&yF¯kí½FxŸm#  º‹p?ÐŽé«BÓêÚ¨TSÙuå·çC/KV)%  !à ûæËÖÂÇHŒBwpŒ,ë“ÔÉð*  =pw­5zw{Åˆl:†_`©²GÇ 3úò·¾ €‹Ý“íûÐ·-ªŠT×s™hŒ\œ(
[c@  5?`)3åøBè$}BÀLÀº„ ¼6Í‹?;Èùœ „  ø\¡ýÚg•FK&\¬è0Ì1²;	æ½š!¹ßo @ …áûì:4“b@vŠ›R®QÜ¡öwñæ_Ã!ÐIÕ  „ ü4RcÖ«P"y.K&3ú[ÙS‹Cu}2]Ç«¢CBD  @JW`+Và.Rã!íéÖñèY %jå­p  „dÛ*#˜ØÃÒ:’²2ùª†êkÃ>©!ª$Ê€ß0óˆ  @.¼ãæ wâò¡‚a§Ðq÷äÅ¯í¥Ÿ¦çzîÜ€  Xš•ûç¥a¢uS%Wk8Ö £.÷9íg•‰Â  NÁB ÚÅÞ¦®°Ð®WùÚÁLâ\wùùÝ‘ € ÞÉ›œn°¨XÈÀÕ.¦eq',xÍy«N³,z9q¨  9QíÂÐ£ÕÏø±HðvÂÝšïòX°fÅ^y €>à·ID4žÚ¸rè}ÐŸµ/Jtöp÷ð  "ÞškÒ}‰ŒÊø Ü`.WL°@óÁ± 4ú2&d €ö† ÚP{”Õ‡söä+x,b}·ZùO«ìúÃn· !  y+v„hŒNžMn*• ¾r
ØäÂ\zIÿ  ¶ó[iƒ½E­¢Þµ0hAXr6ó˜UÕÖgcÐ²  ! £"8½á@ðWñ	Nä6{ghÔ°Ïx˜|9  ðÉ8P·šüZ•ÃýÇ’±ýFõ¬”å¶TJ‹ >A  !`Ò…TzÉ1Ô¼}/´ŒÝ¼¢Ÿ@•=jW4pÐ"  
Œžbà`‚ÔÑüPóDóÝêhÆZ€Ó#íú#•   ïr¹¯¹ëô¸HÊ´Òª†ÆTpÍÃAÓ98hŠ B   
ƒ9?mf9ÝžmF “aY]f¿Þ>"Ê‰ @ </K*¯ºêR\X°³‡º×Y®>\ÀìTð@ë  „ iaÀoJƒÀy\º9ò2mÐ;$S	öè»D¹   @2'Ð„‹nÝ|Ðˆç4:êvþq÷¦U…j.
ùà  „Kþq1¬LËˆ¦ŠVÊÖ’Sêk/úðq´B  @õ$´ið±*°åëÌºF«¨Œª¹ 5úDFúc   °¶„‰›EÂîP×Zäš<:!HšP¿ÁÀÄH[Ôx D  »,¦Ø!_4$nb D ·nIºœ´ÊUox[ @ ƒ2+Må|V0z°‰9šÌÊ«(íÍW5¨3=  „ YN†„ÝÀ@vPÖr^iqÒ©šëÄ€8Ò˜b)  @e(Pµ%H~B¿ó¤RyÅIÏ…ÚôkzèC`  „J:Ä0Úµkwk1ëØRì[¨Eˆ:3MpRç„  @³÷jÜ%µ÷¶
àÐäÀ(ŸHY€–ãY* ò@  ’’§[ÍYJ˜üøÓ,ûV=1M|ÇÌJ£-EÂ „  û™‘
Û”Êï cØíëÃIªŸ^zzœ @ ãQ^Ïž±ì§°¹!o¹ª¶¼5”¦û8rüÛ…  „ ôçýó\NÀÜHIÞZ:ä1~½<º¡QÏ*Ý°  5Ð	JÚ+‰ÒÀü‚´~àíÌyö+Û=3¢wàÒ!  Ò`9‚G¶>Œx WSÐðÖuH«ðró!ú   L'¶Zžÿ×£8²q½¼)ëæö5 6ú’•ˆš)Êì§»£ B  a«ŒXñZªˆ²þÝïF>Ÿ~9\;¯©–RE1   ÎIŽ'’I1Õg ª²©Ÿº9*ñ¸éÅeyNv  „ +2ÍÔcI0ìŽŸlF¼ø_§VyHwÖã'x{  @Ÿ^@´Sû½+ÐQKÐ£–Ãt% Y»õÕ*éþP  „‘ŒÜ4ýrEpÜQöÛ%M;mfKÑ=òõS`zÔw„  @ÂæûSJÍ‰]r²3‰¬—­´‚p™OžYd@  Aa.BÁ7*X	m_.“ˆd€Æ NœRÈL+f „  ´”TZ¥)ïäŽp^üêû>}´_il±Z©c @ ¸ÀÖxÉ}£^ý$ f‡tÑäÂ‚û¯0”ÿ²  „ a­µÔO¦°›£2´¿6Æž>T]óx«œÀuSÚú  @ºÀ+1?±ÞztÐYh¥M5¾\ß<ÆfåÜÐ  „ƒ£Í/Ú=IàkÛ¿—y~š28Q*$ à†ªLÿ €ùÕCßøN€nFÉÔ\K3ä
"ða€±N]+[   `‹	<ßÓç´p§}*“/ 7 ùPýE%3µ›  B  ;„Ð;>vÂÃ…Õç›á]–d=R[¼ÊÇ   ø­dDÚ T& W.zÌ£}k‹NÚÎk¼É¾  „ ªÖæ0Ü0Â8“½y
½(=~Ñh«TŸ/Ò§  @>!@–ÿ?*º`2›üÍéÌ 7¢O­TëDP  ˆ<ðÂüg©Þ~‚Æ^ÍµhPé×7ìñ˜`Ù™«ü €9¤b,¾Úÿžµ@sm‘V0¢õpF;šyÈæA !  ˜ht5‘íù…éylóxTú€ö¸zru[µ@®îH   ¯,;˜›Ù=·ûbUpÖ7pžoŠª>#
Œhû  B ÝËŸG$?" TQÁ7g SÅØÔ}³…áÈÔ  @à|q°U}šõ]…h¶º›x%é°€àÍÉ`À  ˆºZßøLàö#Û”
ÿ/ì@Ó'ÕÐ§¢+ €ú„YªžÄÍ/	ãñâcbÂ^G:¶à2K;B¢‘g^ "  ¹ªHŠI3ô¸è@¦Ì(e±ðN‚ú#Üë^u­™©Þ  žë×ŸêÓøNîX 8úT®ÉR9â(ü0r• {©Î  ! )ÍûsÎßáÌ#`¸š2og'–içík6Ç-   ûÞ= ­5><¬àãÇ›µ²ŸrÅ–OóƒïB±C’  D06hZBþy/gF>Í_>%ûP=èDgµrÒ@ñˆ  @;9
õÞÍ›¾TÃ±ùa©pYJéÚPöš)	U]€  Ñ†u?ž“@2!}<ˆ-`#à7§9w«ïý›  œñÑŽHhuov0p,¶3:&»ïÞç©ç%  „ÝÀ&l
X€O;CzCðÙPSwZ5Âæ{¸(:â0 €säq6uô³`8Ç§Ò¡VA³ýàcÜ­$ø   _)^"îÃyG~¼ú¯»’Î§º`ŽÆ°ëRö €Új9²Úrô£yN×F¥Ap1?“‡ôÀƒze¦ÒI“¡ !  ":chtqßjåg™@Ð,ÛkCò0SJ¢Ê0   ¡‡'
ÌÕEÛÎ–à‹óú5º,.T©toc µùô  B ]©û9|›ŠðsÞ		9—¿Äô„[Óf!ï¦LÔZµ   0¯P 9úN×Ú":'Ñk¿z>yéfÙ2žB‹ÍžE  B?aÍÞ9Žï¨ˆ"ÆBp§%R”Ÿ¯ ÑB   áÏ êÛ¤xk2(VM‘òÄÓO%—|0‡JÑúY½@  ¿®ƒÃ{tVzÉ´é·ækÛ@`Ò¶jW€5ëm „  åLºïï³ÄÍu@±²–PªžSHº¬FP8$G,ôy € Dão»ÄìeÃ`ágÚióÝuUßã~àl.˜  ¨°ÄdÒpCF?ÆaY}^à]‘Upg>Al›ÕÚŒµû  €¹€¹öÅ$:É×ZÁ=©{ç×Ù²ë£yFmæâ9 ÿÿÿ …€1‡’h           (  o2ìw‹%†Æm>ç§žUW@Æ 9 …€  Ž~Lª×¡î£}s4…æ)À ‚:¤°~“ ` €äþŽ—lñ¬»ö9½v¶ïÃ¾eÌÉÀ“×¯/DõR   Oln˜g5yÔ7õ¤ 	Ðq:ÓÁ•ž|ˆÜ  ‘ÝwË1ÒÍðnpà˜‚Ÿ÷9•e†¢äÊkÇ©ï  ! Ïp»ÞÞ¦<Œð/·±¾$“QÂT‘BÃEÆ~Cb  \Ž :ºiÙÐ§vQÓ2«”ÇÍFä8‰Ò– €óûô|7÷/-"}¾åÇ-ÆóÜs   —‚HþÈk	èÅ†g-Þ@Ï/gÈhÐSç0ë. €n;­øÿCåš‰Hk°ÊOýì* X@€dî€  ;ðG€Ëq÷>ìåfÞÓP‰Û«ážæâ  óyáüe5õú‹Îô`Åªmèÿþú¥û	7Z € ×®7¯I‡ãpÌ—ð+òzy-SÀ‚ù@ˆß¿þ6¼  ~áH´/€
Ç=áÿó7*ŽsÃ£H9<­]º¨ €µ«ÃàÒŠHÝ`NæŠQ9Ø›ûðá•áX]€   ’Ú²ß;ÇqÚÖKv$¡hâh€ƒÂ¯Ì°š €±b¦DA¿ç…å¾ôÏ°§‰eÀAÍø©ÏÈù€  w7\ Çíj¢OI ðŠadÐ_SšŒoð¼¢u  H-e´f÷ÅQä˜cÜà#ìŠj<ú~\Ñ'Ú²a € =u9«ª]±üðDé]C&îÙ’HÜ«÷U³/  „ ï¾ºÑù ;úòh
Ð¸—éh‹|u>Já7ßëý @WÄ,Õ:‹¿ß­ºO7gd5oc‰Äb
   ¹£²¯—§³~Cøè˜ö·³ÃÙÿÒ¿Ï#0a:‡Z   Ù™†¼qU Û(D‚K#52˜°Ÿ´@ÿVžZo|ÀéÀ B  ¤HI(R-¨¹£Î¶ñ|PÿóYhãÉ7    ÕÃ®P>dôóÿpq`>0é'*UøóÆû»XáNÆðø  B œ"¥¨”+pÊm¨:½‘Œƒ»æ÷à]h$%ËÊ~ð  @)€×a˜¬Û{šP—‹þCÂ æPÞé“¿=†  „HN8×6|w«Rwà‘1àWu•LBÍ ÇGaˆ  @w„ÇiKê3ãK9Å'² t’·ÕÈÛÓ°®’ú>€  	7šã4AcòAÁÅO3€À z”ZÛôìý¾  tçÍðÓ¦Øõ6æÌTÐ­>€ñK÷T'‰h©N9  ! ÷Ò¹^Ùþ€àèÀE,Ëx¤_Â³~8¡¢4  ïnŒ1ðIRL|5
Z-<ŠÊµ!w•Ûg•­V7Noì   <ú¶!Æš,Î¬¢´}ñyý ÖYâøã‹Ó!  Þ699B#Ï¦ÉÖ~ós³÷ý>Jñ¼c D…,H  AcÚgHˆÇOÅÆÉZÛ;5/50öõNJÉîÏ‘ !  Ž‚Pá1ž~õ ÜgóTZ[@'·ŒŒ32©¾'   !l’läv²êÂ›ÊPV‰HÚ(Ï0aUèÑ ×  B kìz	P`ŠQ/ÚZL«×â/)áéOr·Q  @Å"p#´­0[81X¤ñl©*Þn,š1ðÈ€  „[¬m>™¸]T4³mSâpo5Q½FŽÂà‘„  @.L•eK¹]døâ¬uø,Ì	>è ?ÐÃ!Ñ@  ãL¶V\°n„3‹œ­“5C°ë]€øýŽ&r „  _Jì÷v;·
aÆ³ÀD—DVI¡VJæé°¬¯ € /…À…î0°üSFÐ·ëº*†¹m6SŸ\ýª²Áã¦  ƒÌØ¸|à…¶0j9cø57¯¬B;ïñž¨ýäD  €TðG£ŸšÍgÓÅý€uÅ½ÒM—ÆŒTæ’ß =  „úR£«Ør>ìŠßIXÿ„žìYDñ	Ü«í‚  @WQÐ§^z¶á;ŸyÅ;Éo•H ’”˜(@ž@  ¯=¼½ÐÖgFKg.TÛw%M80zæ}úì™óBfÈ ˆ   ^¥‚œë²†Ëß^Èo@Ã6z¢º?ÍÕ(Î]Š € ­;hœ@éN5PßíïYÑDroƒïô÷¾ <›•I  hjIXÉ`ò2³š2‘ÚkN	ÌÖVû¦iß¨½c  "p!2õº!Žd0þcÏí>`ëû÷~Õ%g´§¹€+Öˆ  @dš2må—zh+íev`MÌVjQRÇ¸e‘_š ’	€  ¦›¥z¦FœW˜–àg8 |ÇØÅz>¨ŒfÏ  úÝé%ÜÂ~,™°;vT,	§ùþÜàgŠh  ! KÑ56äQxÀzoo>a‰Z¢;JèOüOEN³  wÍºÐÁž-"¥Jµ¯LW‰ù€t‘€¨>ÂÜò(  !àp+a%a6úóÅ«8–‡
¥\hÊN­aGðö!   ¼cIÇ»Ä ÌÕúH$©b™à?BM† >úð¸lª9  ÇEÀmÎ‡uDtîàèšBfl#U­§µ$´ "  4ŸŠ÷4+Ê;Õ8ó §`>Ú»Ê™û¢Ô   ýìÜHh‚mz@0~ƒ79Z-ú‚„W—ìÄÅNq  B ·!{ŽýŠ¹@•Íheãs5mM”z¿Ð[ÄÔz   ®–PvìüIÈØÑ¹-‰ÃøÏá„ŽÎ+  D`Såïšë£îr$»mÂtAâî”)ÁÜ'p-ê"„  @b9WkÓŠŸjpër×‚ÊM0ó¿hÕ€ï6<îz(©™   &ØaùõîxYk€¹ ÿí–ÏóÚ+/…™±g¸Q  Ó°\‚š~uW‡h¯ Ùê0Ø9€;øSV%ÆªÁs™  ! ªºOÊCÌ„\°+5îÇ˜÷$ÄÂÅû•µýr   X›À˜”ÝºE¬„²0w§¯îçTí]Íl4Ð  „ÌÌZ'dŠ`/ô\+xÝJÀµc]|
jëûà*’ €Æ“ÌY ƒ†“$¬í‰Kp/WOhðÑX)$z(²å   îˆÐ¨XÒ·wåf¥aq ?ú’‰íZTñîN#‘+Z<  `Úç5%îD2’6LÞ_ç…Ç9+O“¼ÇÂ Ê)†Ø  ! K¶K›ÀX “x7Ó¼‰`°ÈCX<?7<Þ  €Q‚{0yÛåTâ”¿e<pÊO©:HËyg‡9Ï*t  !@!‚CÁ}û‹§¶õí
±@^Íîºlø5…aõ„  @4Ž"A¨K—´ŽßÖÅ6„ç)É`XÖQ¢ª@  dˆn¼¶ŠëÊÜÐ"¯zl>ã-põH¨1Œ–%g° „  Õaö+âpJÒì–ƒ[6€Ž{W;ë›5+¯Eæ³ @ ²¶:ÓÕÎ×4ÔËvñ.z‰
,‘?A›ï©  „ “³¥ JúX›dÅGÇ˜O%Øxh|ç` @ÜÌ°hƒ":Jõ@ÞÌQÅyŠZÛ´“ôgõœÀ  ¸nÄßÑï0üš¦ÅÉte3kžx½w´vÐR¾Ò› €zx 9/ï¼ê„òËù•fg7¦à&‘ûzUA³J‚ !  &SÝ÷6²ÑÒaJpJÂ‘¯Zðžï^IšDPVÉ˜©îD  æ½c*P þÂ¿rt @úøüÝ	@i@`?Å”ù‰³p”  B k&!ÅØN¥HO Â[û±›’¥]9ŒãU}ÜŠ†Øì  @Ý —)GàxSGò·_yn–AÆñFkæ0  „ÒÒ™{Ž(×N'e»×™åÙ$®þšå@ïW)ˆ  €úìEÄÌEê¿aN¶“ËBie1P@šáÇ:¯Ú€  ]ß5L-
íîè §š(ÅÓ`¬DY»"LeBÜ[  ?]ÑŸÆ€“	Ae@p:¬&dúÛsð‚U&¯y € wWØø:F,æ€ÒìU

o ›7E¯2G?ûìÞ  k>šÂÑnä]ð0Wû”Í],ó2ºlÄ}Ñ…š   ò _¥%(  Ô#(Ñ°ŸÞ9 sØi6Æ›Dÿÿÿ°@                …€YÙ¡(  û%Ë•Úå¦€ÃÊ(oçx·  @À@ …:³nî«S´ÿ¬þ²N>í›=‰ó,$EÔÐ  „]4MÊêCƒpdZ¾½7¬!mÇágRY¡IàA]¢„  @£Žj’œÞy«B³U‰ÏïZ“÷ð@ÔëMFp   É˜I¸ŠNîjœ6¾º!_K Azâ‘\úás|œ B  bónÊÏy{Íê‰Ù¢'ºæ½`½¢RXB&Òã   ÁíN»·*ð‚¾ ?Õ¢•Û_Y\ÇRß‹È_#  D ð="“Z±z0øþººûG3Pxj?Sç†@@­¥Rú  @í¡@¼º4©9£É T=Eäî›æÆî
¬ý–}_Á‘P  „áuîÎLE™C=_Û,&f”´$´;qëÖ`xç„„  @Ä>U{ƒ‹âFÂâ	,Õá”½Š*pÛ!³}®6@  ô‰ß¯K/õýaJVŒï€6Á	?ª\«¶ „  p†ÐìmX-´¢9H ž±Ä‡ÞfEý&Ë¿ @ Pš›ÛœêÀuµX ;8¦ç–!_hÆ+ý|twqw  „ Fg'Û°†½„‚¦¤ˆØgb.g©Ö]’23Ð›  @q¦À!ËKÉŸ÷ÜLÒ.sÑÃzŠê
,°ŸÅÁÐ  „æ)Ì2Ö°[â¬T°½rñÂ\×Á®ìþàã_„  @-‡úÓøýÙFIn=ÖvÖ ,J½ð†ëYÀíe   þA{´©ž\ÃDœ&î=ºg‹p2 BúøR¹»4_¯ËO B  
Õ©3¯Â$	Ô¦	mÁö7ù½è½¿_5Íâ   Ÿt–c!Ô˜Êí–q `^³âáí×)N<5öåë  ! 3	±- 0BZÔyÁÐ‡,x#ÝÌ§»lÌt  ¨˜ä@¶V=/ÿ‹ËYE¿,úËQ·y¹³jî Þ  !Pš=—cþ¤Ç¡Du°oúëßÛ"Î*ÿÕL¶`!  2ÛµÃ8ý-´!|mA@«§ÌÛü›‚pS  nÍ€ä4^áò™©ziK+·ð€¬xÏk¼1—€  êq[Ñë&·¡8DM—?BºÐL	$[Oé–Õ;i  <—H£….J„ôËì½ õ°1ä¨‚¶²Ë¬ € œ»Uz*¢
¥°hŒjÿð›\5‘7Æ—“âœþÈb
  µ27®ÀùÄ¥›`C{­¡—·¢¶BÔˆo €¥ÐÀKÕPZ„ˆ8‚™ºÖ‚‹¥ñbø9‡þªtà!  U‡=šÓô¹xñ~ýÙtª,B3[J¥ðN‹ç  _à>VõØ“tâŽ‰¶D?YÊ CÚ#]T­?Ÿc€  ¥Qé´2Þ>‚²ê„|«á©›nš/çÎ^îç  ÚÑµ:qâ„÷c Ø‰Ã#U¹®îÛx:5l¸  ! ßƒ¿:¤¿ì‹0AK¤ëNN#«½OUŽÆ<×   Ê°ÄK@ ÂZ:&Ÿ‹Czƒ~ðËºçGôFºj_  BP] ,€9óççæ8fVÑã‰wN[ÔGŒŽ`Ä›B   Cú,ÝÜº1˜Š•òŸå…<ÉÃ­hª¤pj2=pX   `Ìl(lÔ!Ñs«ìÇÿz€V[ú	Ûja‡ B  ¢Ã#ƒÉQÜråíšÚ"ß^G!‘ÞfiRLå×   ò‡·°^Z‚D² /ÀOÆý…uèŒõÃV¼éóx  B ‘9±ö •]°6ú)!_þÒ9ð¢4#Åã^q €Ó€À^ÔZ0k *[à¨g>.{ÔÅª`Nwž¨Ð  ±ß¤Ì9„CJ`A‹ê;^¼Í TÒ;NàIJ:&  YKMgùÀ¯Ö$‡óA#VZÀðö2ïÚ\«C› !  ²vÿKÒKHì®~[óeÉo Dú»^hö¤ˆz{E¶gi  àµÆíKÆ®¬‰ýÒ«`Ÿ<\KkÖX²KCÌ  ! V”haZä DSáýBôðF|NF"Â­£  Žîâ 0Ð"y
adpa1QùÁÛu÷º¤$ÅF  "@qÀ"Z'œ •æhÊauî;†éÆÝ£zPíG„  @º<ñ<èoQ67g™oná‰#H­@'y`çvèYÏl@  !r!çŽ^l ­c¥±—Ôép§õïHÒ9j1ë „  $˜Xðü‰‰œG!€Õ^Œ2aº+‡³/¯ú½ @ ½ŒiBøœŸ[n?é: ÚÏi†ÞzµÅDå¾*  „ ‡Y  ) Xq<Û1bÃã,¢%žº¸3WN§ @Íõ°Qy":
]1b~ý>ívêrê{|!GbÁJ­À  ñ‰)å7¹fœÞÚõr|'aa~VÇû4ÐØ*“^ €µ‹EG½‡U¾ôêî8þÿåÁ×K'Íà™­Æƒe€  ¥±;êÒhày(@Ò^äÜð(°Nªzžç
¾¤ „  `ê½gæ3ëpã›l Eú<m–%lªyaÐF% @ Hè^„RaG¿\nôƒŽIŒ‹¯ôÓ‡=  „ ¼ìú/³V ÚÀžU¨î×aSÖÊ	wíÒ—é<Å3  @<“0­ÀîxdÏ;°
Ö„óƒ°¡ìÓÅhê‚a@  ˆ?Ïó@ºA=k­Åùô"G”ôÄÑ–ÚP+v €ZK¶z}ðÈQdŸ²Ìá£`£a„®Bz !  ˆñ*G)£Æç2EŠ	7+~pùv1ªÔA‡$O){  W ÈÖ;–k!b€z­ñº3ÍüSá.ê912ÄA  B ¨dØ bÎB$s3Ê“â‰àÀ+=<p	ddŸ   Õr © Á¼K™Còé?at¼Ð®`Lî®  B°¾¹Ó•šæXÇb3’V…ú[¦\ b,žÀ OB   ƒ’*C±
UŸy“Ø‡µÊ~´uE¯xÐ?ÄC\p   ¾l§Ön3w[ÌNa Ô …*oàËÙ³P°/c B  km‰ïtÆƒöÎ±ÐìÙTð6‚sA[ÿáÝ]ù3w €P qôŽ‚¥Ðiø5FúbÐGä_•¸/²².oŸîog  )È¹ w¬r˜LWÚÊ$VÁªÎƒw²$_ŽæO €ò ·IøZt…K“ÛêY´x!;à‰ÜÑ0!  múmº¶Q¥éöZ>˜tÙ&³kÈ¬@ÊpX:J   äXÞD’ äÝ~%¨ƒ')>ÃÌÃPé[)¡‰>ØN B  Îß.šSE¨B)Äp`ÖdoúGñ>ÒÕ&$› € ºNQ™¶QôpÆA>º0²Ó…§gÂ†‡Mæ©[   ÙYb­€w…þ9zlhô@dÞÄ2©dhmõMÖ €ð-&xÌ‹·é(üÛ¡nTâû»Sù-¤   Þ^‹=õÌ›ß²:›µ·fTä#7úª°þëÂ~ˆ  €«ð¤Õ´è}äz^±2<)7‹ ›ÀFzŽ†‘:Å¢   ÀkWcj&MÆÒú†8–ÂÙyZÐ¯Šm7‹ ¦}kÎx  ùÝ3l·Ð€a¹à[r§„YëïZZxe°Qr™°k  ! 3$˜ƒËðO¦R
é³!Íh¨ü!ð¿—àägžÑ  ñÀkê GzÚm} nün)¾dÃwÒßñMK®$°+ €Yd$½^%wœ”øàöÏ#/ÝÄŠ”   ÛÄW¶Jlm7aÒ›’?ÇÁ"Þ¶tT0,ÐIŽ €rg#¶Úû†š:	/+gß°@šWi.¸g€  2â¹üm9ëBãpðO Èu-P!Ê†gÖöFù_í»  _f¤Ú‚¶¸Ö³r¦«`>¥$(d(â÷°×¥¬±Qz  ! v–~Õ/™p—Öš)·é’îb’¼Š—8£p‹¢   >|F€lôÏÂ†™ÐûÃôìÓ‘‘¢ÁQrU)él)  BÆ™=átî¯,“¨—ËgÉÀdæ`
ç QïB   áâmá’t¦ÿD:‰çÖ_=Am~×Ü°mdŒd   S+‘ßF8D¿LPŸÈf>Ž%sÀ 'Þ(  ¯ÿÿ Wôä’vg,5@ Œ<˜    eî;×ÐG …€f)¸Z(  8ƒèª88'ÌJæ  ! ¨ò(˜ÙŽ¤Hàû]>ôŒBöÄ½aŠ¬+-¼Cpa  FÄƒzð=C™Âé¼-²Y¤µq„•qG– ÃsŽ € HZ²sù=a¨“ì { Ÿž8Â³™C  @ç5r’fßê{{W5ªê RÎžË;Ô> Â.	Û €Rt¨’…R¶Em›Ús¹Ó¼hÉ0Š„p€ Ç€  N7›<Þ ˆšl)2lé·Æ@|èÍ^ÖÍ3GÅ  ,§'Oô¥Éf ¼±Pé¼™Î°F\ôƒÝ8X} € *ÌªKó±=t@` Aš ­L‚¼7f²K=à²  M«GGpuLw“º”}`èðt£‘C0œ €Ñ€êfž3}	–ãŒWšÛ\ÝÃ®0Q¦~(s,  Ë7¸ž”±7R]¦d[²ÊXÕÂÕhòª‹’ g:‡ª €þ9*<¾Ÿ¼·ÍŸjbì-t°`ì÷£–Á€  Þ/‚¬õ~×w.²%Ò^‘ÀM/
†Æj·™  X2YÌ™¡”¼Ž“¸ÐsO*ÑÇt^hvíf   	}‘=_µÓàQ=Ç
îÕO‚ú«™¡ç€—lFëÈ  {tM…ðZ=_²9ˆžža‰fZˆk›]J% € Iú’Qæ§½Ä bí-Œ“X3¬¿ŒÑ­a£  ªç îÔv?ƒ”¾ªBÖ‰úÁé‰¹1× Óßá¼ˆ  €@ÑœŸæ–§ü|'e.SýDè#˜ã0IZ×i«ºyM€  R¶ïŠL8¡ºAÇ$òî*¶g@èúHû@r¹Ñ6  ¼b¼Ñ¼Vs™=Ã¬P®åˆFÏe¶FLp€  ! (:¸ €É`ŠaŸGÚ¼òNzÑ¾O›k^†  
kM„p3º9·0RÌ±%dfc¦pð'È±ø0ÿŒ  !€ó>š[í°'ôÚtSÆþœD°Ýeü×!  .¬È‹¥³¿ý¾P‰Tkæe7à B¡À   Õky®ÔY³™Ä_¼(cïM°ÐQ´ºx4Rƒ' B  Ñ~Â°©\p¦S¹ýoZÀYW¦T9Ø0‹?¶¸³œ   ¨¤°Ô†¡CÐæöCàø¤\fCª½ K  B kz“k¡ŒJà5…èÊtAB¥­€W»qÈ&‡(`Æô   •ô5ðõþé=Ì@×b¼n	¢T#jQ!Þ®ŠN  " JšþTÖº~y×Å@²³Ùo—€¨i‚þ¸üVB   T9D šq"níòˆs¹±5À /¤*µ   iôj4vx Çáû7¯ŽÐ0Ô0¶ÞKƒ'ŒFùÃ B  d€‰^¡›9<Þ@Z=ÿÓ»<°Û½Þ»¡   “¢ŒµÓ1bÞa¯DPeç¼­YD§ Þ^Î¡´&–\  D èÍ“JA	`€"
šñã‰bÄ ábaØ¨ˆJˆ| Ø  @”•p)Z÷E9 V)ùYÈ»Jfj©Z¯eøf€  „~póŒÏ9ï¨ýüö
ZgËÃÙkŽ””	ßÒW¹1„  @ÇÇÌ÷ù#¢Ê=÷ò~AÚm„4l î¹ˆVïˆ@  †Á‰
ûa0FGb¹@hÏëè¢°8PÛ¿–D†P» „  jšM‡lðÇíØV¾ÀÑL=bÜÉ„±‹#Û   !*
‹ÆN¬žÐGyc+(ø56d:c¯„S©ˆÙç–  B AöXÙ—œàÀ9\vÁÿþçŒ%>Ý‡Rþ*gl   °CðO¸åS(PÝ3Ó¦lÁôæ¡™H\ €  KúÊÖ‹(XFeUñN\Ä¢Ž;ð³È1Í  º`Ù‰	ž`ìŸíëÍâ›“k×ó§:( ðÁ €oeMÀÃ[ÈO4/aG8z#@0”c“ú°­' "  )¨º„ü€q‚ŒMnL«á@°':Ï¥iÆZCu   d§êdÁxZÌzÍP°X–9?³ºš€€ƒc)=1ìC  B ©ô)73R`úå .Šëºkû7mK’w¾n‚Vœº   %­p÷ÛûÁ”Ÿ6|Ù€NÈýýVQË¥;¾Šå€  „åVy!hã±ìøx7¶é˜cvVÎrŽVV„  @pexNicIžÖ§†W]éûðÿÒrU LåKE@  lÁ(´X>¹g|Ï@G˜øaO*°œãºnz1À/Óg‹  ",Y
Ÿä /b«Àº# GËŒ“ÙŽKRü7 € XEF_ð||ÐH27û,é‚j‡Âø¾DÿŽ.{
  Q±«úàÕ`˜š)k×ÚE
–X¥tÊ9` <eç  !ðå‡_(ú,Æ™?†:ø¶'½¹ßÂUt LúT!  RvþÊL§È/lS¾RêC(4ã`½µ^$ÏºE   ÊóÁQos);
            var change = {from: pos, to: pos,
                          text: cm.doc.splitLines(text.join(cm.doc.lineSeparator())),
                          origin: "paste"};
            makeChange(cm.doc, change);
            setSelectionReplaceHistory(cm.doc, simpleSelection(pos, changeEnd(change)));
          }
        });
        reader.readAsText(file);
      };
      for (var i = 0; i < n; ++i) loadFile(files[i], i);
    } else { // Normal drop
      // Don't do a replace if the drop happened inside of the selected text.
      if (cm.state.draggingText && cm.doc.sel.contains(pos) > -1) {
        cm.state.draggingText(e);
        // Ensure the editor is re-focused
        setTimeout(function() {cm.display.input.focus();}, 20);
        return;
      }
      try {
        var text = e.dataTransfer.getData("Text");
        if (text) {
          if (cm.state.draggingText && !(mac ? e.altKey : e.ctrlKey))
            var selected = cm.listSelections();
          setSelectionNoUndo(cm.doc, simpleSelection(pos, pos));
          if (selected) for (var i = 0; i < selected.length; ++i)
            replaceRange(cm.doc, "", selected[i].anchor, selected[i].head, "drag");
          cm.replaceSelection(text, "around", "paste");
          cm.display.input.focus();
        }
      }
      catch(e){}
    }
  }

  function onDragStart(cm, e) {
    if (ie && (!cm.state.draggingText || +new Date - lastDrop < 100)) { e_stop(e); return; }
    if (signalDOMEvent(cm, e) || eventInWidget(cm.display, e)) return;

    e.dataTransfer.setData("Text", cm.getSelection());

    // Use dummy image instead of default browsers image.
    // Recent Safari (~6.0.2) have a tendency to segfault when this happens, so we don't do it there.
    if (e.dataTransfer.setDragImage && !safari) {
      var img = elt("img", null, null, "position: fixed; left: 0; top: 0;");
      img.src = "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==";
      if (presto) {
        img.width = img.height = 1;
        cm.display.wrapper.appendChild(img);
        // Force a relayout, or Opera won't use our image for some obscure reason
        img._top = img.offsetTop;
      }
      e.dataTransfer.setDragImage(img, 0, 0);
      if (presto) img.parentNode.removeChild(img);
    }
  }

  function onDragOver(cm, e) {
    var pos = posFromMouse(cm, e);
    if (!pos) return;
    var frag = document.createDocumentFragment();
    drawSelectionCursor(cm, pos, frag);
    if (!cm.display.dragCursor) {
      cm.display.dragCursor = elt("div", null, "CodeMirror-cursors CodeMirror-dragcursors");
      cm.display.lineSpace.insertBefore(cm.display.dragCursor, cm.display.cursorDiv);
    }
    removeChildrenAndAdd(cm.display.dragCursor, frag);
  }

  function clearDragCursor(cm) {
    if (cm.display.dragCursor) {
      cm.display.lineSpace.removeChild(cm.display.dragCursor);
      cm.display.dragCursor = null;
    }
  }

  // SCROLL EVENTS

  // Sync the scrollable area and scrollbars, ensure the viewport
  // covers the visible area.
  function setScrollTop(cm, val) {
    if (Math.abs(cm.doc.scrollTop - val) < 2) return;
    cm.doc.scrollTop = val;
    if (!gecko) updateDisplaySimple(cm, {top: val});
    if (cm.display.scroller.scrollTop != val) cm.display.scroller.scrollTop = val;
    cm.display.scrollbars.setScrollTop(val);
    if (gecko) updateDisplaySimple(cm);
    startWorker(cm, 100);
  }
  // Sync scroller and scrollbar, ensure the gutter elements are
  // aligned.
  function setScrollLeft(cm, val, isScroller) {
    if (isScroller ? val == cm.doc.scrollLeft : Math.abs(cm.doc.scrollLeft - val) < 2) return;
    val = Math.min(val, cm.display.scroller.scrollWidth - cm.display.scroller.clientWidth);
    cm.doc.scrollLeft = val;
    alignHorizontally(cm);
    if (cm.display.scroller.scrollLeft != val) cm.display.scroller.scrollLeft = val;
    cm.display.scrollbars.setScrollLeft(val);
  }

  // Since the delta values reported on mouse wheel events are
  // unstandardized between browsers and even browser versions, and
  // generally horribly unpredictable, this code starts by measuring
  // the scroll effect that the first few mouse wheel events have,
  // and, from that, detects the way it can convert deltas to pixel
  // offsets afterwards.
  //
  // The reason we want to know the amount a wheel event will scroll
  // is that it gives us a chance to update the display before the
  // actual scrolling happens, reducing flickering.

  var wheelSamples = 0, wheelPixelsPerUnit = null;
  // Fill in a browser-detected starting value on browsers where we
  // know one. These don't have to be accurate -- the result of them
  // being wrong would just be a slight flicker on the first wheel
  // scroll (if it is large enough).
  if (ie) wheelPixelsPerUnit = -.53;
  else if (gecko) wheelPixelsPerUnit = 15;
  else if (chrome) wheelPixelsPerUnit = -.7;
  else if (safari) wheelPixelsPerUnit = -1/3;

  var wheelEventDelta = function(e) {
    var dx = e.wheelDeltaX, dy = e.wheelDeltaY;
    if (dx == null && e.detail && e.axis == e.HORIZONTAL_AXIS) dx = e.detail;
    if (dy == null && e.detail && e.axis == e.VERTICAL_AXIS) dy = e.detail;
    else if (dy == null) dy = e.wheelDelta;
    return {x: dx, y: dy};
  };
  CodeMirror.wheelEventPixels = function(e) {
    var delta = wheelEventDelta(e);
    delta.x *= wheelPixelsPerUnit;
    delta.y *= wheelPixelsPerUnit;
    return delta;
  };

  function onScrollWheel(cm, e) {
    var delta = wheelEventDelta(e), dx = delta.x, dy = delta.y;

    var display = cm.display, scroll = display.scroller;
    // Quit if there's nothing to scroll here
    if (!(dx && scroll.scrollWidth > scroll.clientWidth ||
          dy && scroll.scrollHeight > scroll.clientHeight)) return;

    // Webkit browsers on OS X abort momentum scrolls when the target
    // of the scroll event is removed from the scrollable element.
    // This hack (see related code in patchDisplay) makes sure the
    // element is kept around.
    if (dy && mac && webkit) {
      outer: for (var cur = e.target, view = display.view; cur != scroll; cur = cur.parentNode) {
        for (var i = 0; i < view.length; i++) {
          if (view[i].node == cur) {
            cm.display.currentWheelTarget = cur;
            break outer;
          }
        }
      }
    }

    // On some browsers, horizontal scrolling will cause redraws to
    // happen before the gutter has been realigned, causing it to
    // wriggle around in a most unseemly way. When we have an
    // estimated pixels/delta value, we just handle horizontal
    // scrolling entirely here. It'll be slightly off from native, but
    // better than glitching out.
    if (dx && !gecko && !presto && wheelPixelsPerUnit != null) {
      if (dy)
        setScrollTop(cm, Math.max(0, Math.min(scroll.scrollTop + dy * wheelPixelsPerUnit, scroll.scrollHeight - scroll.clientHeight)));
      setScrollLeft(cm, Math.max(0, Math.min(scroll.scrollLeft + dx * wheelPixelsPerUnit, scroll.scrollWidth - scroll.clientWidth)));
      e_preventDefault(e);
      display.wheelStartX = null; // Abort measurement, if in progress
      return;
    }

    // 'Project' the visible viewport to cover the area that is being
    // scrolled into view (if we know enough to estimate it).
    if (dy && wheelPixelsPerUnit != null) {
      var pixels = dy * wheelPixelsPerUnit;
      var top = cm.doc.scrollTop, bot = top + display.wrapper.clientHeight;
      if (pixels < 0) top = Math.max(0, top + pixels - 50);
      else bot = Math.min(cm.doc.height, bot + pixels + 50);
      updateDisplaySimple(cm, {top: top, bottom: bot});
    }

    if (wheelSamples < 20) {
      if (display.wheelStartX == null) {
        display.wheelStartX = scroll.scrollLeft; display.wheelStartY = scroll.scrollTop;
        display.wheelDX = dx; display.wheelDY = dy;
        setTimeout(function() {
          if (display.wheelStartX == null) return;
          var movedX = scroll.scrollLeft - display.wheelStartX;
          var movedY = scroll.scrollTop - display.wheelStartY;
          var sample = (movedY && display.wheelDY && movedY / display.wheelDY) ||
            (movedX && display.wheelDX && movedX / display.wheelDX);
          display.wheelStartX = display.wheelStartY = null;
          if (!sample) return;
          wheelPixelsPerUnit = (wheelPixelsPerUnit * wheelSamples + sample) / (wheelSamples + 1);
          ++wheelSamples;
        }, 200);
      } else {
        display.wheelDX += dx; display.wheelDY += dy;
      }
    }
  }

  // KEY EVENTS

  // Run a handler that was bound to a key.
  function doHandleBinding(cm, bound, dropShift) {
    if (typeof bound == "string") {
      bound = commands[bound];
      if (!bound) return false;
    }
    // Ensure previous input has been read, so that the handler sees a
    // consistent view of the document
    cm.display.input.ensurePolled();
    var prevShift = cm.display.shift, done = false;
    try {
      if (isReadOnly(cm)) cm.state.suppressEdits = true;
      if (dropShift) cm.display.shift = false;
      done = bound(cm) != Pass;
    } finally {
      cm.display.shift = prevShift;
      cm.state.suppressEdits = false;
    }
    return done;
  }

  function lookupKeyForEditor(cm, name, handle) {
    for (var i = 0; i < cm.state.keyMaps.length; i++) {
      var result = lookupKey(name, cm.state.keyMaps[i], handle, cm);
      if (result) return result;
    }
    return (cm.options.extraKeys && lookupKey(name, cm.options.extraKeys, handle, cm))
      || lookupKey(name, cm.options.keyMap, handle, cm);
  }

  var stopSeq = new Delayed;
  function dispatchKey(cm, name, e, handle) {
    var seq = cm.state.keySeq;
    if (seq) {
      if (isModifierKey(name)) return "handled";
      stopSeq.set(50, function() {
        if (cm.state.keySeq == seq) {
          cm.state.keySeq = null;
          cm.display.input.reset();
        }
      });
      name = seq + " " + name;
    }
    var result = lookupKeyForEditor(cm, name, handle);

    if (result == "multi")
      cm.state.keySeq = name;
    if (result == "handled")
      signalLater(cm, "keyHandled", cm, name, e);

    if (result == "handled" || result == "multi") {
      e_preventDefault(e);
      restartBlink(cm);
    }

    if (seq && !result && /\'$/.test(name)) {
      e_preventDefault(e);
      return true;
    }
    return !!result;
  }

  // Handle a key from the keydown event.
  function handleKeyBinding(cm, e) {
    var name = keyName(e, true);
    if (!name) return false;

    if (e.shiftKey && !cm.state.keySeq) {
      // First try to resolve full name (including 'Shift-'). Failing
      // that, see if there is a cursor-motion command (starting with
      // 'go') bound to the keyname without 'Shift-'.
      return dispatchKey(cm, "Shift-" + name, e, function(b) {return doHandleBinding(cm, b, true);})
          || dispatchKey(cm, name, e, function(b) {
               if (typeof b == "string" ? /^go[A-Z]/.test(b) : b.motion)
                 return doHandleBinding(cm, b);
             });
    } else {
      return dispatchKey(cm, name, e, function(b) { return doHandleBinding(cm, b); });
    }
  }

  // Handle a key from the keypress event
  function handleCharBinding(cm, e, ch) {
    return dispatchKey(cm, "'" + ch + "'", e,
                       function(b) { return doHandleBinding(cm, b, true); });
  }

  var lastStoppedKey = null;
  function onKeyDown(e) {
    var cm = this;
    cm.curOp.focus = activeElt();
    if (signalDOMEvent(cm, e)) return;
    // IE does strange things with escape.
    if (ie && ie_version < 11 && e.keyCode == 27) e.returnValue = false;
    var code = e.keyCode;
    cm.display.shift = code == 16 || e.shiftKey;
    var handled = handleKeyBinding(cm, e);
    if (presto) {
      lastStoppedKey = handled ? code : null;
      // Opera has no cut event... we try to at least catch the key combo
      if (!handled && code == 88 && !hasCopyEvent && (mac ? e.metaKey : e.ctrlKey))
        cm.replaceSelection("", null, "cut");
    }

    // Turn mouse into crosshair when Alt is held on Mac.
    if (code == 18 && !/\bCodeMirror-crosshair\b/.test(cm.display.lineDiv.className))
      showCrossHair(cm);
  }

  function showCrossHair(cm) {
    var lineDiv = cm.display.lineDiv;
    addClass(lineDiv, "CodeMirror-crosshair");

    function up(e) {
      if (e.keyCode == 18 || !e.altKey) {
        rmClass(lineDiv, "CodeMirror-crosshair");
        off(document, "keyup", up);
        off(document, "mouseover", up);
      }
    }
    on(document, "keyup", up);
    on(document, "mouseover", up);
  }

  function onKeyUp(e) {
    if (e.keyCode == 16) this.doc.sel.shift = false;
    signalDOMEvent(this, e);
  }

  function onKeyPress(e) {
    var cm = this;
    if (eventInWidget(cm.display, e) || signalDOMEvent(cm, e) || e.ctrlKey && !e.altKey || mac && e.metaKey) return;
    var keyCode = e.keyCode, charCode = e.charCode;
    if (presto && keyCode == lastStoppedKey) {lastStoppedKey = null; e_preventDefault(e); return;}
    if ((presto && (!e.which || e.which < 10)) && handleKeyBinding(cm, e)) return;
    var ch = String.fromCharCode(charCode == null ? keyCode : charCode);
    if (handleCharBinding(cm, e, ch)) return;
    cm.display.input.onKeyPress(e);
  }

  // FOCUS/BLUR EVENTS

  function delayBlurEvent(cm) {
    cm.state.delayingBlurEvent = true;
    setTimeout(function() {
      if (cm.state.delayingBlurEvent) {
        cm.state.delayingBlurEvent = false;
        onBlur(cm);
      }
    }, 100);
  }

  function onFocus(cm) {
    if (cm.state.delayingBlurEvent) cm.state.delayingBlurEvent = false;

    if (cm.options.readOnly == "nocursor") return;
    if (!cm.state.focused) {
      signal(cm, "focus", cm);
      cm.state.focused = true;
      addClass(cm.display.wrapper, "CodeMirror-focused");
      // This test prevents this from firing when a context
      // menu is closed (since the input reset would kill the
      // select-all detection hack)
      if (!cm.curOp && cm.display.selForContextMenu != cm.doc.sel) {
        cm.display.input.reset();
        if (webkit) setTimeout(function() { cm.display.input.reset(true); }, 20); // Issue #1730
      }
      cm.display.input.receivedFocus();
    }
    restartBlink(cm);
  }
  function onBlur(cm) {
    if (cm.state.delayingBlurEvent) return;

    if (cm.state.focused) {
      signal(cm, "blur", cm);
      cm.state.focused = false;
      rmClass(cm.display.wrapper, "CodeMirror-focused");
    }
    clearInterval(cm.display.blinker);
    setTimeout(function() {if (!cm.state.focused) cm.display.shift = false;}, 150);
  }

  // CONTEXT MENU HANDLING

  // To make the context menu work, we need to briefly unhide the
  // textarea (making it as unobtrusive as possible) to let the
  // right-click take effect on it.
  function onContextMenu(cm, e) {
    if (eventInWidget(cm.display, e) || contextMenuInGutter(cm, e)) return;
    cm.display.input.onContextMenu(e);
  }

  function contextMenuInGutter(cm, e) {
    if (!hasHandler(cm, "gutterContextMenu")) return false;
    return gutterEvent(cm, e, "gutterContextMenu", false, signal);
  }

  // UPDATING

  // Compute the position of the end of a change (its 'to' property
  // refers to the pre-change end).
  var changeEnd = CodeMirror.changeEnd = function(change) {
    if (!change.text) return change.to;
    return Pos(change.from.line + change.text.length - 1,
               lst(change.text).length + (change.text.length == 1 ? change.from.ch : 0));
  };

  // Adjust a position to refer to the post-change position of the
  // same text, or the end of the change if the change covers it.
  function adjustForChange(pos, change) {
    if (cmp(pos, change.from) < 0) return pos;
    if (cmp(pos, change.to) <= 0) return changeEnd(change);

    var line = pos.line + change.text.length - (change.to.line - change.from.line) - 1, ch = pos.ch;
    if (pos.line == change.to.line) ch += changeEnd(change).ch - change.to.ch;
    return Pos(line, ch);
  }

  function computeSelAfterChange(doc, change) {
    var out = [];
    for (var i = 0; i < doc.sel.ranges.length; i++) {
      var range = doc.sel.ranges[i];
      out.push(new Range(adjustForChange(range.anchor, change),
                         adjustForChange(range.head, change)));
    }
    return normalizeSelection(out, doc.sel.primIndex);
  }

  function offsetPos(pos, old, nw) {
    if (pos.line == old.line)
      return Pos(nw.line, pos.ch - old.ch + nw.ch);
    else
      return Pos(nw.line + (pos.line - old.line), pos.ch);
  }

  // Used by replaceSelections to allow moving the selection to the
  // start or around the replaced test. Hint may be "start" or "around".
  function computeReplacedSel(doc, changes, hint) {
    var out = [];
    var oldPrev = Pos(doc.first, 0), newPrev = oldPrev;
    for (var i = 0; i < changes.length; i++) {
      var change = changes[i];
      var from = offsetPos(change.from, oldPrev, newPrev);
      var to = offsetPos(changeEnd(change), oldPrev, newPrev);
      oldPrev = change.to;
      newPrev = to;
      if (hint == "around") {
        var range = doc.sel.ranges[i], inv = cmp(range.head, range.anchor) < 0;
        out[i] = new Range(inv ? to : from, inv ? from : to);
      } else {
        out[i] = new Range(from, from);
      }
    }
    return new Selection(out, doc.sel.primIndex);
  }

  // Allow "beforeChange" event handlers to influence a change
  function filterChange(doc, change, update) {
    var obj = {
      canceled: false,
      from: change.from,
      to: change.to,
      text: change.text,
      origin: change.origin,
      cancel: function() { this.canceled = true; }
    };
    if (update) obj.update = function(from, to, text, origin) {
      if (from) this.from = clipPos(doc, from);
      if (to) this.to = clipPos(doc, to);
      if (text) this.text = text;
      if (origin !== undefined) this.origin = origin;
    };
    signal(doc, "beforeChange", doc, obj);
    if (doc.cm) signal(doc.cm, "beforeChange", doc.cm, obj);

    if (obj.canceled) return null;
    return {from: obj.from, to: obj.to, text: obj.text, origin: obj.origin};
  }

  // Apply a change to a document, and add it to the document's
  // history, and propagating it to all linked documents.
  function makeChange(doc, change, ignoreReadOnly) {
    if (doc.cm) {
      if (!doc.cm.curOp) return operation(doc.cm, makeChange)(doc, change, ignoreReadOnly);
      if (doc.cm.state.suppressEdits) return;
    }

    if (hasHandler(doc, "beforeChange") || doc.cm && hasHandler(doc.cm, "beforeChange")) {
      change = filterChange(doc, change, true);
      if (!change) return;
    }

    // Possibly split or suppress the update based on the presence
    // of read-only spans in its range.
    var split = sawReadOnlySpans && !ignoreReadOnly && removeReadOnlyRanges(doc, change.from, change.to);
    if (split) {
      for (var i = split.length - 1; i >= 0; --i)
        makeChangeInner(doc, {from: split[i].from, to: split[i].to, text: i ? [""] : change.text});
    } else {
      makeChangeInner(doc, change);
    }
  }

  function makeChangeInner(doc, change) {
    if (change.text.length == 1 && change.text[0] == "" && cmp(change.from, change.to) == 0) return;
    var selAfter = computeSelAfterChange(doc, change);
    addChangeToHistory(doc, change, selAfter, doc.cm ? doc.cm.curOp.id : NaN);

    makeChangeSingleDoc(doc, change, selAfter, stretchSpansOverChange(doc, change));
    var rebased = [];

    linkedDocs(doc, function(doc, sharedHist) {
      if (!sharedHist && indexOf(rebased, doc.history) == -1) {
        rebaseHist(doc.history, change);
        rebased.push(doc.history);
      }
      makeChangeSingleDoc(doc, change, null, stretchSpansOverChange(doc, change));
    });
  }

  // Revert a change stored in a document's history.
  function makeChangeFromHistory(doc, type, allowSelectionOnly) {
    if (doc.cm && doc.cm.state.suppressEdits) return;

    var hist = doc.history, event, selAfter = doc.sel;
    var source = type == "undo" ? hist.done : hist.undone, dest = type == "undo" ? hist.undone : hist.done;

    // Verify that there is a useable event (so that ctrl-z won't
    // needlessly clear selection events)
    for (var i = 0; i < source.length; i++) {
      event = source[i];
      if (allowSelectionOnly ? event.ranges && !event.equals(doc.sel) : !event.ranges)
        break;
    }
    if (i == source.length) return;
    hist.lastOrigin = hist.lastSelOrigin = null;

    for (;;) {
      event = source.pop();
      if (event.ranges) {
        pushSelectionToHistory(event, dest);
        if (allowSelectionOnly && !event.equals(doc.sel)) {
          setSelection(doc, event, {clearRedo: false});
          return;
        }
        selAfter = event;
      }
      else break;
    }

    // Build up a reverse change object to add to the opposite history
    // stack (redo when undoing, and vice versa).
    var antiChanges = [];
    pushSelectionToHistory(selAfter, dest);
    dest.push({changes: antiChanges, generation: hist.generation});
    hist.generation = event.generation || ++hist.maxGeneration;

    var filter = hasHandler(doc, "beforeChange") || doc.cm && hasHandler(doc.cm, "beforeChange");

    for (var i = event.changes.length - 1; i >= 0; --i) {
      var change = event.changes[i];
      change.origin = type;
      if (filter && !filterChange(doc, change, false)) {
        source.length = 0;
        return;
      }

      antiChanges.push(historyChangeFromChange(doc, change));

      var after = i ? computeSelAfterChange(doc, change) : lst(source);
      makeChangeSingleDoc(doc, change, after, mergeOldSpans(doc, change));
      if (!i && doc.cm) doc.cm.scrollIntoView({from: change.from, to: changeEnd(change)});
      var rebased = [];

      // Propagate to the linked documents
      linkedDocs(doc, function(doc, sharedHist) {
        if (!sharedHist && indexOf(rebased, doc.history) == -1) {
          rebaseHist(doc.history, change);
          rebased.push(doc.history);
        }
        makeChangeSingleDoc(doc, change, null, mergeOldSpans(doc, change));
      });
    }
  }

  // Sub-views need their line numbers shifted when text is added
  // above or below them in the parent document.
  function shiftDoc(doc, distance) {
    if (distance == 0) return;
    doc.first += distance;
    doc.sel = new Selection(map(doc.sel.ranges, function(range) {
      return new Range(Pos(range.anchor.line + distance, range.anchor.ch),
                       Pos(range.head.line + distance, range.head.ch));
    }), doc.sel.primIndex);
    if (doc.cm) {
      regChange(doc.cm, doc.first, doc.first - distance, distance);
      for (var d = doc.cm.display, l = d.viewFrom; l < d.viewTo; l++)
        regLineChange(doc.cm, l, "gutter");
    }
  }

  // More lower-level change function, handling only a single document
  // (not linked ones).
  function makeChangeSingleDoc(doc, change, selAfter, spans) {
    if (doc.cm && !doc.cm.curOp)
      return operation(doc.cm, makeChangeSingleDoc)(doc, change, selAfter, spans);

    if (change.to.line < doc.first) {
      shiftDoc(doc, change.text.length - 1 - (change.to.line - change.from.line));
      return;
    }
    if (change.from.line > doc.lastLine()) return;

    // Clip the change to the size of this doc
    if (change.from.line < doc.first) {
      var shift = change.text.length - 1 - (doc.first - change.from.line);
      shiftDoc(doc, shift);
      change = {from: Pos(doc.first, 0), to: Pos(change.to.line + shift, change.to.ch),
                text: [lst(change.text)], origin: change.origin};
    }
    var last = doc.lastLine();
    if (change.to.line > last) {
      change = {from: change.from, to: Pos(last, getLine(doc, last).text.length),
                text: [change.text[0]], origin: change.origin};
    }

    change.removed = getBetween(doc, change.from, change.to);

    if (!selAfter) selAfter = computeSelAfterChange(doc, change);
    if (doc.cm) makeChangeSingleDocInEditor(doc.cm, change, spans);
    else updateDoc(doc, change, spans);
    setSelectionNoUndo(doc, selAfter, sel_dontScroll);
  }

  // Handle the interaction of a change to a document with the editor
  // that this document is part of.
  function makeChangeSingleDocInEditor(cm, change, spans) {
    var doc = cm.doc, display = cm.display, from = change.from, to = change.to;

    var recomputeMaxLength = false, checkWidthStart = from.line;
    if (!cm.options.lineWrapping) {
      checkWidthStart = lineNo(visualLine(getLine(doc, from.line)));
      doc.iter(checkWidthStart, to.line + 1, function(line) {
        if (line == display.maxLine) {
          recomputeMaxLength = true;
          return true;
        }
      });
    }

    if (doc.sel.contains(change.from, change.to) > -1)
      signalCursorActivity(cm);

    updateDoc(doc, change, spans, estimateHeight(cm));

    if (!cm.options.lineWrapping) {
      doc.iter(checkWidthStart, from.line + change.text.length, function(line) {
        var len = lineLength(line);
        if (len > display.maxLineLength) {
          display.maxLine = line;
          display.maxLineLength = len;
          display.maxLineChanged = true;
          recomputeMaxLength = false;
        }
      });
      if (recomputeMaxLength) cm.curOp.updateMaxLine = true;
    }

    // Adjust frontier, schedule worker
    doc.frontier = Math.min(doc.frontier, from.line);
    startWorker(cm, 400);

    var lendiff = change.text.length - (to.line - from.line) - 1;
    // Remember that these lines changed, for updating the display
    if (change.full)
      regChange(cm);
    else if (from.line == to.line && change.text.length == 1 && !isWholeLineUpdate(cm.doc, change))
      regLineChange(cm, from.line, "text");
    else
      regChange(cm, from.line, to.line + 1, lendiff);

    var changesHandler = hasHandler(cm, "changes"), changeHandler = hasHandler(cm, "change");
    if (changeHandler || changesHandler) {
      var obj = {
        from: from, to: to,
        text: change.text,
        removed: change.removed,
        origin: change.origin
      };
      if (changeHandler) signalLater(cm, "change", cm, obj);
      if (changesHandler) (cm.curOp.changeObjs || (cm.curOp.changeObjs = [])).push(obj);
    }
    cm.display.selForContextMenu = null;
  }

  function replaceRange(doc, code, from, to, origin) {
    if (!to) to = from;
    if (cmp(to, from) < 0) { var tmp = to; to = from; from = tmp; }
    if (typeof code == "string") code = doc.splitLines(code);
    makeChange(doc, {from: from, to: to, text: code, origin: origin});
  }

  // SCROLLING THINGS INTO VIEW

  // If an editor sits on the top or bottom of the window, partially
  // scrolled out of view, this ensures that the cursor is visible.
  function maybeScrollWindow(cm, coords) {
    if (signalDOMEvent(cm, "scrollCursorIntoView")) return;

    var display = cm.display, box = display.sizer.getBoundingClientRect(), doScroll = null;
    if (coords.top + box.top < 0) doScroll = true;
    else if (coords.bottom + box.top > (window.innerHeight || document.documentElement.clientHeight)) doScroll = false;
    if (doScroll != null && !phantom) {
      var scrollNode = elt("div", "\u200b", null, "position: absolute; top: " +
                           (coords.top - display.viewOffset - paddingTop(cm.display)) + "px; height: " +
                           (coords.bottom - coords.top + scrollGap(cm) + display.barHeight) + "px; left: " +
                           coords.left + "px; width: 2px;");
      cm.display.lineSpace.appendChild(scrollNode);
      scrollNode.scrollIntoView(doScroll);
      cm.display.lineSpace.removeChild(scrollNode);
    }
  }

  // Scroll a given position into view (immediately), verifying that
  // it actually became visible (as line heights are accurately
  // measured, the position of something may 'drift' during drawing).
  function scrollPosIntoView(cm, pos, end, margin) {
    if (margin == null) margin = 0;
    for (var limit = 0; limit < 5; limit++) {
      var changed = false, coords = cursorCoords(cm, pos);
      var endCoords = !end || end == pos ? coords : cursorCoords(cm, end);
      var scrollPos = calculateScrollPos(cm, Math.min(coords.left, endCoords.left),
                                         Math.min(coords.top, endCoords.top) - margin,
                                         Math.max(coords.left, endCoords.left),
                                         Math.max(coords.bottom, endCoords.bottom) + margin);
      var startTop = cm.doc.scrollTop, startLeft = cm.doc.scrollLeft;
      if (scrollPos.scrollTop != null) {
        setScrollTop(cm, scrollPos.scrollTop);
        if (Math.abs(cm.doc.scrollTop - startTop) > 1) changed = true;
      }
      if (scrollPos.scrollLeft != null) {
        setScrollLeft(cm, scrollPos.scrollLeft);
        if (Math.abs(cm.doc.scrollLeft - startLeft) > 1) changed = true;
      }
      if (!changed) break;
    }
    return coords;
  }

  // Scroll a given set of coordinates into view (immediately).
  function scrollIntoView(cm, x1, y1, x2, y2) {
    var scrollPos = calculateScrollPos(cm, x1, y1, x2, y2);
    if (scrollPos.scrollTop != null) setScrollTop(cm, scrollPos.scrollTop);
    if (scrollPos.scrollLeft != null) setScrollLeft(cm, scrollPos.scrollLeft);
  }

  // Calculate a new scroll position needed to scroll the given
  // rectangle into view. Returns an object with scrollTop and
  // scrollLeft properties. When these are undefined, the
  // vertical/horizontal position does not need to be adjusted.
  function calculateScrollPos(cm, x1, y1, x2, y2) {
    var display = cm.display, snapMargin = textHeight(cm.display);
    if (y1 < 0) y1 = 0;
    var screentop = cm.curOp && cm.curOp.scrollTop != null ? cm.curOp.scrollTop : display.scroller.scrollTop;
    var screen = displayHeight(cm), result = {};
    if (y2 - y1 > screen) y2 = y1 + screen;
    var docBottom = cm.doc.height + paddingVert(display);
    var atTop = y1 < snapMargin, atBottom = y2 > docBottom - snapMargin;
    if (y1 < screentop) {
      result.scrollTop = atTop ? 0 : y1;
    } else if (y2 > screentop + screen) {
      var newTop = Math.min(y1, (atBottom ? docBottom : y2) - screen);
      if (newTop != screentop) result.scrollTop = newTop;
    }

    var screenleft = cm.curOp && cm.curOp.scrollLeft != null ? cm.curOp.scrollLeft : display.scroller.scrollLeft;
    var screenw = displayWidth(cm) - (cm.options.fixedGutter ? display.gutters.offsetWidth : 0);
    var tooWide = x2 - x1 > screenw;
    if (tooWide) x2 = x1 + screenw;
    if (x1 < 10)
      result.scrollLeft = 0;
    else if (x1 < screenleft)
      result.scrollLeft = Math.max(0, x1 - (tooWide ? 0 : 10));
    else if (x2 > screenw + screenleft - 3)
      result.scrollLeft = x2 + (tooWide ? 0 : 10) - screenw;
    return result;
  }

  // Store a relative adjustment to the scroll position in the current
  // operation (to be applied when the operation finishes).
  function addToScrollPos(cm, left, top) {
    if (left != null || top != null) resolveScrollToPos(cm);
    if (left != null)
      cm.curOp.scrollLeft = (cm.curOp.scrollLeft == null ? cm.doc.scrollLeft : cm.curOp.scrollLeft) + left;
    if (top != null)
      cm.curOp.scrollTop = (cm.curOp.scrollTop == null ? cm.doc.scrollTop : cm.curOp.scrollTop) + top;
  }

  // Make sure that at the end of the operation the current cursor is
  // shown.
  function ensureCursorVisible(cm) {
    resolveScrollToPos(cm);
    var cur = cm.getCursor(), from = cur, to = cur;
    if (!cm.options.lineWrapping) {
      from = cur.ch ? Pos(cur.line, cur.ch - 1) : cur;
      to = Pos(cur.line, cur.ch + 1);
    }
    cm.curOp.scrollToPos = {from: from, to: to, margin: cm.options.cursorScrollMargin, isCursor: true};
  }

  // When an operation has its scrollToPos property set, and another
  // scroll action is applied before the end of the operation, this
  // 'simulates' scrolling that position into view in a cheap way, so
  // that the effect of intermediate scroll commands is not ignored.
  function resolveScrollToPos(cm) {
    var range = cm.curOp.scrollToPos;
    if (range) {
      cm.curOp.scrollToPos = null;
      var from = estimateCoords(cm, range.from), to = estimateCoords(cm, range.to);
      var sPos = calculateScrollPos(cm, Math.min(from.left, to.left),
                                    Math.min(from.top, to.top) - range.margin,
                                    Math.max(from.right, to.right),
                                    Math.max(from.bottom, to.bottom) + range.margin);
      cm.scrollTo(sPos.scrollLeft, sPos.scrollTop);
    }
  }

  // API UTILITIES

  // Indent the given line. The how parameter can be "smart",
  // "add"/null, "subtract", or "prev". When aggressive is false
  // (typically set to true for forced single-line indents), empty
  // lines are not indented, and places where the mode returns Pass
  // are left alone.
  function indentLine(cm, n, how, aggressive) {
    var doc = cm.doc, state;
    if (how == null) how = "add";
    if (how == "smart") {
      // Fall back to "prev" when the mode doesn't have an indentation
      // method.
      if (!doc.mode.indent) how = "prev";
      else state = getStateBefore(cm, n);
    }

    var tabSize = cm.options.tabSize;
    var line = getLine(doc, n), curSpace = countColumn(line.text, null, tabSize);
    if (line.stateAfter) line.stateAfter = null;
    var curSpaceString = line.text.match(/^\s*/)[0], indentation;
    if (!aggressive && !/\S/.test(line.text)) {
      indentation = 0;
      how = "not";
    } else if (how == "smart") {
      indentation = doc.mode.indent(state, line.text.slice(curSpaceString.length), line.text);
      if (indentation == Pass || indentation > 150) {
        if (!aggressive) return;
        how = "prev";
      }
    }
    if (how == "prev") {
      if (n > doc.first) indentation = countColumn(getLine(doc, n-1).text, null, tabSize);
      else indentation = 0;
    } else if (how == "add") {
      indentation = curSpace + cm.options.indentUnit;
    } else if (how == "subtract") {
      indentation = curSpace - cm.options.indentUnit;
    } else if (typeof how == "number") {
      indentation = curSpace + how;
    }
    indentation = Math.max(0, indentation);

    var indentString = "", pos = 0;
    if (cm.options.indentWithTabs)
      for (var i = Math.floor(indentation / tabSize); i; --i) {pos += tabSize; indentString += "\t";}
    if (pos < indentation) indentString += spaceStr(indentation - pos);

    if (indentString != curSpaceString) {
      replaceRange(doc, indentString, Pos(n, 0), Pos(n, curSpaceString.length), "+input");
      line.stateAfter = null;
      return true;
    } else {
      // Ensure that, if the cursor was in the whitespace at the start
      // of the line, it is moved to the end of that space.
      for (var i = 0; i < doc.sel.ranges.length; i++) {
        var range = doc.sel.ranges[i];
        if (range.head.line == n && range.head.ch < curSpaceString.length) {
          var pos = Pos(n, curSpaceString.length);
          replaceOneSelection(doc, i, new Range(pos, pos));
          break;
        }
      }
    }
  }

  // Utility for applying a change to a line by handle or number,
  // returning the number and optionally registering the line as
  // changed.
  function changeLine(doc, handle, changeType, op) {
    var no = handle, line = handle;
    if (typeof handle == "number") line = getLine(doc, clipLine(doc, handle));
    else no = lineNo(handle);
    if (no == null) return null;
    if (op(line, no) && doc.cm) regLineChange(doc.cm, no, changeType);
    return line;
  }

  // Helper for deleting text near the selection(s), used to implement
  // backspace, delete, and similar functionality.
  function deleteNearSelection(cm, compute) {
    var ranges = cm.doc.sel.ranges, kill = [];
    // Build up a set of ranges to kill first, merging overlapping
    // ranges.
    for (var i = 0; i < ranges.length; i++) {
      var toKill = compute(ranges[i]);
      while (kill.length && cmp(toKill.from, lst(kill).to) <= 0) {
        var replaced = kill.pop();
        if (cmp(replaced.from, toKill.from) < 0) {
          toKill.from = replaced.from;
          break;
        }
      }
      kill.push(toKill);
    }
    // Next, remove those actual ranges.
    runInOp(cm, function() {
      for (var i = kill.length - 1; i >= 0; i--)
        replaceRange(cm.doc, "", kill[i].from, kill[i].to, "+delete");
      ensureCursorVisible(cm);
    });
  }

  // Used for horizontal relative motion. Dir is -1 or 1 (left or
  // right), unit can be "char", "column" (like char, but doesn't
  // cross line boundaries), "word" (across next word), or "group" (to
  // the start of next group of word or non-word-non-whitespace
  // chars). The visually param controls whether, in right-to-left
  // text, direction 1 means to move towards the next index in the
  // string, or towards the character to the right of the current
  // position. The resulting position will have a hitSide=true
  // property if it reached the end of the document.
  function findPosH(doc, pos, dir, unit, visually) {
    var line = pos.line, ch = pos.ch, origDir = dir;
    var lineObj = getLine(doc, line);
    var possible = true;
    function findNextLine() {
      var l = line + dir;
      if (l < doc.first || l >= doc.first + doc.size) return (possible = false);
      line = l;
      return lineObj = getLine(doc, l);
    }
    function moveOnce(boundToLine) {
      var next = (visually ? moveVisually : moveLogically)(lineObj, ch, dir, true);
      if (next == null) {
        if (!boundToLine && findNextLine()) {
          if (visually) ch = (dir < 0 ? lineRight : lineLeft)(lineObj);
          else ch = dir < 0 ? lineObj.text.length : 0;
        } else return (possible = false);
      } else ch = next;
      return true;
    }

    if (unit == "char") moveOnce();
    else if (unit == "column") moveOnce(true);
    else if (unit == "word" || unit == "group") {
      var sawType = null, group = unit == "group";
      var helper = doc.cm && doc.cm.getHelper(pos, "wordChars");
      for (var first = true;; first = false) {
        if (dir < 0 && !moveOnce(!first)) break;
        var cur = lineObj.text.charAt(ch) || "\n";
        var type = isWordChar(cur, helper) ? "w"
          : group && cur == "\n" ? "n"
          : !group || /\s/.test(cur) ? null
          : "p";
        if (group && !first && !type) type = "s";
        if (sawType && sawType != type) {
          if (dir < 0) {dir = 1; moveOnce();}
          break;
        }

        if (type) sawType = type;
        if (dir > 0 && !moveOnce(!first)) break;
      }
    }
    var result = skipAtomic(doc, Pos(line, ch), origDir, true);
    if (!possible) result.hitSide = true;
    return result;
  }

  // For relative vertical movement. Dir may be -1 or 1. Unit can be
  // "page" or "line". The resulting position will have a hitSide=true
  // property if it reached the end of the document.
  function findPosV(cm, pos, dir, unit) {
    var doc = cm.doc, x = pos.left, y;
    if (unit == "page") {
      var pageSize = Math.min(cm.display.wrapper.clientHeight, window.innerHeight || document.documentElement.clientHeight);
      y = pos.top + dir * (pageSize - (dir < 0 ? 1.5 : .5) * textHeight(cm.display));
    } else if (unit == "line") {
      y = dir > 0 ? pos.bottom + 3 : pos.top - 3;
    }
    for (;;) {
      var target = coordsChar(cm, x, y);
      if (!target.outside) break;
      if (dir < 0 ? y <= 0 : y >= doc.height) { target.hitSide = true; break; }
      y += dir * 5;
    }
    return target;
  }

  // EDITOR METHODS

  // The publicly visible API. Note that methodOp(f) means
  // 'wrap f in an operation, performed on its `this` parameter'.

  // This is not the complete set of editor methods. Most of the
  // methods defined on the Doc type are also injected into
  // CodeMirror.prototype, for backwards compatibility and
  // convenience.

  CodeMirror.prototype = {
    constructor: CodeMirror,
    focus: function(){window.focus(); this.display.input.focus();},

    setOption: function(option, value) {
      var options = this.options, old = options[option];
      if (options[option] == value && option != "mode") return;
      options[option] = value;
      if (optionHandlers.hasOwnProperty(option))
        operation(this, optionHandlers[option])(this, value, old);
    },

    getOption: function(option) {return this.options[option];},
    getDoc: function() {return this.doc;},

    addKeyMap: function(map, bottom) {
      this.state.keyMaps[bottom ? "push" : "unshift"](getKeyMap(map));
    },
    removeKeyMap: function(map) {
      var maps = this.state.keyMaps;
      for (var i = 0; i < maps.length; ++i)
        if (maps[i] == map || maps[i].name == map) {
          maps.splice(i, 1);
          return true;
        }
    },

    addOverlay: methodOp(function(spec, options) {
      var mode = spec.token ? spec : CodeMirror.getMode(this.options, spec);
      if (mode.startState) throw new Error("Overlays may not be stateful.");
      this.state.overlays.push({mode: mode, modeSpec: spec, opaque: options && options.opaque});
      this.state.modeGen++;
      regChange(this);
    }),
    removeOverlay: methodOp(function(spec) {
      var overlays = this.state.overlays;
      for (var i = 0; i < overlays.length; ++i) {
        var cur = overlays[i].modeSpec;
        if (cur == spec || typeof spec == "string" && cur.name == spec) {
          overlays.splice(i, 1);
          this.state.modeGen++;
          regChange(this);
          return;
        }
      }
    }),

    indentLine: methodOp(function(n, dir, aggressive) {
      if (typeof dir != "string" && typeof dir != "number") {
        if (dir == null) dir = this.options.smartIndent ? "smart" : "prev";
        else dir = dir ? "add" : "subtract";
      }
      if (isLine(this.doc, n)) indentLine(this, n, dir, aggressive);
    }),
    indentSelection: methodOp(function(how) {
      var ranges = this.doc.sel.ranges, end = -1;
      for (var i = 0; i < ranges.length; i++) {
        var range = ranges[i];
        if (!range.empty()) {
          var from = range.from(), to = range.to();
          var start = Math.max(end, from.line);
          end = Math.min(this.lastLine(), to.line - (to.ch ? 0 : 1)) + 1;
          for (var j = start; j < end; ++j)
            indentLine(this, j, how);
          var newRanges = this.doc.sel.ranges;
          if (from.ch == 0 && ranges.length == newRanges.length && newRanges[i].from().ch > 0)
            replaceOneSelection(this.doc, i, new Range(from, newRanges[i].to()), sel_dontScroll);
        } else if (range.head.line > end) {
          indentLine(this, range.head.line, how, true);
          end = range.head.line;
          if (i == this.doc.sel.primIndex) ensureCursorVisible(this);
        }
      }
    }),

    // Fetch the parser token for a given character. Useful for hacks
    // that want to inspect the mode state (say, for completion).
    getTokenAt: function(pos, precise) {
      return takeToken(this, pos, precise);
    },

    getLineTokens: function(line, precise) {
      return takeToken(this, Pos(line), precise, true);
    },

    getTokenTypeAt: function(pos) {
      pos = clipPos(this.doc, pos);
      var styles = getLineStyles(this, getLine(this.doc, pos.line));
      var before = 0, after = (styles.length - 1) / 2, ch = pos.ch;
      var type;
      if (ch == 0) type = styles[2];
      else for (;;) {
        var mid = (before + after) >> 1;
        if ((mid ? styles[mid * 2 - 1] : 0) >= ch) after = mid;
        else if (styles[mid * 2 + 1] < ch) before = mid + 1;
        else { type = styles[mid * 2 + 2]; break; }
      }
      var cut = type ? type.indexOf("cm-overlay ") : -1;
      return cut < 0 ? type : cut == 0 ? null : type.slice(0, cut - 1);
    },

    getModeAt: function(pos) {
      var mode = this.doc.mode;
      if (!mode.innerMode) return mode;
      return CodeMirror.innerMode(mode, this.getTokenAt(pos).state).mode;
    },

    getHelper: function(pos, type) {
      return this.getHelpers(pos, type)[0];
    },

    getHelpers: function(pos, type) {
      var found = [];
      if (!helpers.hasOwnProperty(type)) return found;
      var help = helpers[type], mode = this.getModeAt(pos);
      if (typeof mode[type] == "string") {
        if (help[mode[type]]) found.push(help[mode[type]]);
      } else if (mode[type]) {
        for (var i = 0; i < mode[type].length; i++) {
          var val = help[mode[type][i]];
          if (val) found.push(val);
        }
      } else if (mode.helperType && help[mode.helperType]) {
        found.push(help[mode.helperType]);
      } else if (help[mode.name]) {
        found.push(help[mode.name]);
      }
      for (var i = 0; i < help._global.length; i++) {
        var cur = help._global[i];
        if (cur.pred(mode, this) && indexOf(found, cur.val) == -1)
          found.push(cur.val);
      }
      return found;
    },

    getStateAfter: function(line, precise) {
      var doc = this.doc;
      line = clipLine(doc, line == null ? doc.first + doc.size - 1: line);
      return getStateBefore(this, line + 1, precise);
    },

    cursorCoords: function(start, mode) {
      var pos, range = this.doc.sel.primary();
      if (start == null) pos = range.head;
      else if (typeof start == "object") pos = clipPos(this.doc, start);
      else pos = start ? range.from() : range.to();
      return cursorCoords(this, pos, mode || "page");
    },

    charCoords: function(pos, mode) {
      return charCoords(this, clipPos(this.doc, pos), mode || "page");
    },

    coordsChar: function(coords, mode) {
      coords = fromCoordSystem(this, coords, mode || "page");
      return coordsChar(this, coords.left, coords.top);
    },

    lineAtHeight: function(height, mode) {
      height = fromCoordSystem(this, {top: height, left: 0}, mode || "page").top;
      return lineAtHeight(this.doc, height + this.display.viewOffset);
    },
    heightAtLine: function(line, mode) {
      var end = false, lineObj;
      if (typeof line == "number") {
        var last = this.doc.first + this.doc.size - 1;
        if (line < this.doc.first) line = this.doc.first;
        else if (line > last) { line = last; end = true; }
        lineObj = getLine(this.doc, line);
      } else {
        lineObj = line;
      }
      return intoCoordSystem(this, lineObj, {top: 0, left: 0}, mode || "page").top +
        (end ? this.doc.height - heightAtLine(lineObj) : 0);
    },

    defaultTextHeight: function() { return textHeight(this.display); },
    defaultCharWidth: function() { return charWidth(this.display); },

    setGutterMarker: methodOp(function(line, gutterID, value) {
      return changeLine(this.doc, line, "gutter", function(line) {
        var markers = line.gutterMarkers || (line.gutterMarkers = {});
        markers[gutterID] = value;
        if (!value && isEmpty(markers)) line.gutterMarkers = null;
        return true;
      });
    }),

    clearGutter: methodOp(function(gutterID) {
      var cm = this, doc = cm.doc, i = doc.first;
      doc.iter(function(line) {
        if (line.gutterMarkers && line.gutterMarkers[gutterID]) {
          line.gutterMarkers[gutterID] = null;
          regLineChange(cm, i, "gutter");
          if (isEmpty(line.gutterMarkers)) line.gutterMarkers = null;
        }
        ++i;
      });
    }),

    lineInfo: function(line) {
      if (typeof line == "number") {
        if (!isLine(this.doc, line)) return null;
        var n = line;
        line = getLine(this.doc, line);
        if (!line) return null;
      } else {
        var n = lineNo(line);
        if (n == null) return null;
      }
      return {line: n, handle: line, text: line.text, gutterMarkers: line.gutterMarkers,
              textClass: line.textClass, bgClass: line.bgClass, wrapClass: line.wrapClass,
              widgets: line.widgets};
    },

    getViewport: function() { return {from: this.display.viewFrom, to: this.display.viewTo};},

    addWidget: function(pos, node, scroll, vert, horiz) {
      var display = this.display;
      pos = cursorCoords(this, clipPos(this.doc, pos));
      var top = pos.bottom, left = pos.left;
      node.style.position = "absolute";
      node.setAttribute("cm-ignore-events", "true");
      this.display.input.setUneditable(node);
      display.sizer.appendChild(node);
      if (vert == "over") {
        top = pos.top;
      } else if (vert == "above" || vert == "near") {
        var vspace = Math.max(display.wrapper.clientHeight, this.doc.height),
        hspace = Math.max(display.sizer.clientWidth, display.lineSpace.clientWidth);
        // Default to positioning above (if specified and possible); otherwise default to positioning below
        if ((vert == 'above' || pos.bottom + node.offsetHeight > vspace) && pos.top > node.offsetHeight)
          top = pos.top - node.offsetHeight;
        else if (pos.bottom + node.offsetHeight <= vspace)
          top = pos.bottom;
        if (left + node.offsetWidth > hspace)
          left = hspace - node.offsetWidth;
      }
      node.style.top = top + "px";
      node.style.left = node.style.right = "";
      if (horiz == "right") {
        left = display.sizer.clientWidth - node.offsetWidth;
        node.style.right = "0px";
      } else {
        if (horiz == "left") left = 0;
        else if (horiz == "middle") left = (display.sizer.clientWidth - node.offsetWidth) / 2;
        node.style.left = left + "px";
      }
      if (scroll)
        scrollIntoView(this, left, top, left + node.offsetWidth, top + node.offsetHeight);
    },

    triggerOnKeyDown: methodOp(onKeyDown),
    triggerOnKeyPress: methodOp(onKeyPress),
    triggerOnKeyUp: onKeyUp,

    execCommand: function(cmd) {
      if (commands.hasOwnProperty(cmd))
        return commands[cmd].call(null, this);
    },

    triggerElectric: methodOp(function(text) { triggerElectric(this, text); }),

    findPosH: function(from, amount, unit, visually) {
      var dir = 1;
      if (amount < 0) { dir = -1; amount = -amount; }
      for (var i = 0, cur = clipPos(this.doc, from); i < amount; ++i) {
        cur = findPosH(this.doc, cur, dir, unit, visually);
        if (cur.hitSide) break;
      }
      return cur;
    },

    moveH: methodOp(function(dir, unit) {
      var cm = this;
      cm.extendSelectionsBy(function(range) {
        if (cm.display.shift || cm.doc.extend || range.empty())
          return findPosH(cm.doc, range.head, dir, unit, cm.options.rtlMoveVisually);
        else
          return dir < 0 ? range.from() : range.to();
      }, sel_move);
    }),

    deleteH: methodOp(function(dir, unit) {
      var sel = this.doc.sel, doc = this.doc;
      if (sel.somethingSelected())
        doc.replaceSelection("", null, "+delete");
      else
        deleteNearSelection(this, function(range) {
          var other = findPosH(doc, range.head, dir, unit, false);
          return dir < 0 ? {from: other, to: range.head} : {from: range.head, to: other};
        });
    }),

    findPosV: function(from, amount, unit, goalColumn) {
      var dir = 1, x = goalColumn;
      if (amount < 0) { dir = -1; amount = -amount; }
      for (var i = 0, cur = clipPos(this.doc, from); i < amount; ++i) {
        var coords = cursorCoords(this, cur, "div");
        if (x == null) x = coords.left;
        else coords.left = x;
        cur = findPosV(this, coords, dir, unit);
        if (cur.hitSide) break;
      }
      return cur;
    },

    moveV: methodOp(function(dir, unit) {
      var cm = this, doc = this.doc, goals = [];
      var collapse = !cm.display.shift && !doc.extend && doc.sel.somethingSelected();
      doc.extendSelectionsBy(function(range) {
        if (collapse)
          return dir < 0 ? range.from() : range.to();
        var headPos = cursorCoords(cm, range.head, "div");
        if (range.goalColumn != null) headPos.left = range.goalColumn;
        goals.push(headPos.left);
        var pos = findPosV(cm, headPos, dir, unit);
        if (unit == "page" && range == doc.sel.primary())
          addToScrollPos(cm, null, charCoords(cm, pos, "div").top - headPos.top);
        return pos;
      }, sel_move);
      if (goals.length) for (var i = 0; i < doc.sel.ranges.length; i++)
        doc.sel.ranges[i].goalColumn = goals[i];
    }),

    // Find the word at the given position (as returned by coordsChar).
    findWordAt: function(pos) {
      var doc = this.doc, line = getLine(doc, pos.line).text;
      var start = pos.ch, end = pos.ch;
      if (line) {
        var helper = this.getHelper(pos, "wordChars");
        if ((pos.xRel < 0 || end == line.length) && start) --start; else ++end;
        var startChar = line.charAt(start);
        var check = isWordChar(startChar, helper)
          ? function(ch) { return isWordChar(ch, helper); }
          : /\s/.test(startChar) ? function(ch) {return /\s/.test(ch);}
          : function(ch) {return !/\s/.test(ch) && !isWordChar(ch);};
        while (start > 0 && check(line.charAt(start - 1))) --start;
        while (end < line.length && check(line.charAt(end))) ++end;
      }
      return new Range(Pos(pos.line, start), Pos(pos.line, end));
    },

    toggleOverwrite: function(value) {
      if (value != null && value == this.state.overwrite) return;
      if (this.state.overwrite = !this.state.overwrite)
        addClass(this.display.cursorDiv, "CodeMirror-overwrite");
      else
        rmClass(this.display.cursorDiv, "CodeMirror-overwrite");

      signal(this, "overwriteToggle", this, this.state.overwrite);
    },
    hasFocus: function() { return this.display.input.getField() == activeElt(); },

    scrollTo: methodOp(function(x, y) {
      if (x != null || y != null) resolveScrollToPos(this);
      if (x != null) this.curOp.scrollLeft = x;
      if (y != null) this.curOp.scrollTop = y;
    }),
    getScrollInfo: function() {
      var scroller = this.display.scroller;
      return {left: scroller.scrollLeft, top: scroller.scrollTop,
              height: scroller.scrollHeight - scrollGap(this) - this.display.barHeight,
              width: scroller.scrollWidth - scrollGap(this) - this.display.barWidth,
              clientHeight: displayHeight(this), clientWidth: displayWidth(this)};
    },

    scrollIntoView: methodOp(function(range, margin) {
      if (range == null) {
        range = {from: this.doc.sel.primary().head, to: null};
        if (margin == null) margin = this.options.cursorScrollMargin;
      } else if (typeof range == "number") {
        range = {from: Pos(range, 0), to: null};
      } else if (range.from == null) {
        range = {from: range, to: null};
      }
      if (!range.to) range.to = range.from;
      range.margin = margin || 0;

      if (range.from.line != null) {
        resolveScrollToPos(this);
        this.curOp.scrollToPos = range;
      } else {
        var sPos = calculateScrollPos(this, Math.min(range.from.left, range.to.left),
                                      Math.min(range.from.top, range.to.top) - range.margin,
                                      Math.max(range.from.right, range.to.right),
                                      Math.max(range.from.bottom, range.to.bottom) + range.margin);
        this.scrollTo(sPos.scrollLeft, sPos.scrollTop);
      }
    }),

    setSize: methodOp(function(width, height) {
      var cm = this;
      function interpret(val) {
        return typeof val == "number" || /^\d+$/.test(String(val)) ? val + "px" : val;
      }
      if (width != null) cm.display.wrapper.style.width = interpret(width);
      if (height != null) cm.display.wrapper.style.height = interpret(height);
      if (cm.options.lineWrapping) clearLineMeasurementCache(this);
      var lineNo = cm.display.viewFrom;
      cm.doc.iter(lineNo, cm.display.viewTo, function(line) {
        if (line.widgets) for (var i = 0; i < line.widgets.length; i++)
          if (line.widgets[i].noHScroll) { regLineChange(cm, lineNo, "widget"); break; }
        ++lineNo;
      });
      cm.curOp.forceUpdate = true;
      signal(cm, "refresh", this);
    }),

    operation: function(f){return runInOp(this, f);},

    refresh: methodOp(function() {
      var oldHeight = this.display.cachedTextHeight;
      regChange(this);
      this.curOp.forceUpdate = true;
      clearCaches(this);
      this.scrollTo(this.doc.scrollLeft, this.doc.scrollTop);
      updateGutterSpace(this);
      if (oldHeight == null || Math.abs(oldHeight - textHeight(this.display)) > .5)
        estimateLineHeights(this);
      signal(this, "refresh", this);
    }),

    swapDoc: methodOp(function(doc) {
      var old = this.doc;
      old.cm = null;
      attachDoc(this, doc);
      clearCaches(this);
      this.display.input.reset();
      this.scrollTo(doc.scrollLeft, doc.scrollTop);
      this.curOp.forceScroll = true;
      signalLater(this, "swapDoc", this, old);
      return old;
    }),

    getInputField: function(){return this.display.input.getField();},
    getWrapperElement: function(){return this.display.wrapper;},
    getScrollerElement: function(){return this.display.scroller;},
    getGutterElement: function(){return this.display.gutters;}
  };
  eventMixin(CodeMirror);

  // OPTION DEFAULTS

  // The default configuration options.
  var defaults = CodeMirror.defaults = {};
  // Functions to run when options are changed.
  var optionHandlers = CodeMirror.optionHandlers = {};

  function option(name, deflt, handle, notOnInit) {
    CodeMirror.defaults[name] = deflt;
    if (handle) optionHandlers[name] =
      notOnInit ? function(cm, val, old) {if (old != Init) handle(cm, val, old);} : handle;
  }

  // Passed to option handlers when there is no old value.
  var Init = CodeMirror.Init = {toString: function(){return "CodeMirror.Init";}};

  // These two are, on init, called from the constructor because they
  // have to be initialized before the editor can start at all.
  option("value", "", function(cm, val) {
    cm.setValue(val);
  }, true);
  option("mode", null, function(cm, val) {
    cm.doc.modeOption = val;
    loadMode(cm);
  }, true);

  option("indentUnit", 2, loadMode, true);
  option("indentWithTabs", false);
  option("smartIndent", true);
  option("tabSize", 4, function(cm) {
    resetModeState(cm);
    clearCaches(cm);
    regChange(cm);
  }, true);
  option("lineSeparator", null, function(cm, val) {
    cm.doc.lineSep = val;
    if (!val) return;
    var newBreaks = [], lineNo = cm.doc.first;
    cm.doc.iter(function(line) {
      for (var pos = 0;;) {
        var found = line.text.indexOf(val, pos);
        if (found == -1) break;
        pos = found + val.length;
        newBreaks.push(Pos(lineNo, found));
      }
      lineNo++;
    });
    for (var i = newBreaks.length - 1; i >= 0; i--)
      replaceRange(cm.doc, val, newBreaks[i], Pos(newBreaks[i].line, newBreaks[i].ch + val.length))
  });
  option("specialChars", /[\t\u0000-\u0019\u00ad\u200b-\u200f\u2028\u2029\ufeff]/g, function(cm, val, old) {
    cm.state.specialChars = new RegExp(val.source + (val.test("\t") ? "" : "|\t"), "g");
    if (old != CodeMirror.Init) cm.refresh();
  });
  option("specialCharPlaceholder", defaultSpecialCharPlaceholder, function(cm) {cm.refresh();}, true);
  option("electricChars", true);
  option("inputStyle", mobile ? "contenteditable" : "textarea", function() {
    throw new Error("inputStyle can not (yet) be changed in a running editor"); // FIXME
  }, true);
  option("rtlMoveVisually", !windows);
  option("wholeLineUpdateBefore", true);

  option("theme", "default", function(cm) {
    themeChanged(cm);
    guttersChanged(cm);
  }, true);
  option("keyMap", "default", function(cm, val, old) {
    var next = getKeyMap(val);
    var prev = old != CodeMirror.Init && getKeyMap(old);
    if (prev && prev.detach) prev.detach(cm, next);
    if (next.attach) next.attach(cm, prev || null);
  });
  option("extraKeys", null);

  option("lineWrapping", false, wrappingChanged, true);
  option("gutters", [], function(cm) {
    setGuttersForLineNumbers(cm.options);
    guttersChanged(cm);
  }, true);
  option("fixedGutter", true, function(cm, val) {
    cm.display.gutters.style.left = val ? compensateForHScroll(cm.display) + "px" : "0";
    cm.refresh();
  }, true);
  option("coverGutterNextToScrollbar", false, function(cm) {updateScrollbars(cm);}, true);
  option("scrollbarStyle", "native", function(cm) {
    initScrollbars(cm);
    updateScrollbars(cm);
    cm.display.scrollbars.setScrollTop(cm.doc.scrollTop);
    cm.display.scrollbars.setScrollLeft(cm.doc.scrollLeft);
  }, true);
  option("lineNumbers", false, function(cm) {
    setGuttersForLineNumbers(cm.options);
    guttersChanged(cm);
  }, true);
  option("firstLineNumber", 1, guttersChanged, true);
  option("lineNumberFormatter", function(integer) {return integer;}, guttersChanged, true);
  option("showCursorWhenSelecting", false, updateSelection, true);

  option("resetSelectionOnContextMenu", true);
  option("lineWiseCopyCut", true);

  option("readOnly", false, function(cm, val) {
    if (val == "nocursor") {
      onBlur(cm);
      cm.display.input.blur();
      cm.display.disabled = true;
    } else {
      cm.display.disabled = false;
      if (!val) cm.display.input.reset();
    }
  });
  option("disableInput", false, function(cm, val) {if (!val) cm.display.input.reset();}, true);
  option("dragDrop", true, dragDropChanged);

  option("cursorBlinkRate", 530);
  option("cursorScrollMargin", 0);
  option("cursorHeight", 1, updateSelection, true);
  option("singleCursorHeightPerLine", true, updateSelection, true);
  option("workTime", 100);
  option("workDelay", 100);
  option("flattenSpans", true, resetModeState, true);
  option("addModeClass", false, resetModeState, true);
  option("pollInterval", 100);
  option("undoDepth", 200, function(cm, val){cm.doc.history.undoDepth = val;});
  option("historyEventDelay", 1250);
  option("viewportMargin", 10, function(cm){cm.refresh();}, true);
  option("maxHighlightLength", 10000, resetModeState, true);
  option("moveInputWithCursor", true, function(cm, val) {
    if (!val) cm.display.input.resetPosition();
  });

  option("tabindex", null, function(cm, val) {
    cm.display.input.getField().tabIndex = val || "";
  });
  option("autofocus", null);

  // MODE DEFINITION AND QUERYING

  // Known modes, by name and by MIME
  var modes = CodeMirror.modes = {}, mimeModes = CodeMirror.mimeModes = {};

  // Extra arguments are stored as the mode's dependencies, which is
  // used by (legacy) mechanisms like loadmode.js to automatically
  // load a mode. (Preferred mechanism is the require/define calls.)
  CodeMirror.defineMode = function(name, mode) {
    if (!CodeMirror.defaults.mode && name != "null") CodeMirror.defaults.mode = name;
    if (arguments.length > 2)
      mode.dependencies = Array.prototype.slice.call(arguments, 2);
    modes[name] = mode;
  };

  CodeMirror.defineMIME = function(mime, spec) {
    mimeModes[mime] = spec;
  };

  // Given a MIME type, a {name, ...options} config object, or a name
  // string, return a mode config object.
  CodeMirror.resolveMode = function(spec) {
    if (typeof spec == "string" && mimeModes.hasOwnProperty(spec)) {
      spec = mimeModes[spec];
    } else if (spec && typeof spec.name == "string" && mimeModes.hasOwnProperty(spec.name)) {
      var found = mimeModes[spec.name];
      if (typeof found == "string") found = {name: found};
      spec = createObj(found, spec);
      spec.name = found.name;
    } else if (typeof spec == "string" && /^[\w\-]+\/[\w\-]+\+xml$/.test(spec)) {
      return CodeMirror.resolveMode("application/xml");
    }
    if (typeof spec == "string") return {name: spec};
    else return spec || {name: "null"};
  };

  // Given a mode spec (anything that resolveMode accepts), find and
  // initialize an actual mode object.
  CodeMirror.getMode = function(options, spec) {
    var spec = CodeMirror.resolveMode(spec);
    var mfactory = modes[spec.name];
    if (!mfactory) return CodeMirror.getMode(options, "text/plain");
    var modeObj = mfactory(options, spec);
    if (modeExtensions.hasOwnProperty(spec.name)) {
      var exts = modeExtensions[spec.name];
      for (var prop in exts) {
        if (!exts.hasOwnProperty(prop)) continue;
        if (modeObj.hasOwnProperty(prop)) modeObj["_" + prop] = modeObj[prop];
        modeObj[prop] = exts[prop];
      }
    }
    modeObj.name = spec.name;
    if (spec.helperType) modeObj.helperType = spec.helperType;
    if (spec.modeProps) for (var prop in spec.modeProps)
      modeObj[prop] = spec.modeProps[prop];

    return modeObj;
  };

  // Minimal default mode.
  CodeMirror.defineMode("null", function() {
    return {token: function(stream) {stream.skipToEnd();}};
  });
  CodeMirror.defineMIME("text/plain", "null");

  // This can be used to attach properties to mode objects from
  // outside the actual mode definition.
  var modeExtensions = CodeMirror.modeExtensions = {};
  CodeMirror.extendMode = function(mode, properties) {
    var exts = modeExtensions.hasOwnProperty(mode) ? modeExtensions[mode] : (modeExtensions[mode] = {});
    copyObj(properties, exts);
  };

  // EXTENSIONS

  CodeMirror.defineExtension = function(name, func) {
    CodeMirror.prototype[name] = func;
  };
  CodeMirror.defineDocExtension = function(name, func) {
    Doc.prototype[name] = func;
  };
  CodeMirror.defineOption = option;

  var initHooks = [];
  CodeMirror.defineInitHook = function(f) {initHooks.push(f);};

  var helpers = CodeMirror.helpers = {};
  CodeMirror.registerHelper = function(type, name, value) {
    if (!helpers.hasOwnProperty(type)) helpers[type] = CodeMirror[type] = {_global: []};
    helpers[type][name] = value;
  };
  CodeMirror.registerGlobalHelper = function(type, name, predicate, value) {
    CodeMirror.registerHelper(type, name, value);
    helpers[type]._global.push({pred: predicate, val: value});
  };

  // MODE STATE HANDLING

  // Utility functions for working with state. Exported because nested
  // modes need to do this for their inner modes.

  var copyState = CodeMirror.copyState = function(mode, state) {
    if (state === true) return state;
    if (mode.copyState) return mode.copyState(state);
    var nstate = {};
    for (var n in state) {
      var val = state[n];
      if (val instanceof Array) val = val.concat([]);
      nstate[n] = val;
    }
    return nstate;
  };

  var startState = CodeMirror.startState = function(mode, a1, a2) {
    return mode.startState ? mode.startState(a1, a2) : true;
  };

  // Given a mode and a state (for that mode), find the inner mode and
  // state at the position that the state refers to.
  CodeMirror.innerMode = function(mode, state) {
    while (mode.innerMode) {
      var info = mode.innerMode(state);
      if (!info || info.mode == mode) break;
      state = info.state;
      mode = info.mode;
    }
    return info || {mode: mode, state: state};
  };

  // STANDARD COMMANDS

  // Commands are parameter-less actions that can be performed on an
  // editor, mostly used for keybindings.
  var commands = CodeMirror.commands = {
    selectAll: function(cm) {cm.setSelection(Pos(cm.firstLine(), 0), Pos(cm.lastLine()), sel_dontScroll);},
    singleSelection: function(cm) {
      cm.setSelection(cm.getCursor("anchor"), cm.getCursor("head"), sel_dontScroll);
    },
    killLine: function(cm) {
      deleteNearSelection(cm, function(range) {
        if (range.empty()) {
          var len = getLine(cm.doc, range.head.line).text.length;
          if (range.head.ch == len && range.head.line < cm.lastLine())
            return {from: range.head, to: Pos(range.head.line + 1, 0)};
          else
            return {from: range.head, to: Pos(range.head.line, len)};
        } else {
          return {from: range.from(), to: range.to()};
        }
      });
    },
    deleteLine: function(cm) {
      deleteNearSelection(cm, function(range) {
        return {from: Pos(range.from().line, 0),
                to: clipPos(cm.doc, Pos(range.to().line + 1, 0))};
      });
    },
    delLineLeft: function(cm) {
      deleteNearSelection(cm, function(range) {
        return {from: Pos(range.from().line, 0), to: range.from()};
      });
    },
    delWrappedLineLeft: function(cm) {
      deleteNearSelection(cm, function(range) {
        var top = cm.charCoords(range.head, "div").top + 5;
        var leftPos = cm.coordsChar({left: 0, top: top}, "div");
        return {from: leftPos, to: range.from()};
      });
    },
    delWrappedLineRight: function(cm) {
      deleteNearSelection(cm, function(range) {
        var top = cm.charCoords(range.head, "div").top + 5;
        var rightPos = cm.coordsChar({left: cm.display.lineDiv.offsetWidth + 100, top: top}, "div");
        return {from: range.from(), to: rightPos };
      });
    },
    undo: function(cm) {cm.undo();},
    redo: function(cm) {cm.redo();},
    undoSelection: function(cm) {cm.undoSelection();},
    redoSelection: function(cm) {cm.redoSelection();},
    goDocStart: function(cm) {cm.extendSelection(Pos(cm.firstLine(), 0));},
    goDocEnd: function(cm) {cm.extendSelection(Pos(cm.lastLine()));},
    goLineStart: function(cm) {
      cm.extendSelectionsBy(function(range) { return lineStart(cm, range.head.line); },
                            {origin: "+move", bias: 1});
    },
    goLineStartSmart: function(cm) {
      cm.extendSelectionsBy(function(range) {
        return lineStartSmart(cm, range.head);
      }, {origin: "+move", bias: 1});
    },
    goLineEnd: function(cm) {
      cm.extendSelectionsBy(function(range) { return lineEnd(cm, range.head.line); },
                            {origin: "+move", bias: -1});
    },
    goLineRight: function(cm) {
      cm.extendSelectionsBy(function(range) {
        var top = cm.charCoords(range.head, "div").top + 5;
        return cm.coordsChar({left: cm.display.lineDiv.offsetWidth + 100, top: top}, "div");
      }, sel_move);
    },
    goLineLeft: function(cm) {
      cm.extendSelectionsBy(function(range) {
        var top = cm.charCoords(range.head, "div").top + 5;
        return cm.coordsChar({left: 0, top: top}, "div");
      }, sel_move);
    },
    goLineLeftSmart: function(cm) {
      cm.extendSelectionsBy(function(range) {
        var top = cm.charCoords(range.head, "div").top + 5;
        var pos = cm.coordsChar({left: 0, top: top}, "div");
        if (pos.ch < cm.getLine(pos.line).search(/\S/)) return lineStartSmart(cm, range.head);
        return pos;
      }, sel_move);
    },
    goLineUp: function(cm) {cm.moveV(-1, "line");},
    goLineDown: function(cm) {cm.moveV(1, "line");},
    goPageUp: function(cm) {cm.moveV(-1, "page");},
    goPageDown: function(cm) {cm.moveV(1, "page");},
    goCharLeft: function(cm) {cm.moveH(-1, "char");},
    goCharRight: function(cm) {cm.moveH(1, "char");},
    goColumnLeft: function(cm) {cm.moveH(-1, "column");},
    goColumnRight: function(cm) {cm.moveH(1, "column");},
    goWordLeft: function(cm) {cm.moveH(-1, "word");},
    goGroupRight: function(cm) {cm.moveH(1, "group");},
    goGroupLeft: function(cm) {cm.moveH(-1, "group");},
    goWordRight: function(cm) {cm.moveH(1, "word");},
    delCharBefore: function(cm) {cm.deleteH(-1, "char");},
    delCharAfter: function(cm) {cm.deleteH(1, "char");},
    delWordBefore: function(cm) {cm.deleteH(-1, "word");},
    delWordAfter: function(cm) {cm.deleteH(1, "word");},
    delGroupBefore: function(cm) {cm.deleteH(-1, "group");},
    delGroupAfter: function(cm) {cm.deleteH(1, "group");},
    indentAuto: function(cm) {cm.indentSelection("smart");},
    indentMore: function(cm) {cm.indentSelection("add");},
    indentLess: function(cm) {cm.indentSelection("subtract");},
    insertTab: function(cm) {cm.replaceSelection("\t");},
    insertSoftTab: function(cm) {
      var spaces = [], ranges = cm.listSelections(), tabSize = cm.options.tabSize;
      for (var i = 0; i < ranges.length; i++) {
        var pos = ranges[i].from();
        var col = countColumn(cm.getLine(pos.line), pos.ch, tabSize);
        spaces.push(new Array(tabSize - col % tabSize + 1).join(" "));
      }
      cm.replaceSelections(spaces);
    },
    defaultTab: function(cm) {
      if (cm.somethingSelected()) cm.indentSelection("add");
      else cm.execCommand("insertTab");
    },
    transposeChars: function(cm) {
      runInOp(cm, function() {
        var ranges = cm.listSelections(), newSel = [];
        for (var i = 0; i < ranges.length; i++) {
          var cur = ranges[i].head, line = getLine(cm.doc, cur.line).text;
          if (line) {
            if (cur.ch == line.length) cur = new Pos(cur.line, cur.ch - 1);
            if (cur.ch > 0) {
              cur = new Pos(cur.line, cur.ch + 1);
              cm.replaceRange(line.charAt(cur.ch - 1) + line.charAt(cur.ch - 2),
                              Pos(cur.line, cur.ch - 2), cur, "+transpose");
            } else if (cur.line > cm.doc.first) {
              var prev = getLine(cm.doc, cur.line - 1).text;
              if (prev)
                cm.replaceRange(line.charAt(0) + cm.doc.lineSeparator() +
                                prev.charAt(prev.length - 1),
                                Pos(cur.line - 1, prev.length - 1), Pos(cur.line, 1), "+transpose");
            }
          }
          newSel.push(new Range(cur, cur));
        }
        cm.setSelections(newSel);
      });
    },
    newlineAndIndent: function(cm) {
      runInOp(cm, function() {
        var len = cm.listSelections().length;
        for (var i = 0; i < len; i++) {
          var range = cm.listSelections()[i];
          cm.replaceRange(cm.doc.lineSeparator(), range.anchor, range.head, "+input");
          cm.indentLine(range.from().line + 1, null, true);
          ensureCursorVisible(cm);
        }
      });
    },
    toggleOverwrite: function(cm) {cm.toggleOverwrite();}
  };


  // STANDARD KEYMAPS

  var keyMap = CodeMirror.keyMap = {};

  keyMap.basic = {
    "Left": "goCharLeft", "Right": "goCharRight", "Up": "goLineUp", "Down": "goLineDown",
    "End": "goLineEnd", "Home": "goLineStartSmart", "PageUp": "goPageUp", "PageDown": "goPageDown",
    "Delete": "delCharAfter", "Backspace": "delCharBefore", "Shift-Backspace": "delCharBefore",
    "Tab": "defaultTab", "Shift-Tab": "indentAuto",
    "Enter": "newlineAndIndent", "Insert": "toggleOverwrite",
    "Esc": "singleSelection"
  };
  // Note that the save and find-related commands aren't defined by
  // default. User code or addons can define them. Unknown commands
  // are simply ignored.
  keyMap.pcDefault = {
    "Ctrl-A": "selectAll", "Ctrl-D": "deleteLine", "Ctrl-Z": "undo", "Shift-Ctrl-Z": "redo", "Ctrl-Y": "redo",
    "Ctrl-Home": "goDocStart", "Ctrl-End": "goDocEnd", "Ctrl-Up": "goLineUp", "Ctrl-Down": "goLineDown",
    "Ctrl-Left": "goGroupLeft", "Ctrl-Right": "goGroupRight", "Alt-Left": "goLineStart", "Alt-Right": "goLineEnd",
    "Ctrl-Backspace": "delGroupBefore", "Ctrl-Delete": "delGroupAfter", "Ctrl-S": "save", "Ctrl-F": "find",
    "Ctrl-G": "findNext", "Shift-Ctrl-G": "findPrev", "Shift-Ctrl-F": "replace", "Shift-Ctrl-R": "replaceAll",
    "Ctrl-[": "indentLess", "Ctrl-]": "indentMore",
    "Ctrl-U": "undoSelection", "Shift-Ctrl-U": "redoSelection", "Alt-U": "redoSelection",
    fallthrough: "basic"
  };
  // Very basic readline/emacs-style bindings, which are standard on Mac.
  keyMap.emacsy = {
    "Ctrl-F": "goCharRight", "Ctrl-B": "goCharLeft", "Ctrl-P": "goLineUp", "Ctrl-N": "goLineDown",
    "Alt-F": "goWordRight", "Alt-B": "goWordLeft", "Ctrl-A": "goLineStart", "Ctrl-E": "goLineEnd",
    "Ctrl-V": "goPageDown", "Shift-Ctrl-V": "goPageUp", "Ctrl-D": "delCharAfter", "Ctrl-H": "delCharBefore",
    "Alt-D": "delWordAfter", "Alt-Backspace": "delWordBefore", "Ctrl-K": "killLine", "Ctrl-T": "transposeChars"
  };
  keyMap.macDefault = {
    "Cmd-A": "selectAll", "Cmd-D": "deleteLine", "Cmd-Z": "undo", "Shift-Cmd-Z": "redo", "Cmd-Y": "redo",
    "Cmd-Home": "goDocStart", "Cmd-Up": "goDocStart", "Cmd-End": "goDocEnd", "Cmd-Down": "goDocEnd", "Alt-Left": "goGroupLeft",
    "Alt-Right": "goGroupRight", "Cmd-Left": "goLineLeft", "Cmd-Right": "goLineRight", "Alt-Backspace": "delGroupBefore",
    "Ctrl-Alt-Backspace": "delGroupAfter", "Alt-Delete": "delGroupAfter", "Cmd-S": "save", "Cmd-F": "find",
    "Cmd-G": "findNext", "Shift-Cmd-G": "findPrev", "Cmd-Alt-F": "replace", "Shift-Cmd-Alt-F": "replaceAll",
    "Cmd-[": "indentLess", "Cmd-]": "indentMore", "Cmd-Backspace": "delWrappedLineLeft", "Cmd-Delete": "delWrappedLineRight",
    "Cmd-U": "undoSelection", "Shift-Cmd-U": "redoSelection", "Ctrl-Up": "goDocStart", "Ctrl-Down": "goDocEnd",
    fallthrough: ["basic", "emacsy"]
  };
  keyMap["default"] = mac ? keyMap.macDefault : keyMap.pcDefault;

  // KEYMAP DISPATCH

  function normalizeKeyName(name) {
    var parts = name.split(/-(?!$)/), name = parts[parts.length - 1];
    var alt, ctrl, shift, cmd;
    for (var i = 0; i < parts.length - 1; i++) {
      var mod = parts[i];
      if (/^(cmd|meta|m)$/i.test(mod)) cmd = true;
      else if (/^a(lt)?$/i.test(mod)) alt = true;
      else if (/^(c|ctrl|control)$/i.test(mod)) ctrl = true;
      else if (/^s(hift)$/i.test(mod)) shift = true;
      else throw new Error("Unrecognized modifier name: " + mod);
    }
    if (alt) name = "Alt-" + name;
    if (ctrl) name = "Ctrl-" + name;
    if (cmd) name = "Cmd-" + name;
    if (shift) name = "Shift-" + name;
    return name;
  }

  // This is a kludge to keep keymaps mostly working as raw objects
  // (backwards compatibility) while at the same time support features
  // like normalization and multi-stroke key bindings. It compiles a
  // new normalized keymap, and then updates the old object to reflect
  // this.
  CodeMirror.normalizeKeyMap = function(keymap) {
    var copy = {};
    for (var keyname in keymap) if (keymap.hasOwnProperty(keyname)) {
      var value = keymap[keyname];
      if (/^(name|fallthrough|(de|at)tach)$/.test(keyname)) continue;
      if (value == "...") { delete keymap[keyname]; continue; }

      var keys = map(keyname.split(" "), normalizeKeyName);
      for (var i = 0; i < keys.length; i++) {
        var val, name;
        if (i == keys.length - 1) {
          name = keys.join(" ");
          val = value;
        } else {
          name = keys.slice(0, i + 1).join(" ");
          val = "...";
        }
        var prev = copy[name];
        if (!prev) copy[name] = val;
        else if (prev != val) throw new Error("Inconsistent bindings for " + name);
      }
      delete keymap[keyname];
    }
    for (var prop in copy) keymap[prop] = copy[prop];
    return keymap;
  };

  var lookupKey = CodeMirror.lookupKey = function(key, map, handle, context) {
    map = getKeyMap(map);
    var found = map.call ? map.call(key, context) : map[key];
    if (found === false) return "nothing";
    if (found === "...") return "multi";
    if (found != null && handle(found)) return "handled";

    if (map.fallthrough) {
      if (Object.prototype.toString.call(map.fallthrough) != "[object Array]")
        return lookupKey(key, map.fallthrough, handle, context);
      for (var i = 0; i < map.fallthrough.length; i++) {
        var result = lookupKey(key, map.fallthrough[i], handle, context);
        if (result) return result;
      }
    }
  };

  // Modifier key presses don't count as 'real' key presses for the
  // purpose of keymap fallthrough.
  var isModifierKey = CodeMirror.isModifierKey = function(value) {
    var name = typeof value == "string" ? value : keyNames[value.keyCode];
    return name == "Ctrl" || name == "Alt" || name == "Shift" || name == "Mod";
  };

  // Look up the name of a key as indicated by an event object.
  var keyName = CodeMirror.keyName = function(event, noShift) {
    if (presto && event.keyCode == 34 && event["char"]) return false;
    var base = keyNames[event.keyCode], name = base;
    if (name == null || event.altGraphKey) return false;
    if (event.altKey && base != "Alt") name = "Alt-" + name;
    if ((flipCtrlCmd ? event.metaKey : event.ctrlKey) && base != "Ctrl") name = "Ctrl-" + name;
    if ((flipCtrlCmd ? event.ctrlKey : event.metaKey) && base != "Cmd") name = "Cmd-" + name;
    if (!noShift && event.shiftKey && base != "Shift") name = "Shift-" + name;
    return name;
  };

  function getKeyMap(val) {
    return typeof val == "string" ? keyMap[val] : val;
  }

  // FROMTEXTAREA

  CodeMirror.fromTextArea = function(textarea, options) {
    options = options ? copyObj(options) : {};
    options.value = textarea.value;
    if (!options.tabindex && textarea.tabIndex)
      options.tabindex = textarea.tabIndex;
    if (!options.placeholder && textarea.placeholder)
      options.placeholder = textarea.placeholder;
    // Set autofocus to true if this textarea is focused, or if it has
    // autofocus and no other element is focused.
    if (options.autofocus == null) {
      var hasFocus = activeElt();
      options.autofocus = hasFocus == textarea ||
        textarea.getAttribute("autofocus") != null && hasFocus == document.body;
    }

    function save() {textarea.value = cm.getValue();}
    if (textarea.form) {
      on(textarea.form, "submit", save);
      // Deplorable hack to make the submit method do the right thing.
      if (!options.leaveSubmitMethodAlone) {
        var form = textarea.form, realSubmit = form.submit;
        try {
          var wrappedSubmit = form.submit = function() {
            save();
            form.submit = realSubmit;
            form.submit();
            form.submit = wrappedSubmit;
          };
        } catch(e) {}
      }
    }

    options.finishInit = function(cm) {
      cm.save = save;
      cm.getTextArea = function() { return textarea; };
      cm.toTextArea = function() {
        cm.toTextArea = isNaN; // Prevent this from being ran twice
        save();
        textarea.parentNode.removeChild(cm.getWrapperElement());
        textarea.style.display = "";
        if (textarea.form) {
          off(textarea.form, "submit", save);
          if (typeof textarea.form.submit == "function")
            textarea.form.submit = realSubmit;
        }
      };
    };

    textarea.style.display = "none";
    var cm = CodeMirror(function(node) {
      textarea.parentNode.insertBefore(node, textarea.nextSibling);
    }, options);
    return cm;
  };

  // STRING STREAM

  // Fed to the mode parsers, provides helper functions to make
  // parsers more succinct.

  var StringStream = CodeMirror.StringStream = function(string, tabSize) {
    this.pos = this.start = 0;
    this.string = string;
    this.tabSize = tabSize || 8;
    this.lastColumnPos = this.lastColumnValue = 0;
    this.lineStart = 0;
  };

  StringStream.prototype = {
    eol: function() {return this.pos >= this.string.length;},
    sol: function() {return this.pos == this.lineStart;},
    peek: function() {return this.string.charAt(this.pos) || undefined;},
    next: function() {
      if (this.pos < this.string.length)
        return this.string.charAt(this.pos++);
    },
    eat: function(match) {
      var ch = this.string.charAt(this.pos);
      if (typeof match == "string") var ok = ch == match;
      else var ok = ch && (match.test ? match.test(ch) : match(ch));
      if (ok) {++this.pos; return ch;}
    },
    eatWhile: function(match) {
      var start = this.pos;
      while (this.eat(match)){}
      return this.pos > start;
    },
    eatSpace: function() {
      var start = this.pos;
      while (/[\s\u00a0]/.test(this.string.charAt(this.pos))) ++this.pos;
      return this.pos > start;
    },
    skipToEnd: function() {this.pos = this.string.length;},
    skipTo: function(ch) {
      var found = this.string.indexOf(ch, this.pos);
      if (found > -1) {this.pos = found; return true;}
    },
    backUp: function(n) {this.pos -= n;},
    column: function() {
      if (this.lastColumnPos < this.start) {
        this.lastColumnValue = countColumn(this.string, this.start, this.tabSize, this.lastColumnPos, this.lastColumnValue);
        this.lastColumnPos = this.start;
      }
      return this.lastColumnValue - (this.lineStart ? countColumn(this.string, this.lineStart, this.tabSize) : 0);
    },
    indentation: function() {
      return countColumn(this.string, null, this.tabSize) -
        (this.lineStart ? countColumn(this.string, this.lineStart, this.tabSize) : 0);
    },
    match: function(pattern, consume, caseInsensitive) {
      if (typeof pattern == "string") {
        var cased = function(str) {return caseInsensitive ? str.toLowerCase() : str;};
        var substr = this.string.substr(this.pos, pattern.length);
        if (cased(substr) == cased(pattern)) {
          if (consume !== false) this.pos += pattern.length;
          return true;
        }
      } else {
        var match = this.string.slice(this.pos).match(pattern);
        if (match && match.index > 0) return null;
        if (match && consume !== false) this.pos += match[0].length;
        return match;
      }
    },
    current: function(){return this.string.slice(this.start, this.pos);},
    hideFirstChars: function(n, inner) {
      this.lineStart += n;
      try { return inner(); }
      finally { this.lineStart -= n; }
    }
  };

  // TEXTMARKERS

  // Created with markText and setBookmark methods. A TextMarker is a
  // handle that can be used to clear or find a marked position in the
  // document. Line objects hold arrays (markedSpans) containing
  // {from, to, marker} object pointing to such marker objects, and
  // indicating that such a marker is present on that line. Multiple
  // lines may point to the same marker when it spans across lines.
  // The spans will have null for their from/to properties when the
  // marker continues beyond the start/end of the line. Markers have
  // links back to the lines they currently touch.

  var nextMarkerId = 0;

  var TextMarker = CodeMirror.TextMarker = function(doc, type) {
    this.lines = [];
    this.type = type;
    this.doc = doc;
    this.id = ++nextMarkerId;
  };
  eventMixin(TextMarker);

  // Clear the marker.
  TextMarker.prototype.clear = function() {
    if (this.explicitlyCleared) return;
    var cm = this.doc.cm, withOp = cm && !cm.curOp;
    if (withOp) startOperation(cm);
    if (hasHandler(this, "clear")) {
      var found = this.find();
      if (found) signalLater(this, "clear", found.from, found.to);
    }
    var min = null, max = null;
    for (var i = 0; i < this.lines.length; ++i) {
      var line = this.lines[i];
      var span = getMarkedSpanFor(line.markedSpans, this);
      if (cm && !this.collapsed) regLineChange(cm, lineNo(line), "text");
      else if (cm) {
        if (span.to != null) max = lineNo(line);
        if (span.from != null) min = lineNo(line);
      }
      line.markedSpans = removeMarkedSpan(line.markedSpans, span);
      if (span.from == null && this.collapsed && !lineIsHidden(this.doc, line) && cm)
        updateLineHeight(line, textHeight(cm.display));
    }
    if (cm && this.collapsed && !cm.options.lineWrapping) for (var i = 0; i < this.lines.length; ++i) {
      var visual = visualLine(this.lines[i]), len = lineLength(visual);
      if (len > cm.display.maxLineLength) {
        cm.display.maxLine = visual;
        cm.display.maxLineLength = len;
        cm.display.maxLineChanged = true;
      }
    }

    if (min != null && cm && this.collapsed) regChange(cm, min, max + 1);
    this.lines.length = 0;
    this.explicitlyCleared = true;
    if (this.atomic && this.doc.cantEdit) {
      this.doc.cantEdit = false;
      if (cm) reCheckSelection(cm.doc);
    }
    if (cm) signalLater(cm, "markerCleared", cm, this);
    if (withOp) endOperation(cm);
    if (this.parent) this.parent.clear();
  };

  // Find the position of the marker in the document. Returns a {from,
  // to} object by default. Side can be passed to get a specific side
  // -- 0 (both), -1 (left), or 1 (right). When lineObj is true, the
  // Pos objects returned contain a line object, rather than a line
  // number (used to prevent looking up the same line twice).
  TextMarker.prototype.find = function(side, lineObj) {
    if (side == null && this.type == "bookmark") side = 1;
    var from, to;
    for (var i = 0; i < this.lines.length; ++i) {
      var line = this.lines[i];
      var span = getMarkedSpanFor(line.markedSpans, this);
      if (span.from != null) {
        from = Pos(lineObj ? line : lineNo(line), span.from);
        if (side == -1) return from;
      }
      if (span.to != null) {
        to = Pos(lineObj ? line : lineNo(line), span.to);
        if (side == 1) return to;
      }
    }
    return from && {from: from, to: to};
  };

  // Signals that the marker's widget changed, and surrounding layout
  // should be recomputed.
  TextMarker.prototype.changed = function() {
    var pos = this.find(-1, true), widget = this, cm = this.doc.cm;
    if (!pos || !cm) return;
    runInOp(cm, function() {
      var line = pos.line, lineN = lineNo(pos.line);
      var view = findViewForLine(cm, lineN);
      if (view) {
        clearLineMeasurementCacheFor(view);
        cm.curOp.selectionChanged = cm.curOp.forceUpdate = true;
      }
      cm.curOp.updateMaxLine = true;
      if (!lineIsHidden(widget.doc, line) && widget.height != null) {
        var oldHeight = widget.height;
        widget.height = null;
        var dHeight = widgetHeight(widget) - oldHeight;
        if (dHeight)
          updateLineHeight(line, line.height + dHeight);
      }
    });
  };

  TextMarker.prototype.attachLine = function(line) {
    if (!this.lines.length && this.doc.cm) {
      var op = this.doc.cm.curOp;
      if (!op.maybeHiddenMarkers || indexOf(op.maybeHiddenMarkers, this) == -1)
        (op.maybeUnhiddenMarkers || (op.maybeUnhiddenMarkers = [])).push(this);
    }
    this.lines.push(line);
  };
  TextMarker.prototype.detachLine = function(line) {
    this.lines.splice(indexOf(this.lines, line), 1);
    if (!this.lines.length && this.doc.cm) {
      var op = this.doc.cm.curOp;
      (op.maybeHiddenMarkers || (op.maybeHiddenMarkers = [])).push(this);
    }
  };

  // Collapsed markers have unique ids, in order to be able to order
  // them, which is needed for uniquely determining an outer marker
  // when they overlap (they may nest, but not partially overlap).
  var nextMarkerId = 0;

  // Create a marker, wire it up to the right lines, and
  function markText(doc, from, to, options, type) {
    // Shared markers (across linked documents) are handled separately
    // (markTextShared will call out to this again, once per
    // document).
    if (options && options.shared) return markTextShared(doc, from, to, options, type);
    // Ensure we are in an operation.
    if (doc.cm && !doc.cm.curOp) return operation(doc.cm, markText)(doc, from, to, options, type);

    var marker = new TextMarker(doc, type), diff = cmp(from, to);
    if (options) copyObj(options, marker, false);
    // Don't connect empty markers unless clearWhenEmpty is false
    if (diff > 0 || diff == 0 && marker.clearWhenEmpty !== false)
      return marker;
    if (marker.replacedWith) {
      // Showing up as a widget implies collapsed (widget replaces text)
      marker.collapsed = true;
      marker.widgetNode = elt("span", [marker.replacedWith], "CodeMirror-widget");
      if (!options.handleMouseEvents) marker.widgetNode.setAttribute("cm-ignore-events", "true");
      if (options.insertLeft) marker.widgetNode.insertLeft = true;
    }
    if (marker.collapsed) {
      if (conflictingCollapsedRange(doc, from.line, from, to, marker) ||
          from.line != to.line && conflictingCollapsedRange(doc, to.line, from, to, marker))
        throw new Error("Inserting collapsed marker partially overlapping an existing one");
      sawCollapsedSpans = true;
    }

    if (marker.addToHistory)
      addChangeToHistory(doc, {from: from, to: to, origin: "markText"}, doc.sel, NaN);

    var curLine = from.line, cm = doc.cm, updateMaxLine;
    doc.iter(curLine, to.line + 1, function(line) {
      if (cm && marker.collapsed && !cm.options.lineWrapping && visualLine(line) == cm.display.maxLine)
        updateMaxLine = true;
      if (marker.collapsed && curLine != from.line) updateLineHeight(line, 0);
      addMarkedSpan(line, new MarkedSpan(marker,
                                         curLine == from.line ? from.ch : null,
                                         curLine == to.line ? to.ch : null));
      ++curLine;
    });
    // lineIsHidden depends on the presence of the spans, so needs a second pass
    if (marker.collapsed) doc.iter(from.line, to.line + 1, function(line) {
      if (lineIsHidden(doc, line)) updateLineHeight(line, 0);
    });

    if (marker.clearOnEnter) on(marker, "beforeCursorEnter", function() { marker.clear(); });

    if (marker.readOnly) {
      sawReadOnlySpans = true;
      if (doc.history.done.length || doc.history.undone.length)
        doc.clearHistory();
    }
    if (marker.collapsed) {
      marker.id = ++nextMarkerId;
      marker.atomic = true;
    }
    if (cm) {
      // Sync editor state
      if (updateMaxLine) cm.curOp.updateMaxLine = true;
      if (marker.collapsed)
        regChange(cm, from.line, to.line + 1);
      else if (marker.className || marker.title || marker.startStyle || marker.endStyle || marker.css)
        for (var i = from.line; i <= to.line; i++) regLineChange(cm, i, "text");
      if (marker.atomic) reCheckSelection(cm.doc);
      signalLater(cm, "markerAdded", cm, marker);
    }
    return marker;
  }

  // SHARED TEXTMARKERS

  // A shared marker spans multiple linked documents. It is
  // implemented as a meta-marker-object controlling multiple normal
  // markers.
  var SharedTextMarker = CodeMirror.SharedTextMarker = function(markers, primary) {
    this.markers = markers;
    this.primary = primary;
    for (var i = 0; i < markers.length; ++i)
      markers[i].parent = this;
  };
  eventMixin(SharedTextMarker);

  SharedTextMarker.prototype.clear = function() {
    if (this.explicitlyCleared) return;
    this.explicitlyCleared = true;
    for (var i = 0; i < this.markers.length; ++i)
      this.markers[i].clear();
    signalLater(this, "clear");
  };
  SharedTextMarker.prototype.find = function(side, lineObj) {
    return this.primary.find(side, lineObj);
  };

  function markTextShared(doc, from, to, options, type) {
    options = copyObj(options);
    options.shared = false;
    var markers = [markText(doc, from, to, options, type)], primary = markers[0];
    var widget = options.widgetNode;
    linkedDocs(doc, function(doc) {
      if (widget) options.widgetNode = widget.cloneNode(true);
      markers.push(markText(doc, clipPos(doc, from), clipPos(doc, to), options, type));
      for (var i = 0; i < doc.linked.length; ++i)
        if (doc.linked[i].isParent) return;
      primary = lst(markers);
    });
    return new SharedTextMarker(markers, primary);
  }

  function findSharedMarkers(doc) {
    return doc.findMarks(Pos(doc.first, 0), doc.clipPos(Pos(doc.lastLine())),
                         function(m) { return m.parent; });
  }

  function copySharedMarkers(doc, markers) {
    for (var i = 0; i < markers.length; i++) {
      var marker = markers[i], pos = marker.find();
      var mFrom = doc.clipPos(pos.from), mTo = doc.clipPos(pos.to);
      if (cmp(mFrom, mTo)) {
        var subMark = markText(doc, mFrom, mTo, marker.primary, marker.primary.type);
        marker.markers.push(subMark);
        subMark.parent = marker;
      }
    }
  }

  function detachSharedMarkers(markers) {
    for (var i = 0; i < markers.length; i++) {
      var marker = markers[i], linked = [marker.primary.doc];;
      linkedDocs(marker.primary.doc, function(d) { linked.push(d); });
      for (var j = 0; j < marker.markers.length; j++) {
        var subMarker = marker.markers[j];
        if (indexOf(linked, subMarker.doc) == -1) {
          subMarker.parent = null;
          marker.markers.splice(j--, 1);
        }
      }
    }
  }

  // TEXTMARKER SPANS

  function MarkedSpan(marker, from, to) {
    this.marker = marker;
    this.from = from; this.to = to;
  }

  // Search an array of spans for a span matching the given marker.
  function getMarkedSpanFor(spans, marker) {
    if (spans) for (var i = 0; i < spans.length; ++i) {
      var span = spans[i];
      if (span.marker == marker) return span;
    }
  }
  // Remove a span from an array, returning undefined if no spans are
  // left (we don't store arrays for lines without spans).
  function removeMarkedSpan(spans, span) {
    for (var r, i = 0; i < spans.length; ++i)
      if (spans[i] != span) (r || (r = [])).push(spans[i]);
    return r;
  }
  // Add a span to a line.
  function addMarkedSpan(line, span) {
    line.markedSpans = line.markedSpans ? line.markedSpans.concat([span]) : [span];
    span.marker.attachLine(line);
  }

  // Used for the algorithm that adjusts markers for a change in the
  // document. These functions cut an array of spans at a given
  // character position, returning an array of remaining chunks (or
  // undefined if nothing remains).
  function markedSpansBefore(old, startCh, isInsert) {
    if (old) for (var i = 0, nw; i < old.length; ++i) {
      var span = old[i], marker = span.marker;
      var startsBefore = span.from == null || (marker.inclusiveLeft ? span.from <= startCh : span.from < startCh);
      if (startsBefore || span.from == startCh && marker.type == "bookmark" && (!isInsert || !span.marker.insertLeft)) {
        var endsAfter = span.to == null || (marker.inclusiveRight ? span.to >= startCh : span.to > startCh);
        (nw || (nw = [])).push(new MarkedSpan(marker, span.from, endsAfter ? null : span.to));
      }
    }
    return nw;
  }
  function markedSpansAfter(old, endCh, isInsert) {
    if (old) for (var i = 0, nw; i < old.length; ++i) {
      var span = old[i], marker = span.marker;
      var endsAfter = span.to == null || (marker.inclusiveRight ? span.to >= endCh : span.to > endCh);
      if (endsAfter || span.from == endCh && marker.type == "bookmark" && (!isInsert || span.marker.insertLeft)) {
        var startsBefore = span.from == null || (marker.inclusiveLeft ? span.from <= endCh : span.from < endCh);
        (nw || (nw = [])).push(new MarkedSpan(marker, startsBefore ? null : span.from - endCh,
                                              span.to == null ? null : span.to - endCh));
      }
    }
    return nw;
  }

  // Given a change object, compute the new set of marker spans that
  // cover the line in which the change took place. Removes spans
  // entirely within the change, reconnects spans belonging to the
  // same marker that appear on both sides of the change, and cuts off
  // spans partially within the change. Returns an array of span
  // arrays with one element for each line in (after) the change.
  function stretchSpansOverChange(doc, change) {
    if (change.full) return null;
    var oldFirst = isLine(doc, change.from.line) && getLine(doc, change.from.line).markedSpans;
    var oldLast = isLine(doc, change.to.line) && getLine(doc, change.to.line).markedSpans;
    if (!oldFirst && !oldLast) return null;

    var startCh = change.from.ch, endCh = change.to.ch, isInsert = cmp(change.from, change.to) == 0;
    // Get the spans that 'stick out' on both sides
    var first = markedSpansBefore(oldFirst, startCh, isInsert);
    var last = markedSpansAfter(oldLast, endCh, isInsert);

    // Next, merge those two ends
    var sameLine = change.text.length == 1, offset = lst(change.text).length + (sameLine ? startCh : 0);
    if (first) {
      // Fix up .to properties of first
      for (var i = 0; i < first.length; ++i) {
        var span = first[i];
        if (span.to == null) {
          var found = getMarkedSpanFor(last, span.marker);
          if (!found) span.to = startCh;
          else if (sameLine) span.to = found.to == null ? null : found.to + offset;
        }
      }
    }
    if (last) {
      // Fix up .from in last (or move them into first in case of sameLine)
      for (var i = 0; i < last.length; ++i) {
        var span = last[i];
        if (span.to != null) span.to += offset;
        if (span.from == null) {
          var found = getMarkedSpanFor(first, span.marker);
          if (!found) {
            span.from = offset;
            if (sameLine) (first || (first = [])).push(span);
          }
        } else {
          span.from += offset;
          if (sameLine) (first || (first = [])).push(span);
        }
      }
    }
    // Make sure we didn't create any zero-length spans
    if (first) first = clearEmptySpans(first);
    if (last && last != first) last = clearEmptySpans(last);

    var newMarkers = [first];
    if (!sameLine) {
      // Fill gap with whole-line-spans
      var gap = change.text.length - 2, gapMarkers;
      if (gap > 0 && first)
        for (var i = 0; i < first.length; ++i)
          if (first[i].to == null)
            (gapMarkers || (gapMarkers = [])).push(new MarkedSpan(first[i].marker, null, null));
      for (var i = 0; i < gap; ++i)
        newMarkers.push(gapMarkers);
      newMarkers.push(last);
    }
    return newMarkers;
  }

  // Remove spans that are empty and don't have a clearWhenEmpty
  // option of false.
  function clearEmptySpans(spans) {
    for (var i = 0; i < spans.length; ++i) {
      var span = spans[i];
      if (span.from != null && span.from == span.to && span.marker.clearWhenEmpty !== false)
        spans.splice(i--, 1);
    }
    if (!spans.length) return null;
    return spans;
  }

  // Used for un/re-doing changes from the history. Combines the
  // result of computing the existing spans with the set of spans that
  // existed in the history (so that deleting around a span and then
  // undoing brings back the span).
  function mergeOldSpans(doc, change) {
    var old = getOldSpans(doc, change);
    var stretched = stretchSpansOverChange(doc, change);
    if (!old) return stretched;
    if (!stretched) return old;

    for (var i = 0; i < old.length; ++i) {
      var oldCur = old[i], stretchCur = stretched[i];
      if (oldCur && stretchCur) {
        spans: for (var j = 0; j < stretchCur.length; ++j) {
          var span = stretchCur[j];
          for (var k = 0; k < oldCur.length; ++k)
            if (oldCur[k].marker == span.marker) continue spans;
          oldCur.push(span);
        }
      } else if (stretchCur) {
        old[i] = stretchCur;
      }
    }
    return old;
  }

  // Used to 'clip' out readOnly ranges when making a change.
  function removeReadOnlyRanges(doc, from, to) {
    var markers = null;
    doc.iter(from.line, to.line + 1, function(line) {
      if (line.markedSpans) for (var i = 0; i < line.markedSpans.length; ++i) {
        var mark = line.markedSpans[i].marker;
        if (mark.readOnly && (!markers || indexOf(markers, mark) == -1))
          (markers || (markers = [])).push(mark);
      }
    });
    if (!markers) return null;
    var parts = [{from: from, to: to}];
    for (var i = 0; i < markers.length; ++i) {
      var mk = markers[i], m = mk.find(0);
      for (var j = 0; j < parts.length; ++j) {
        var p = parts[j];
        if (cmp(p.to, m.from) < 0 || cmp(p.from, m.to) > 0) continue;
        var newParts = [j, 1], dfrom = cmp(p.from, m.from), dto = cmp(p.to, m.to);
        if (dfrom < 0 || !mk.inclusiveLeft && !dfrom)
          newParts.push({from: p.from, to: m.from});
        if (dto > 0 || !mk.inclusiveRight && !dto)
          newParts.push({from: m.to, to: p.to});
        parts.splice.apply(parts, newParts);
        j += newParts.length - 1;
      }
    }
    return parts;
  }

  // Connect or disconnect spans from a line.
  function detachMarkedSpans(line) {
    var spans = line.markedSpans;
    if (!spans) return;
    for (var i = 0; i < spans.length; ++i)
      spans[i].marker.detachLine(line);
    line.markedSpans = null;
  }
  function attachMarkedSpans(line, spans) {
    if (!spans) return;
    for (var i = 0; i < spans.length; ++i)
      spans[i].marker.attachLine(line);
    line.markedSpans = spans;
  }

  // Helpers used when computing which overlapping collapsed span
  // counts as the larger one.
  function extraLeft(marker) { return marker.inclusiveLeft ? -1 : 0; }
  function extraRight(marker) { return marker.inclusiveRight ? 1 : 0; }

  // Returns a number indicating which of two overlapping collapsed
  // spans is larger (and thus includes the other). Falls back to
  // comparing ids when the spans cover exactly the same range.
  function compareCollapsedMarkers(a, b) {
    var lenDiff = a.lines.length - b.lines.length;
    if (lenDiff != 0) return lenDiff;
    var aPos = a.find(), bPos = b.find();
    var fromCmp = cmp(aPos.from, bPos.from) || extraLeft(a) - extraLeft(b);
    if (fromCmp) return -fromCmp;
    var toCmp = cmp(aPos.to, bPos.to) || extraRight(a) - extraRight(b);
    if (toCmp) return toCmp;
    return b.id - a.id;
  }

  // Find out whether a line ends or starts in a collapsed span. If
  // so, return the marker for that span.
  function collapsedSpanAtSide(line, start) {
    var sps = sawCollapsedSpans && line.markedSpans, found;
    if (sps) for (var sp, i = 0; i < sps.length; ++i) {
      sp = sps[i];
      if (sp.marker.collapsed && (start ? sp.from : sp.to) == null &&
          (!found || compareCollapsedMarkers(found, sp.marker) < 0))
        found = sp.marker;
    }
    return found;
  }
  function collapsedSpanAtStart(line) { return collapsedSpanAtSide(line, true); }
  function collapsedSpanAtEnd(line) { return collapsedSpanAtSide(line, false); }

  // Test whether there exists a collapsed span that partially
  // overlaps (covers the start or end, but not both) of a new span.
  // Such overlap is not allowed.
  function conflictingCollapsedRange(doc, lineNo, from, to, marker) {
    var line = getLine(doc, lineNo);
    var sps = sawCollapsedSpans && line.markedSpans;
    if (sps) for (var i = 0; i < sps.length; ++i) {
      var sp = sps[i];
      if (!sp.marker.collapsed) continue;
      var found = sp.marker.find(0);
      var fromCmp = cmp(found.from, from) || extraLeft(sp.marker) - extraLeft(marker);
      var toCmp = cmp(found.to, to) || extraRight(sp.marker) - extraRight(marker);
      if (fromCmp >= 0 && toCmp <= 0 || fromCmp <= 0 && toCmp >= 0) continue;
      if (fromCmp <= 0 && (cmp(found.to, from) > 0 || (sp.marker.inclusiveRight && marker.inclusiveLeft)) ||
          fromCmp >= 0 && (cmp(found.from, to) < 0 || (sp.marker.inclusiveLeft && marker.inclusiveRight)))
        return true;
    }
  }

  // A visual line is a line as drawn on the screen. Folding, for
  // example, can cause multiple logical lines to appear on the same
  // visual line. This finds the start of the visual line that the
  // given line is part of (usually that is the line itself).
  function visualLine(line) {
    var merged;
    while (merged = collapsedSpanAtStart(line))
      line = merged.find(-1, true).line;
    return line;
  }

  // Returns an array of logical lines that continue the visual line
  // started by the argument, or undefined if there are no such lines.
  function visualLineContinued(line) {
    var merged, lines;
    while (merged = collapsedSpanAtEnd(line)) {
      line = merged.find(1, true).line;
      (lines || (lines = [])).push(line);
    }
    return lines;
  }

  // Get the line number of the start of the visual line that the
  // given line number is part of.
  function visualLineNo(doc, lineN) {
    var line = getLine(doc, lineN), vis = visualLine(line);
    if (line == vis) return lineN;
    return lineNo(vis);
  }
  // Get the line number of the start of the next visual line after
  // the given line.
  function visualLineEndNo(doc, lineN) {
    if (lineN > doc.lastLine()) return lineN;
    var line = getLine(doc, lineN), merged;
    if (!lineIsHidden(doc, line)) return lineN;
    while (merged = collapsedSpanAtEnd(line))
      line = merged.find(1, true).line;
    return lineNo(line) + 1;
  }

  // Compute whether a line is hidden. Lines count as hidden when they
  // are part of a visual line that starts with another line, or when
  // they are entirely covered by collapsed, non-widget span.
  function lineIsHidden(doc, line) {
    var sps = sawCollapsedSpans && line.markedSpans;
    if (sps) for (var sp, i = 0; i < sps.length; ++i) {
      sp = sps[i];
      if (!sp.marker.collapsed) continue;
      if (sp.from == null) return true;
      if (sp.marker.widgetNode) continue;
      if (sp.from == 0 && sp.marker.inclusiveLeft && lineIsHiddenInner(doc, line, sp))
        return true;
    }
  }
  function lineIsHiddenInner(doc, line, span) {
    if (span.to == null) {
      var end = span.marker.find(1, true);
      return lineIsHiddenInner(doc, end.line, getMarkedSpanFor(end.line.markedSpans, span.marker));
    }
    if (span.marker.inclusiveRight && span.to == line.text.length)
      return true;
    for (var sp, i = 0; i < line.markedSpans.length; ++i) {
      sp = line.markedSpans[i];
      if (sp.marker.collapsed && !sp.marker.widgetNode && sp.from == span.to &&
          (sp.to == null || sp.to != span.from) &&
          (sp.marker.inclusiveLeft || span.marker.inclusiveRight) &&
          lineIsHiddenInner(doc, line, sp)) return true;
    }
  }

  // LINE WIDGETS

  // Line widgets are block elements displayed above or below a line.

  var LineWidget = CodeMirror.LineWidget = function(doc, node, options) {
    if (options) for (var opt in options) if (options.hasOwnProperty(opt))
      this[opt] = options[opt];
    this.doc = doc;
    this.node = node;
  };
  eventMixin(LineWidget);

  function adjustScrollWhenAboveVisible(cm, line, diff) {
    if (heightAtLine(line) < ((cm.curOp && cm.curOp.scrollTop) || cm.doc.scrollTop))
      addToScrollPos(cm, null, diff);
  }

  LineWidget.prototype.clear = function() {
    var cm = this.doc.cm, ws = this.line.widgets, line = this.line, no = lineNo(line);
    if (no == null || !ws) return;
    for (var i = 0; i < ws.length; ++i) if (ws[i] == this) ws.splice(i--, 1);
    if (!ws.length) line.widgets = null;
    var height = widgetHeight(this);
    updateLineHeight(line, Math.max(0, line.height - height));
    if (cm) runInOp(cm, function() {
      adjustScrollWhenAboveVisible(cm, line, -height);
      regLineChange(cm, no, "widget");
    });
  };
  LineWidget.prototype.changed = function() {
    var oldH = this.height, cm = this.doc.cm, line = this.line;
    this.height = null;
    var diff = widgetHeight(this) - oldH;
    if (!diff) return;
    updateLineHeight(line, line.height + diff);
    if (cm) runInOp(cm, function() {
      cm.curOp.forceUpdate = true;
      adjustScrollWhenAboveVisible(cm, line, diff);
    });
  };

  function widgetHeight(widget) {
    if (widget.height != null) return widget.height;
    var cm = widget.doc.cm;
    if (!cm) return 0;
    if (!contains(document.body, widget.node)) {
      var parentStyle = "position: relative;";
      if (widget.coverGutter)
        parentStyle += "margin-left: -" + cm.display.gutters.offsetWidth + "px;";
      if (widget.noHScroll)
        parentStyle += "width: " + cm.display.wrapper.clientWidth + "px;";
      removeChildrenAndAdd(cm.display.measure, elt("div", [widget.node], null, parentStyle));
    }
    return widget.height = widget.node.offsetHeight;
  }

  function addLineWidget(doc, handle, node, options) {
    var widget = new LineWidget(doc, node, options);
    var cm = doc.cm;
    if (cm && widget.noHScroll) cm.display.alignWidgets = true;
    changeLine(doc, handle, "widget", function(line) {
      var widgets = line.widgets || (line.widgets = []);
      if (widget.insertAt == null) widgets.push(widget);
      else widgets.splice(Math.min(widgets.length - 1, Math.max(0, widget.insertAt)), 0, widget);
      widget.line = line;
      if (cm && !lineIsHidden(doc, line)) {
        var aboveVisible = heightAtLine(line) < doc.scrollTop;
        updateLineHeight(line, line.height + widgetHeight(widget));
        if (aboveVisible) addToScrollPos(cm, null, widget.height);
        cm.curOp.forceUpdate = true;
      }
      return true;
    });
    return widget;
  }

  // LINE DATA STRUCTURE

  // Line objects. These hold state related to a line, including
  // highlighting info (the styles array).
  var Line = CodeMirror.Line = function(text, markedSpans, estimateHeight) {
    this.text = text;
    attachMarkedSpans(this, markedSpans);
    this.height = estimateHeight ? estimateHeight(this) : 1;
  };
  eventMixin(Line);
  Line.prototype.lineNo = function() { return lineNo(this); };

  // Change the content (text, markers) of a line. Automatically
  // invalidates cached information and tries to re-estimate the
  // line's height.
  function updateLine(line, text, markedSpans, estimateHeight) {
    line.text = text;
    if (line.stateAfter) line.stateAfter = null;
    if (line.styles) line.styles = null;
    if (line.order != null) line.order = null;
    detachMarkedSpans(line);
    attachMarkedSpans(line, markedSpans);
    var estHeight = estimateHeight ? estimateHeight(line) : 1;
    if (estHeight != line.height) updateLineHeight(line, estHeight);
  }

  // Detach a line from the document tree and its markers.
  function cleanUpLine(line) {
    line.parent = null;
    detachMarkedSpans(line);
  }

  function extractLineClasses(type, output) {
    if (type) for (;;) {
      var lineClass = type.match(/(?:^|\s+)line-(background-)?(\S+)/);
      if (!lineClass) break;
      type = type.slice(0, lineClass.index) + type.slice(lineClass.index + lineClass[0].length);
      var prop = lineClass[1] ? "bgClass" : "textClass";
      if (output[prop] == null)
        output[prop] = lineClass[2];
      else if (!(new RegExp("(?:^|\s)" + lineClass[2] + "(?:$|\s)")).test(output[prop]))
        output[prop] += " " + lineClass[2];
    }
    return type;
  }

  function callBlankLine(mode, state) {
    if (mode.blankLine) return mode.blankLine(state);
    if (!mode.innerMode) return;
    var inner = CodeMirror.innerMode(mode, state);
    if (inner.mode.blankLine) return inner.mode.blankLine(inner.state);
  }

  function readToken(mode, stream, state, inner) {
    for (var i = 0; i < 10; i++) {
      if (inner) inner[0] = CodeMirror.innerMode(mode, state).mode;
      var style = mode.token(stream, state);
      if (stream.pos > stream.start) return style;
    }
    throw new Error("Mode " + mode.name + " failed to advance stream.");
  }

  // Utility for getTokenAt and getLineTokens
  function takeToken(cm, pos, precise, asArray) {
    function getObj(copy) {
      return {start: stream.start, end: stream.pos,
              string: stream.current(),
              type: style || null,
              state: copy ? copyState(doc.mode, state) : state};
    }

    var doc = cm.doc, mode = doc.mode, style;
    pos = clipPos(doc, pos);
    var line = getLine(doc, pos.line), state = getStateBefore(cm, pos.line, precise);
    var stream = new StringStream(line.text, cm.options.tabSize), tokens;
    if (asArray) tokens = [];
    while ((asArray || stream.pos < pos.ch) && !stream.eol()) {
      stream.start = stream.pos;
      style = readToken(mode, stream, state);
      if (asArray) tokens.push(getObj(true));
    }
    return asArray ? tokens : getObj();
  }

  // Run the given mode's parser over a line, calling f for each token.
  function runMode(cm, text, mode, state, f, lineClasses, forceToEnd) {
    var flattenSpans = mode.flattenSpans;
    if (flattenSpans == null) flattenSpans = cm.options.flattenSpans;
    var curStart = 0, curStyle = null;
    var stream = new StringStream(text, cm.options.tabSize), style;
    var inner = cm.options.addModeClass && [null];
    if (text == "") extractLineClasses(callBlankLine(mode, state), lineClasses);
    while (!stream.eol()) {
      if (stream.pos > cm.options.maxHighlightLength) {
        flattenSpans = false;
        if (forceToEnd) processLine(cm, text, state, stream.pos);
        stream.pos = text.length;
        style = null;
      } else {
        style = extractLineClasses(readToken(mode, stream, state, inner), lineClasses);
      }
      if (inner) {
        var mName = inner[0].name;
        if (mName) style = "m-" + (style ? mName + " " + style : mName);
      }
      if (!flattenSpans || curStyle != style) {
        while (curStart < stream.start) {
          curStart = Math.min(stream.start, curStart + 50000);
          f(curStart, curStyle);
        }
        curStyle = style;
      }
      stream.start = stream.pos;
    }
    while (curStart < stream.pos) {
      // Webkit seems to refuse to render text nodes longer than 57444 characters
      var pos = Math.min(stream.pos, curStart + 50000);
      f(pos, curStyle);
      curStart = pos;
    }
  }

  // Compute a style array (an array starting with a mode generation
  // -- for invalidation -- followed by pairs of end positions and
  // style strings), which is used to highlight the tokens on the
  // line.
  function highlightLine(cm, line, state, forceToEnd) {
    // A styles array always starts with a number identifying the
    // mode/overlays that it is based on (for easy invalidation).
    var st = [cm.state.modeGen], lineClasses = {};
    // Compute the base array of styles
    runMode(cm, line.text, cm.doc.mode, state, function(end, style) {
      st.push(end, style);
    }, lineClasses, forceToEnd);

    // Run overlays, adjust style array.
    for (var o = 0; o < cm.state.overlays.length; ++o) {
      var overlay = cm.state.overlays[o], i = 1, at = 0;
      runMode(cm, line.text, overlay.mode, true, function(end, style) {
        var start = i;
        // Ensure there's a token end at the current position, and that i points at it
        while (at < end) {
          var i_end = st[i];
          if (i_end > end)
            st.splice(i, 1, end, st[i+1], i_end);
          i += 2;
          at = Math.min(end, i_end);
        }
        if (!style) return;
        if (overlay.opaque) {
          st.splice(start, i - start, end, "cm-overlay " + style);
          i = start + 2;
        } else {
          for (; start < i; start += 2) {
            var cur = st[start+1];
            st[start+1] = (cur ? cur + " " : "") + "cm-overlay " + style;
          }
        }
      }, lineClasses);
    }

    return {styles: st, classes: lineClasses.bgClass || lineClasses.textClass ? lineClasses : null};
  }

  function getLineStyles(cm, line, updateFrontier) {
    if (!line.styles || line.styles[0] != cm.state.modeGen) {
      var state = getStateBefore(cm, lineNo(line));
      var result = highlightLine(cm, line, line.text.length > cm.options.maxHighlightLength ? copyState(cm.doc.mode, state) : state);
      line.stateAfter = state;
      line.styles = result.styles;
      if (result.classes) line.styleClasses = result.classes;
      else if (line.styleClasses) line.styleClasses = null;
      if (updateFrontier === cm.doc.frontier) cm.doc.frontier++;
    }
    return line.styles;
  }

  // Lightweight form of highlight -- proceed over this line and
  // update state, but don't save a style array. Used for lines that
  // aren't currently visible.
  function processLine(cm, text, state, startAt) {
    var mode = cm.doc.mode;
    var stream = new StringStream(text, cm.options.tabSize);
    stream.start = stream.pos = startAt || 0;
    if (text == "") callBlankLine(mode, state);
    while (!stream.eol()) {
      readToken(mode, stream, state);
      stream.start = stream.pos;
    }
  }

  // Convert a style as returned by a mode (either null, or a string
  // containing one or more styles) to a CSS style. This is cached,
  // and also looks for line-wide styles.
  var styleToClassCache = {}, styleToClassCacheWithMode = {};
  function interpretTokenStyle(style, options) {
    if (!style || /^\s*$/.test(style)) return null;
    var cache = options.addModeClass ? styleToClassCacheWithMode : styleToClassCache;
    return cache[style] ||
      (cache[style] = style.replace(/\S+/g, "cm-$&"));
  }

  // Render the DOM representation of the text of a line. Also builds
  // up a 'line map', which points at the DOM nodes that represent
  // specific stretches of text, and is used by the measuring code.
  // The returned object contains the DOM node, this map, and
  // information about line-wide styles that were set by the mode.
  function buildLineContent(cm, lineView) {
    // The padding-right forces the element to have a 'border', which
    // is needed on Webkit to be able to get line-level bounding
    // rectangles for it (in measureChar).
    var content = elt("span", null, null, webkit ? "padding-right: .1px" : null);
    var builder = {pre: elt("pre", [content], "CodeMirror-line"), content: content,
                   col: 0, pos: 0, cm: cm,
                   splitSpaces: (ie || webkit) && cm.getOption("lineWrapping")};
    lineView.measure = {};

    // Iterate over the logical lines that make up this visual line.
    for (var i = 0; i <= (lineView.rest ? lineView.rest.length : 0); i++) {
      var line = i ? lineView.rest[i - 1] : lineView.line, order;
      builder.pos = 0;
      builder.addToken = buildToken;
      // Optionally wire in some hacks into the token-rendering
      // algorithm, to deal with browser quirks.
      if (hasBadBidiRects(cm.display.measure) && (order = getOrder(line)))
        builder.addToken = buildTokenBadBidi(builder.addToken, order);
      builder.map = [];
      var allowFrontierUpdate = lineView != cm.display.externalMeasured && lineNo(line);
      insertLineContent(line, builder, getLineStyles(cm, line, allowFrontierUpdate));
      if (line.styleClasses) {
        if (line.styleClasses.bgClass)
          builder.bgClass = joinClasses(line.styleClasses.bgClass, builder.bgClass || "");
        if (line.styleClasses.textClass)
          builder.textClass = joinClasses(line.styleClasses.textClass, builder.textClass || "");
      }

      // Ensure at least a single node is present, for measuring.
      if (builder.map.length == 0)
        builder.map.push(0, 0, builder.content.appendChild(zeroWidthElement(cm.display.measure)));

      // Store the map and a cache object for the current logical line
      if (i == 0) {
        lineView.measure.map = builder.map;
        lineView.measure.cache = {};
      } else {
        (lineView.measure.maps || (lineView.measure.maps = [])).push(builder.map);
        (lineView.measure.caches || (lineView.measure.caches = [])).push({});
      }
    }

    // See issue #2901
    if (webkit && /\bcm-tab\b/.test(builder.content.lastChild.className))
      builder.content.className = "cm-tab-wrap-hack";

    signal(cm, "renderLine", cm, lineView.line, builder.pre);
    if (builder.pre.className)
      builder.textClass = joinClasses(builder.pre.className, builder.textClass || "");

    return builder;
  }

  function defaultSpecialCharPlaceholder(ch) {
    var token = elt("span", "\u2022", "cm-invalidchar");
    token.title = "\\u" + ch.charCodeAt(0).toString(16);
    token.setAttribute("aria-label", token.title);
    return token;
  }

  // Build up the DOM representation for a single token, and add it to
  // the line map. Takes care to render special characters separately.
  function buildToken(builder, text, style, startStyle, endStyle, title, css) {
    if (!text) return;
    var displayText = builder.splitSpaces ? text.replace(/ {3,}/g, splitSpaces) : text;
    var special = builder.cm.state.specialChars, mustWrap = false;
    if (!special.test(text)) {
      builder.col += text.length;
      var content = document.createTextNode(displayText);
      builder.map.push(builder.pos, builder.pos + text.length, content);
      if (ie && ie_version < 9) mustWrap = true;
      builder.pos += text.length;
    } else {
      var content = document.createDocumentFragment(), pos = 0;
      while (true) {
        special.lastIndex = pos;
        var m = special.exec(text);
        var skipped = m ? m.index - pos : text.length - pos;
        if (skipped) {
          var txt = document.createTextNode(displayText.slice(pos, pos + skipped));
          if (ie && ie_version < 9) content.appendChild(elt("span", [txt]));
          else content.appendChild(txt);
          builder.map.push(builder.pos, builder.pos + skipped, txt);
          builder.col += skipped;
          builder.pos += skipped;
        }
        if (!m) break;
        pos += skipped + 1;
        if (m[0] == "\t") {
          var tabSize = builder.cm.options.tabSize, tabWidth = tabSize - builder.col % tabSize;
          var txt = content.appendChild(elt("span", spaceStr(tabWidth), "cm-tab"));
          txt.setAttribute("role", "presentation");
          txt.setAttribute("cm-text", "\t");
          builder.col += tabWidth;
        } else if (m[0] == "\r" || m[0] == "\n") {
          var txt = content.appendChild(elt("span", m[0] == "\r" ? "â" : "â¤", "cm-invalidchar"));
          txt.setAttribute("cm-text", m[0]);
          builder.col += 1;
        } else {
          var txt = builder.cm.options.specialCharPlaceholder(m[0]);
          txt.setAttribute("cm-text", m[0]);
          if (ie && ie_version < 9) content.appendChild(elt("span", [txt]));
          else content.appendChild(txt);
          builder.col += 1;
        }
        builder.map.push(builder.pos, builder.pos + 1, txt);
        builder.pos++;
      }
    }
    if (style || startStyle || endStyle || mustWrap || css) {
      var fullStyle = style || "";
      if (startStyle) fullStyle += startStyle;
      if (endStyle) fullStyle += endStyle;
      var token = elt("span", [content], fullStyle, css);
      if (title) token.title = title;
      return builder.content.appendChild(token);
    }
    builder.content.appendChild(content);
  }

  function splitSpaces(old) {
    var out = " ";
    for (var i = 0; i < old.length - 2; ++i) out += i % 2 ? " " : "\u00a0";
    out += " ";
    return out;
  }

  // Work around nonsense dimensions being reported for stretches of
  // right-to-left text.
  function buildTokenBadBidi(inner, order) {
    return function(builder, text, style, startStyle, endStyle, title, css) {
      style = style ? style + " cm-force-border" : "cm-force-border";
      var start = builder.pos, end = start + text.length;
      for (;;) {
        // Find the part that overlaps with the start of this text
        for (var i = 0; i < order.length; i++) {
          var part = order[i];
          if (part.to > start && part.from <= start) break;
        }
        if (part.to >= end) return inner(builder, text, style, startStyle, endStyle, title, css);
        inner(builder, text.slice(0, part.to - start), style, startStyle, null, title, css);
        startStyle = null;
        text = text.slice(part.to - start);
        start = part.to;
      }
    };
  }

  function buildCollapsedSpan(builder, size, marker, ignoreWidget) {
    var widget = !ignoreWidget && marker.widgetNode;
    if (widget) builder.map.push(builder.pos, builder.pos + size, widget);
    if (!ignoreWidget && builder.cm.display.input.needsContentAttribute) {
      if (!widget)
        widget = builder.content.appendChild(document.createElement("span"));
      widget.setAttribute("cm-marker", marker.id);
    }
    if (widget) {
      builder.cm.display.input.setUneditable(widget);
      builder.content.appendChild(widget);
    }
    builder.pos += size;
  }

  // Outputs a number of spans to make up a line, taking highlighting
  // and marked text into account.
  function insertLineContent(line, builder, styles) {
    var spans = line.markedSpans, allText = line.text, at = 0;
    if (!spans) {
      for (var i = 1; i < styles.length; i+=2)
        builder.addToken(builder, allText.slice(at, at = styles[i]), interpretTokenStyle(styles[i+1], builder.cm.options));
      return;
    }

    var len = allText.length, pos = 0, i = 1, text = "", style, css;
    var nextChange = 0, spanStyle, spanEndStyle, spanStartStyle, title, collapsed;
    for (;;) {
      if (nextChange == pos) { // Update current marker set
        spanStyle = spanEndStyle = spanStartStyle = title = css = "";
        collapsed = null; nextChange = Infinity;
        var foundBookmarks = [];
        for (var j = 0; j < spans.length; ++j) {
          var sp = spans[j], m = sp.marker;
          if (m.type == "bookmark" && sp.from == pos && m.widgetNode) {
            foundBookmarks.push(m);
          } else if (sp.from <= pos && (sp.to == null || sp.to > pos || m.collapsed && sp.to == pos && sp.from == pos)) {
            if (sp.to != null && sp.to != pos && nextChange > sp.to) {
              nextChange = sp.to;
              spanEndStyle = "";
            }
            if (m.className) spanStyle += " " + m.className;
            if (m.css) css = m.css;
            if (m.startStyle && sp.from == pos) spanStartStyle += " " + m.startStyle;
            if (m.endStyle && sp.to == nextChange) spanEndStyle += " " + m.endStyle;
            if (m.title && !title) title = m.title;
            if (m.collapsed && (!collapsed || compareCollapsedMarkers(collapsed.marker, m) < 0))
              collapsed = sp;
          } else if (sp.from > pos && nextChange > sp.from) {
            nextChange = sp.from;
          }
        }
        if (collapsed && (collapsed.from || 0) == pos) {
          buildCollapsedSpan(builder, (collapsed.to == null ? len + 1 : collapsed.to) - pos,
                             collapsed.marker, collapsed.from == null);
          if (collapsed.to == null) return;
          if (collapsed.to == pos) collapsed = false;
        }
        if (!collapsed && foundBookmarks.length) for (var j = 0; j < foundBookmarks.length; ++j)
          buildCollapsedSpan(builder, 0, foundBookmarks[j]);
      }
      if (pos >= len) break;

      var upto = Math.min(len, nextChange);
      while (true) {
        if (text) {
          var end = pos + text.length;
          if (!collapsed) {
            var tokenText = end > upto ? text.slice(0, upto - pos) : text;
            builder.addToken(builder, tokenText, style ? style + spanStyle : spanStyle,
                             spanStartStyle, pos + tokenText.length == nextChange ? spanEndStyle : "", title, css);
          }
          if (end >= upto) {text = text.slice(upto - pos); pos = upto; break;}
          pos = end;
          spanStartStyle = "";
        }
        text = allText.slice(at, at = styles[i++]);
        style = interpretTokenStyle(styles[i++], builder.cm.options);
      }
    }
  }

  // DOCUMENT DATA STRUCTURE

  // By default, updates that start and end at the beginning of a line
  // are treated specially, in order to make the association of line
  // widgets and marker elements with the text behave more intuitive.
  function isWholeLineUpdate(doc, change) {
    return change.from.ch == 0 && change.to.ch == 0 && lst(change.text) == "" &&
      (!doc.cm || doc.cm.options.wholeLineUpdateBefore);
  }

  // Perform a change on the document data structure.
  function updateDoc(doc, change, markedSpans, estimateHeight) {
    function spansFor(n) {return markedSpans ? markedSpans[n] : null;}
    function update(line, text, spans) {
      updateLine(line, text, spans, estimateHeight);
      signalLater(line, "change", line, change);
    }
    function linesFor(start, end) {
      for (var i = start, result = []; i < end; ++i)
        result.push(new Line(text[i], spansFor(i), estimateHeight));
      return result;
    }

    var from = change.from, to = change.to, text = change.text;
    var firstLine = getLine(doc, from.line), lastLine = getLine(doc, to.line);
    var lastText = lst(text), lastSpans = spansFor(text.length - 1), nlines = to.line - from.line;

    // Adjust the line structure
    if (change.full) {
      doc.insert(0, linesFor(0, text.length));
      doc.remove(text.length, doc.size - text.length);
    } else if (isWholeLineUpdate(doc, change)) {
      // This is a whole-line replace. Treated specially to make
      // sure line objects move the way they are supposed to.
      var added = linesFor(0, text.length - 1);
      update(lastLine, lastLine.text, lastSpans);
      if (nlines) doc.remove(from.line, nlines);
      if (added.length) doc.insert(from.line, added);
    } else if (firstLine == lastLine) {
      if (text.length == 1) {
        update(firstLine, firstLine.text.slice(0, from.ch) + lastText + firstLine.text.slice(to.ch), lastSpans);
      } else {
        var added = linesFor(1, text.length - 1);
        added.push(new Line(lastText + firstLine.text.slice(to.ch), lastSpans, estimateHeight));
        update(firstLine, firstLine.text.slice(0, from.ch) + text[0], spansFor(0));
        doc.insert(from.line + 1, added);
      }
    } else if (text.length == 1) {
      update(firstLine, firstLine.text.slice(0, from.ch) + text[0] + lastLine.text.slice(to.ch), spansFor(0));
      doc.remove(from.line + 1, nlines);
    } else {
      update(firstLine, firstLine.text.slice(0, from.ch) + text[0], spansFor(0));
      update(lastLine, lastText + lastLine.text.slice(to.ch), lastSpans);
      var added = linesFor(1, text.length - 1);
      if (nlines > 1) doc.remove(from.line + 1, nlines - 1);
      doc.insert(from.line + 1, added);
    }

    signalLater(doc, "change", doc, change);
  }

  // The document is represented as a BTree consisting of leaves, with
  // chunk of lines in them, and branches, with up to ten leaves or
  // other branch nodes below them. The top node is always a branch
  // node, and is the document object itself (meaning it has
  // additional methods and properties).
  //
  // All nodes have parent links. The tree is used both to go from
  // line numbers to line objects, and to go from objects to numbers.
  // It also indexes by height, and is used to convert between height
  // and line object, and to find the total height of the document.
  //
  // See also http://marijnhaverbeke.nl/blog/codemirror-line-tree.html

  function LeafChunk(lines) {
    this.lines = lines;
    this.parent = null;
    for (var i = 0, height = 0; i < lines.length; ++i) {
      lines[i].parent = this;
      height += lines[i].height;
    }
    this.height = height;
  }

  LeafChunk.prototype = {
    chunkSize: function() { return this.lines.length; },
    // Remove the n lines at offset 'at'.
    removeInner: function(at, n) {
      for (var i = at, e = at + n; i < e; ++i) {
        var line = this.lines[i];
        this.height -= line.height;
        cleanUpLine(line);
        signalLater(line, "delete");
      }
      this.lines.splice(at, n);
    },
    // Helper used to collapse a small branch into a single leaf.
    collapse: function(lines) {
      lines.push.apply(lines, this.lines);
    },
    // Insert the given array of lines at offset 'at', count them as
    // having the given height.
    insertInner: function(at, lines, height) {
      this.height += height;
      this.lines = this.lines.slice(0, at).concat(lines).concat(this.lines.slice(at));
      for (var i = 0; i < lines.length; ++i) lines[i].parent = this;
    },
    // Used to iterate over a part of the tree.
    iterN: function(at, n, op) {
      for (var e = at + n; at < e; ++at)
        if (op(this.lines[at])) return true;
    }
  };

  function BranchChunk(children) {
    this.children = children;
    var size = 0, height = 0;
    for (var i = 0; i < children.length; ++i) {
      var ch = children[i];
      size += ch.chunkSize(); height += ch.height;
      ch.parent = this;
    }
    this.size = size;
    this.height = height;
    this.parent = null;
  }

  BranchChunk.prototype = {
    chunkSize: function() { return this.size; },
    removeInner: function(at, n) {
      this.size -= n;
      for (var i = 0; i < this.children.length; ++i) {
        var child = this.children[i], sz = child.chunkSize();
        if (at < sz) {
          var rm = Math.min(n, sz - at), oldHeight = child.height;
          child.removeInner(at, rm);
          this.height -= oldHeight - child.height;
          if (sz == rm) { this.children.splice(i--, 1); child.parent = null; }
          if ((n -= rm) == 0) break;
          at = 0;
        } else at -= sz;
      }
      // If the result is smaller than 25 lines, ensure that it is a
      // single leaf node.
      if (this.size - n < 25 &&
          (this.children.length > 1 || !(this.children[0] instanceof LeafChunk))) {
        var lines = [];
        this.collapse(lines);
        this.children = [new LeafChunk(lines)];
        this.children[0].parent = this;
      }
    },
    collapse: function(lines) {
      for (var i = 0; i < this.children.length; ++i) this.children[i].collapse(lines);
    },
    insertInner: function(at, lines, height) {
      this.size += lines.length;
      this.height += height;
      for (var i = 0; i < this.children.length; ++i) {
        var child = this.children[i], sz = child.chunkSize();
        if (at <= sz) {
          child.insertInner(at, lines, height);
          if (child.lines && child.lines.length > 50) {
            while (child.lines.length > 50) {
              var spilled = child.lines.splice(child.lines.length - 25, 25);
              var newleaf = new LeafChunk(spilled);
              child.height -= newleaf.height;
              this.children.splice(i + 1, 0, newleaf);
              newleaf.parent = this;
            }
            this.maybeSpill();
          }
          break;
        }
        at -= sz;
      }
    },
    // When a node has grown, check whether it should be split.
    maybeSpill: function() {
      if (this.children.length <= 10) return;
      var me = this;
      do {
        var spilled = me.children.splice(me.children.length - 5, 5);
        var sibling = new BranchChunk(spilled);
        if (!me.parent) { // Become the parent node
          var copy = new BranchChunk(me.children);
          copy.parent = me;
          me.children = [copy, sibling];
          me = copy;
        } else {
          me.size -= sibling.size;
          me.height -= sibling.height;
          var myIndex = indexOf(me.parent.children, me);
          me.parent.children.splice(myIndex + 1, 0, sibling);
        }
        sibling.parent = me.parent;
      } while (me.children.length > 10);
      me.parent.maybeSpill();
    },
    iterN: function(at, n, op) {
      for (var i = 0; i < this.children.length; ++i) {
        var child = this.children[i], sz = child.chunkSize();
        if (at < sz) {
          var used = Math.min(n, sz - at);
          if (child.iterN(at, used, op)) return true;
          if ((n -= used) == 0) break;
          at = 0;
        } else at -= sz;
      }
    }
  };

  var nextDocId = 0;
  var Doc = CodeMirror.Doc = function(text, mode, firstLine, lineSep) {
    if (!(this instanceof Doc)) return new Doc(text, mode, firstLine, lineSep);
    if (firstLine == null) firstLine = 0;

    BranchChunk.call(this, [new LeafChunk([new Line("", null)])]);
    this.first = firstLine;
    this.scrollTop = this.scrollLeft = 0;
    this.cantEdit = false;
    this.cleanGeneration = 1;
    this.frontier = firstLine;
    var start = Pos(firstLine, 0);
    this.sel = simpleSelection(start);
    this.history = new History(null);
    this.id = ++nextDocId;
    this.modeOption = mode;
    this.lineSep = lineSep;

    if (typeof text == "string") text = this.splitLines(text);
    updateDoc(this, {from: start, to: start, text: text});
    setSelection(this, simpleSelection(start), sel_dontScroll);
  };

  Doc.prototype = createObj(BranchChunk.prototype, {
    constructor: Doc,
    // Iterate over the document. Supports two forms -- with only one
    // argument, it calls that for each line in the document. With
    // three, it iterates over the range given by the first two (with
    // the second being non-inclusive).
    iter: function(from, to, op) {
      if (op) this.iterN(from - this.first, to - from, op);
      else this.iterN(this.first, this.first + this.size, from);
    },

    // Non-public interface for adding and removing lines.
    insert: function(at, lines) {
      var height = 0;
      for (var i = 0; i < lines.length; ++i) height += lines[i].height;
      this.insertInner(at - this.first, lines, height);
    },
    remove: function(at, n) { this.removeInner(at - this.first, n); },

    // From here, the methods are part of the public interface. Most
    // are also available from CodeMirror (editor) instances.

    getValue: function(lineSep) {
      var lines = getLines(this, this.first, this.first + this.size);
      if (lineSep === false) return lines;
      return lines.join(lineSep || this.lineSeparator());
    },
    setValue: docMethodOp(function(code) {
      var top = Pos(this.first, 0), last = this.first + this.size - 1;
      makeChange(this, {from: top, to: Pos(last, getLine(this, last).text.length),
                        text: this.splitLines(code), origin: "setValue", full: true}, true);
      setSelection(this, simpleSelection(top));
    }),
    replaceRange: function(code, from, to, origin) {
      from = clipPos(this, from);
      to = to ? clipPos(this, to) : from;
      replaceRange(this, code, from, to, origin);
    },
    getRange: function(from, to, lineSep) {
      var lines = getBetween(this, clipPos(this, from), clipPos(this, to));
      if (lineSep === false) return lines;
      return lines.join(lineSep || this.lineSeparator());
    },

    getLine: function(line) {var l = this.getLineHandle(line); return l && l.text;},

    getLineHandle: function(line) {if (isLine(this, line)) return getLine(this, line);},
    getLineNumber: function(line) {return lineNo(line);},

    getLineHandleVisualStart: function(line) {
      if (typeof line == "number") line = getLine(this, line);
      return visualLine(line);
    },

    lineCount: function() {return this.size;},
    firstLine: function() {return this.first;},
    lastLine: function() {return this.first + this.size - 1;},

    clipPos: function(pos) {return clipPos(this, pos);},

    getCursor: function(start) {
      var range = this.sel.primary(), pos;
      if (start == null || start == "head") pos = range.head;
      else if (start == "anchor") pos = range.anchor;
      else if (start == "end" || start == "to" || start === false) pos = range.to();
      else pos = range.from();
      return pos;
    },
    listSelections: function() { return this.sel.ranges; },
    somethingSelected: function() {return this.sel.somethingSelected();},

    setCursor: docMethodOp(function(line, ch, options) {
      setSimpleSelection(this, clipPos(this, typeof line == "number" ? Pos(line, ch || 0) : line), null, options);
    }),
    setSelection: docMethodOp(function(anchor, head, options) {
      setSimpleSelection(this, clipPos(this, anchor), clipPos(this, head || anchor), options);
    }),
    extendSelection: docMethodOp(function(head, other, options) {
      extendSelection(this, clipPos(this, head), other && clipPos(this, other), options);
    }),
    extendSelections: docMethodOp(function(heads, options) {
      extendSelections(this, clipPosArray(this, heads, options));
    }),
    extendSelectionsBy: docMethodOp(function(f, options) {
      extendSelections(this, map(this.sel.ranges, f), options);
    }),
    setSelections: docMethodOp(function(ranges, primary, options) {
      if (!ranges.length) return;
      for (var i = 0, out = []; i < ranges.length; i++)
        out[i] = new Range(clipPos(this, ranges[i].anchor),
                           clipPos(this, ranges[i].head));
      if (primary == null) primary = Math.min(ranges.length - 1, this.sel.primIndex);
      setSelection(this, normalizeSelection(out, primary), options);
    }),
    addSelection: docMethodOp(function(anchor, head, options) {
      var ranges = this.sel.ranges.slice(0);
      ranges.push(new Range(clipPos(this, anchor), clipPos(this, head || anchor)));
      setSelection(this, normalizeSelection(ranges, ranges.length - 1), options);
    }),

    getSelection: function(lineSep) {
      var ranges = this.sel.ranges, lines;
      for (var i = 0; i < ranges.length; i++) {
        var sel = getBetween(this, ranges[i].from(), ranges[i].to());
        lines = lines ? lines.concat(sel) : sel;
      }
      if (lineSep === false) return lines;
      else return lines.join(lineSep || this.lineSeparator());
    },
    getSelections: function(lineSep) {
      var parts = [], ranges = this.sel.ranges;
      for (var i = 0; i < ranges.length; i++) {
        var sel = getBetween(this, ranges[i].from(), ranges[i].to());
        if (lineSep !== false) sel = sel.join(lineSep || this.lineSeparator());
        parts[i] = sel;
      }
      return parts;
    },
    replaceSelection: function(code, collapse, origin) {
      var dup = [];
      for (var i = 0; i < this.sel.ranges.length; i++)
        dup[i] = code;
      this.replaceSelections(dup, collapse, origin || "+input");
    },
    replaceSelections: docMethodOp(function(code, collapse, origin) {
      var changes = [], sel = this.sel;
      for (var i = 0; i < sel.ranges.length; i++) {
        var range = sel.ranges[i];
        changes[i] = {from: range.from(), to: range.to(), text: this.splitLines(code[i]), origin: origin};
      }
      var newSel = collapse && collapse != "end" && computeReplacedSel(this, changes, collapse);
      for (var i = changes.length - 1; i >= 0; i--)
        makeChange(this, changes[i]);
      if (newSel) setSelectionReplaceHistory(this, newSel);
      else if (this.cm) ensureCursorVisible(this.cm);
    }),
    undo: docMethodOp(function() {makeChangeFromHistory(this, "undo");}),
    redo: docMethodOp(function() {makeChangeFromHistory(this, "redo");}),
    undoSelection: docMethodOp(function() {makeChangeFromHistory(this, "undo", true);}),
    redoSelection: docMethodOp(function() {makeChangeFromHistory(this, "redo", true);}),

    setExtending: function(val) {this.extend = val;},
    getExtending: function() {return this.extend;},

    historySize: function() {
      var hist = this.history, done = 0, undone = 0;
      for (var i = 0; i < hist.done.length; i++) if (!hist.done[i].ranges) ++done;
      for (var i = 0; i < hist.undone.length; i++) if (!hist.undone[i].ranges) ++undone;
      return {undo: done, redo: undone};
    },
    clearHistory: function() {this.history = new History(this.history.maxGeneration);},

    markClean: function() {
      this.cleanGeneration = this.changeGeneration(true);
    },
    changeGeneration: function(forceSplit) {
      if (forceSplit)
        this.history.lastOp = this.history.lastSelOp = this.history.lastOrigin = null;
      return this.history.generation;
    },
    isClean: function (gen) {
      return this.history.generation == (gen || this.cleanGeneration);
    },

    getHistory: function() {
      return {done: copyHistoryArray(this.history.done),
              undone: copyHistoryArray(this.history.undone)};
    },
    setHistory: function(histData) {
      var hist = this.history = new History(this.history.maxGeneration);
      hist.done = copyHistoryArray(histData.done.slice(0), null, true);
      hist.undone = copyHistoryArray(histData.undone.slice(0), null, true);
    },

    addLineClass: docMethodOp(function(handle, where, cls) {
      return changeLine(this, handle, where == "gutter" ? "gutter" : "class", function(line) {
        var prop = where == "text" ? "textClass"
                 : where == "background" ? "bgClass"
                 : where == "gutter" ? "gutterClass" : "wrapClass";
        if (!line[prop]) line[prop] = cls;
        else if (classTest(cls).test(line[prop])) return false;
        else line[prop] += " " + cls;
        return true;
      });
    }),
    removeLineClass: docMethodOp(function(handle, where, cls) {
      return changeLine(this, handle, where == "gutter" ? "gutter" : "class", function(line) {
        var prop = where == "text" ? "textClass"
                 : where == "background" ? "bgClass"
                 : where == "gutter" ? "gutterClass" : "wrapClass";
        var cur = line[prop];
        if (!cur) return false;
        else if (cls == null) line[prop] = null;
        else {
          var found = cur.match(classTest(cls));
          if (!found) return false;
          var end = found.index + found[0].length;
          line[prop] = cur.slice(0, found.index) + (!found.index || end == cur.length ? "" : " ") + cur.slice(end) || null;
        }
        return true;
      });
    }),

    addLineWidget: docMethodOp(function(handle, node, options) {
      return addLineWidget(this, handle, node, options);
    }),
    removeLineWidget: function(widget) { widget.clear(); },

    markText: function(from, to, options) {
      return markText(this, clipPos(this, from), clipPos(this, to), options, "range");
    },
    setBookmark: function(pos, options) {
      var realOpts = {replacedWith: options && (options.nodeType == null ? options.widget : options),
                      insertLeft: options && options.insertLeft,
                      clearWhenEmpty: false, shared: options && options.shared,
                      handleMouseEvents: options && options.handleMouseEvents};
      pos = clipPos(this, pos);
      return markText(this, pos, pos, realOpts, "bookmark");
    },
    findMarksAt: function(pos) {
      pos = clipPos(this, pos);
      var markers = [], spans = getLine(this, pos.line).markedSpans;
      if (spans) for (var i = 0; i < spans.length; ++i) {
        var span = spans[i];
        if ((span.from == null || span.from <= pos.ch) &&
            (span.to == null || span.to >= pos.ch))
          markers.push(span.marker.parent || span.marker);
      }
      return markers;
    },
    findMarks: function(from, to, filter) {
      from = clipPos(this, from); to = clipPos(this, to);
      var found = [], lineNo = from.line;
      this.iter(from.line, to.line + 1, function(line) {
        var spans = line.markedSpans;
        if (spans) for (var i = 0; i < spans.length; i++) {
          var span = spans[i];
          if (!(lineNo == from.line && from.ch > span.to ||
                span.from == null && lineNo != from.line||
                lineNo == to.line && span.from > to.ch) &&
              (!filter || filter(span.marker)))
            found.push(span.marker.parent || span.marker);
        }
        ++lineNo;
      });
      return found;
    },
    getAllMarks: function() {
      var markers = [];
      this.iter(function(line) {
        var sps = line.markedSpans;
        if (sps) for (var i = 0; i < sps.length; ++i)
          if (sps[i].from != null) markers.push(sps[i].marker);
      });
      return markers;
    },

    posFromIndex: function(off) {
      var ch, lineNo = this.first;
      this.iter(function(line) {
        var sz = line.text.length + 1;
        if (sz > off) { ch = off; return true; }
        off -= sz;
        ++lineNo;
      });
      return clipPos(this, Pos(lineNo, ch));
    },
    indexFromPos: function (coords) {
      coords = clipPos(this, coords);
      var index = coords.ch;
      if (coords.line < this.first || coords.ch < 0) return 0;
      this.iter(this.first, coords.line, function (line) {
        index += line.text.length + 1;
      });
      return index;
    },

    copy: function(copyHistory) {
      var doc = new Doc(getLines(this, this.first, this.first + this.size),
                        this.modeOption, this.first, this.lineSep);
      doc.scrollTop = this.scrollTop; doc.scrollLeft = this.scrollLeft;
      doc.sel = this.sel;
      doc.extend = false;
      if (copyHistory) {
        doc.history.undoDepth = this.history.undoDepth;
        doc.setHistory(this.getHistory());
      }
      return doc;
    },

    linkedDoc: function(options) {
      if (!options) options = {};
      var from = this.first, to = this.first + this.size;
      if (options.from != null && options.from > from) from = options.from;
      if (options.to != null && options.to < to) to = options.to;
      var copy = new Doc(getLines(this, from, to), options.mode || this.modeOption, from, this.lineSep);
      if (options.sharedHist) copy.history = this.history;
      (this.linked || (this.linked = [])).push({doc: copy, sharedHist: options.sharedHist});
      copy.linked = [{doc: this, isParent: true, sharedHist: options.sharedHist}];
      copySharedMarkers(copy, findSharedMarkers(this));
      return copy;
    },
    unlinkDoc: function(other) {
      if (other instanceof CodeMirror) other = other.doc;
      if (this.linked) for (var i = 0; i < this.linked.length; ++i) {
        var link = this.linked[i];
        if (link.doc != other) continue;
        this.linked.splice(i, 1);
        other.unlinkDoc(this);
        detachSharedMarkers(findSharedMarkers(this));
        break;
      }
      // If the histories were shared, split them again
      if (other.history == this.history) {
        var splitIds = [other.id];
        linkedDocs(other, function(doc) {splitIds.push(doc.id);}, true);
        other.history = new History(null);
        other.history.done = copyHistoryArray(this.history.done, splitIds);
        other.history.undone = copyHistoryArray(this.history.undone, splitIds);
      }
    },
    iterLinkedDocs: function(f) {linkedDocs(this, f);},

    getMode: function() {return this.mode;},
    getEditor: function() {return this.cm;},

    splitLines: function(str) {
      if (this.lineSep) return str.split(this.lineSep);
      return splitLinesAuto(str);
    },
    lineSeparator: function() { return this.lineSep || "\n"; }
  });

  // Public alias.
  Doc.prototype.eachLine = Doc.prototype.iter;

  // Set up methods on CodeMirror's prototype to redirect to the editor's document.
  var dontDelegate = "iter insert remove copy getEditor constructor".split(" ");
  for (var prop in Doc.prototype) if (Doc.prototype.hasOwnProperty(prop) && indexOf(dontDelegate, prop) < 0)
    CodeMirror.prototype[prop] = (function(method) {
      return function() {return method.apply(this.doc, arguments);};
    })(Doc.prototype[prop]);

  eventMixin(Doc);

  // Call f for all linked documents.
  function linkedDocs(doc, f, sharedHistOnly) {
    function propagate(doc, skip, sharedHist) {
      if (doc.linked) for (var i = 0; i < doc.linked.length; ++i) {
        var rel = doc.linked[i];
        if (rel.doc == skip) continue;
        var shared = sharedHist && rel.sharedHist;
        if (sharedHistOnly && !shared) continue;
        f(rel.doc, shared);
        propagate(rel.doc, doc, shared);
      }
    }
    propagate(doc, null, true);
  }

  // Attach a document to an editor.
  function attachDoc(cm, doc) {
    if (doc.cm) throw new Error("This document is already in use.");
    cm.doc = doc;
    doc.cm = cm;
    estimateLineHeights(cm);
    loadMode(cm);
    if (!cm.options.lineWrapping) findMaxLine(cm);
    cm.options.mode = doc.modeOption;
    regChange(cm);
  }

  // LINE UTILITIES

  // Find the line object corresponding to the given line number.
  function getLine(doc, n) {
    n -= doc.first;
    if (n < 0 || n >= doc.size) throw new Error("There is no line " + (n + doc.first) + " in the document.");
    for (var chunk = doc; !chunk.lines;) {
      for (var i = 0;; ++i) {
        var child = chunk.children[i], sz = child.chunkSize();
        if (n < sz) { chunk = child; break; }
        n -= sz;
      }
    }
    return chunk.lines[n];
  }

  // Get the part of a document between two positions, as an array of
  // strings.
  function getBetween(doc, start, end) {
    var out = [], n = start.line;
    doc.iter(start.line, end.line + 1, function(line) {
      var text = line.text;
      if (n == end.line) text = text.slice(0, end.ch);
      if (n == start.line) text = text.slice(start.ch);
      out.push(text);
      ++n;
    });
    return out;
  }
  // Get the lines between from and to, as array of strings.
  function getLines(doc, from, to) {
    var out = [];
    doc.iter(from, to, function(line) { out.push(line.text); });
    return out;
  }

  // Update the height of a line, propagating the height change
  // upwards to parent nodes.
  function updateLineHeight(line, height) {
    var diff = height - line.height;
    if (diff) for (var n = line; n; n = n.parent) n.height += diff;
  }

  // Given a line object, find its line number by walking up through
  // its parent links.
  function lineNo(line) {
    if (line.parent == null) return null;
    var cur = line.parent, no = indexOf(cur.lines, line);
    for (var chunk = cur.parent; chunk; cur = chunk, chunk = chunk.parent) {
      for (var i = 0;; ++i) {
        if (chunk.children[i] == cur) break;
        no += chunk.children[i].chunkSize();
      }
    }
    return no + cur.first;
  }

  // Find the line at the given vertical position, using the height
  // information in the document tree.
  function lineAtHeight(chunk, h) {
    var n = chunk.first;
    outer: do {
      for (var i = 0; i < chunk.children.length; ++i) {
        var child = chunk.children[i], ch = child.height;
        if (h < ch) { chunk = child; continue outer; }
        h -= ch;
        n += child.chunkSize();
      }
      return n;
    } while (!chunk.lines);
    for (var i = 0; i < chunk.lines.length; ++i) {
      var line = chunk.lines[i], lh = line.height;
      if (h < lh) break;
      h -= lh;
    }
    return n + i;
  }


  // Find the height above the given line.
  function heightAtLine(lineObj) {
    lineObj = visualLine(lineObj);

    var h = 0, chunk = lineObj.parent;
    for (var i = 0; i < chunk.lines.length; ++i) {
      var line = chunk.lines[i];
      if (line == lineObj) break;
      else h += line.height;
    }
    for (var p = chunk.parent; p; chunk = p, p = chunk.parent) {
      for (var i = 0; i < p.children.length; ++i) {
        var cur = p.children[i];
        if (cur == chunk) break;
        else h += cur.height;
      }
    }
    return h;
  }

  // Get the bidi ordering for the given line (and cache it). Returns
  // false for lines that are fully left-to-right, and an array of
  // BidiSpan objects otherwise.
  function getOrder(line) {
    var order = line.order;
    if (order == null) order = line.order = bidiOrdering(line.text);
    return order;
  }

  // HISTORY

  function History(startGen) {
    // Arrays of change events and selections. Doing something adds an
    // event to done and clears undo. Undoing moves events from done
    // to undone, redoing moves them in the other direction.
    this.done = []; this.undone = [];
    this.undoDepth = Infinity;
    // Used to track when changes can be merged into a single undo
    // event
    this.lastModTime = this.lastSelTime = 0;
    this.lastOp = this.lastSelOp = null;
    this.lastOrigin = this.lastSelOrigin = null;
    // Used by the isClean() method
    this.generation = this.maxGeneration = startGen || 1;
  }

  // Create a history change event from an updateDoc-style change
  // object.
  function historyChangeFromChange(doc, change) {
    var histChange = {from: copyPos(change.from), to: changeEnd(change), text: getBetween(doc, change.from, change.to)};
    attachLocalSpans(doc, histChange, change.from.line, change.to.line + 1);
    linkedDocs(doc, function(doc) {attachLocalSpans(doc, histChange, change.from.line, change.to.line + 1);}, true);
    return histChange;
  }

  // Pop all selection events off the end of a history array. Stop at
  // a change event.
  function clearSelectionEvents(array) {
    while (array.length) {
      var last = lst(array);
      if (last.ranges) array.pop();
      else break;
    }
  }

  // Find the top change event in the history. Pop off selection
  // events that are in the way.
  function lastChangeEvent(hist, force) {
    if (force) {
      clearSelectionEvents(hist.done);
      return lst(hist.done);
    } else if (hist.done.length && !lst(hist.done).ranges) {
      return lst(hist.done);
    } else if (hist.done.length > 1 && !hist.done[hist.done.length - 2].ranges) {
      hist.done.pop();
      return lst(hist.done);
    }
  }

  // Register a change in the history. Merges changes that are within
  // a single operation, ore are close together with an origin that
  // allows merging (starting with "+") into a single event.
  function addChangeToHistory(doc, change, selAfter, opId) {
    var hist = doc.history;
    hist.undone.length = 0;
    var time = +new Date, cur;

    if ((hist.lastOp == opId ||
         hist.lastOrigin == change.origin && change.origin &&
         ((change.origin.charAt(0) == "+" && doc.cm && hist.lastModTime > time - doc.cm.options.historyEventDelay) ||
          change.origin.charAt(0) == "*")) &&
        (cur = lastChangeEvent(hist, hist.lastOp == opId))) {
      // Merge this change into the last event
      var last = lst(cur.changes);
      if (cmp(change.from, change.to) == 0 && cmp(change.from, last.to) == 0) {
        // Optimized case for simple insertion -- don't want to add
        // new changesets for every character typed
        last.to = changeEnd(change);
      } else {
        // Add new sub-event
        cur.changes.push(historyChangeFromChange(doc, change));
      }
    } else {
      // Can not be merged, start a new event.
      var before = lst(hist.done);
      if (!before || !before.ranges)
        pushSelectionToHistory(doc.sel, hist.done);
      cur = {changes: [historyChangeFromChange(doc, change)],
             generation: hist.generation};
      hist.done.push(cur);
      while (hist.done.length > hist.undoDepth) {
        hist.done.shift();
        if (!hist.done[0].ranges) hist.done.shift();
      }
    }
    hist.done.push(selAfter);
    hist.generation = ++hist.maxGeneration;
    hist.lastModTime = hist.lastSelTime = time;
    hist.lastOp = hist.lastSelOp = opId;
    hist.lastOrigin = hist.lastSelOrigin = change.origin;

    if (!last) signal(doc, "historyAdded");
  }

  function selectionEventCanBeMerged(doc, origin, prev, sel) {
    var ch = origin.charAt(0);
    return ch == "*" ||
      ch == "+" &&
      prev.ranges.length == sel.ranges.length &&
      prev.somethingSelected() == sel.somethingSelected() &&
      new Date - doc.history.lastSelTime <= (doc.cm ? doc.cm.options.historyEventDelay : 500);
  }

  // Called whenever the selection changes, sets the new selection as
  // the pending selection in the history, and pushes the old pending
  // selection into the 'done' array when it was significantly
  // different (in number of selected ranges, emptiness, or time).
  function addSelectionToHistory(doc, sel, opId, options) {
    var hist = doc.history, origin = options && options.origin;

    // A new event is started when the previous origin does not match
    // the current, or the origins don't allow matching. Origins
    // starting with * are always merged, those starting with + are
    // merged when similar and close together in time.
    if (opId == hist.lastSelOp ||
        (origin && hist.lastSelOrigin == origin &&
         (hist.lastModTime == hist.lastSelTime && hist.lastOrigin == origin ||
          selectionEventCanBeMerged(doc, origin, lst(hist.done), sel))))
      hist.done[hist.done.length - 1] = sel;
    else
      pushSelectionToHistory(sel, hist.done);

    hist.lastSelTime = +new Date;
    hist.lastSelOrigin = origin;
    hist.lastSelOp = opId;
    if (options && options.clearRedo !== false)
      clearSelectionEvents(hist.undone);
  }

  function pushSelectionToHistory(sel, dest) {
    var top = lst(dest);
    if (!(top && top.ranges && top.equals(sel)))
      dest.push(sel);
  }

  // Used to store marked span information in the history.
  function attachLocalSpans(doc, change, from, to) {
    var existing = change["spans_" + doc.id], n = 0;
    doc.iter(Math.max(doc.first, from), Math.min(doc.first + doc.size, to), function(line) {
      if (line.markedSpans)
        (existing || (existing = change["spans_" + doc.id] = {}))[n] = line.markedSpans;
      ++n;
    });
  }

  // When un/re-doing restores text containing marked spans, those
  // that have been explicitly cleared should not be restored.
  function removeClearedSpans(spans) {
    if (!spans) return null;
    for (var i = 0, out; i < spans.length; ++i) {
      if (spans[i].marker.explicitlyCleared) { if (!out) out = spans.slice(0, i); }
      else if (out) out.push(spans[i]);
    }
    return !out ? spans : out.length ? out : null;
  }

  // Retrieve and filter the old marked spans stored in a change event.
  function getOldSpans(doc, change) {
    var found = change["spans_" + doc.id];
    if (!found) return null;
    for (var i = 0, nw = []; i < change.text.length; ++i)
      nw.push(removeClearedSpans(found[i]));
    return nw;
  }

  // Used both to provide a JSON-safe object in .getHistory, and, when
  // detaching a document, to split the history in two
  function copyHistoryArray(events, newGroup, instantiateSel) {
    for (var i = 0, copy = []; i < events.length; ++i) {
      var event = events[i];
      if (event.ranges) {
        copy.push(instantiateSel ? Selection.prototype.deepCopy.call(event) : event);
        continue;
      }
      var changes = event.changes, newChanges = [];
      copy.push({changes: newChanges});
      for (var j = 0; j < changes.length; ++j) {
        var change = changes[j], m;
        newChanges.push({from: change.from, to: change.to, text: change.text});
        if (newGroup) for (var prop in change) if (m = prop.match(/^spans_(\d+)$/)) {
          if (indexOf(newGroup, Number(m[1])) > -1) {
            lst(newChanges)[prop] = change[prop];
            delete change[prop];
          }
        }
      }
    }
    return copy;
  }

  // Rebasing/resetting history to deal with externally-sourced changes

  function rebaseHistSelSingle(pos, from, to, diff) {
    if (to < pos.line) {
      pos.line += diff;
    } else if (from < pos.line) {
      pos.line = from;
      pos.ch = 0;
    }
  }

  // Tries to rebase an array of history events given a change in the
  // document. If the change touches the same lines as the event, the
  // event, and everything 'behind' it, is discarded. If the change is
  // before the event, the event's positions are updated. Uses a
  // copy-on-write scheme for the positions, to avoid having to
  // reallocate them all on every rebase, but also avoid problems with
  // shared position objects being unsafely updated.
  function rebaseHistArray(array, from, to, diff) {
    for (var i = 0; i < array.length; ++i) {
      var sub = array[i], ok = true;
      if (sub.ranges) {
        if (!sub.copied) { sub = array[i] = sub.deepCopy(); sub.copied = true; }
        for (var j = 0; j < sub.ranges.length; j++) {
          rebaseHistSelSingle(sub.ranges[j].anchor, from, to, diff);
          rebaseHistSelSingle(sub.ranges[j].head, from, to, diff);
        }
        continue;
      }
      for (var j = 0; j < sub.changes.length; ++j) {
        var cur = sub.changes[j];
        if (to < cur.from.line) {
          cur.from = Pos(cur.from.line + diff, cur.from.ch);
          cur.to = Pos(cur.to.line + diff, cur.to.ch);
        } else if (from <= cur.to.line) {
          ok = false;
          break;
        }
      }
      if (!ok) {
        array.splice(0, i + 1);
        i = 0;
      }
    }
  }

  function rebaseHist(hist, change) {
    var from = change.from.line, to = change.to.line, diff = change.text.length - (to - from) - 1;
    rebaseHistArray(hist.done, from, to, diff);
    rebaseHistArray(hist.undone, from, to, diff);
  }

  // EVENT UTILITIES

  // Due to the fact that we still support jurassic IE versions, some
  // compatibility wrappers are needed.

  var e_preventDefault = CodeMirror.e_preventDefault = function(e) {
    if (e.preventDefault) e.preventDefault();
    else e.returnValue = false;
  };
  var e_stopPropagation = CodeMirror.e_stopPropagation = function(e) {
    if (e.stopPropagation) e.stopPropagation();
    else e.cancelBubble = true;
  };
  function e_defaN`‡&m°Ïk«
“F¸Ú ÿóly¦ÜkB B  ŒD¢ˆÜDF&'*	ƒ0„Ü§Pý:eúw:7   …¾ïÈB7&ý@‰Óízâ±øúô©ñ·T/"~  ˆ ÐAë!sHPâú#Å'H§µSz7Ìá*Æ|³>©° €`wF kz1—;Éhö Pþÿœ	qªp%épR!  Ÿ™™÷ÖÐK—=é(Š`**ô9ú ¤è€¯syš   “3™b‰Ü»æ@@-¢æ?•2"T4Ý¨ƒgU B  ­bB\çåúñ‹x·m i2¯çÂ÷×º‡   û:…ØŒ/Š2¶°nW+‡Ã’'®||}Ÿ3  B ¯tÂWÒâÀîÇ‡Bà_ãqšzÏ¾þ>…ÜB  @¦}´Ð-Oº*Në1"i'À‡×1àðÙdmÈFûà  „,OÂ9HlúÂÀfÈá¾ô®¦)ðNðÀ5Yˆ  €:Æ0 %ö+<À?ç’ŠësÁ#[r MûG4áúY¾B !  šÉ¶‚­@Z¡’Båuª,š$‚g«7É   šTÙøN*A½‰Ñ *›{"hŒø“×DWÞ  B ¬3¸¾Øà0ŸO&-¨8²›vçÈiãm§xQÛ   õ £@IÆ(”¢ƒÇXÚÖià“vbûsÿÙKm  BPÃÒ½æúPä5Ü Gu¢ÇoÅ%×’½©Í`â´„  @¯|tÀ©IóÎ°8·¥}Ù£ÆIÛpàƒŽ¹2Þ€  è“Ê;§äzW2Œ€%œmM¿.´€x§Ä))8â!  Â71G~ºõÒ“£ÆþEâìF)9ÿÃœÚUÓÛ-]L € eâwãÇé 0š}nýy»êÈ¨˜r_ßA  ‰Cì¯j°g¯¸`-sT²æ9vsïÞ­3bÇ´ÏÒ €ÂÀ¡n™ Iï…ÓØ›e¢“!ºöŒJ¤6ð»r±Ð  wn3$iTü>K¥¦t¾ëêåŠ
ÑË0à¥'U	 €˜ùs„>ÌÙèþB=A{—Éð.	œxúbÔ¾¨€  ÏS6‰¸Y,™m»Y{« NúÁI 8GL÷Bî  €»y)„x|DúB9„†ÏÖ—Ú²¬W”r²Ÿ € ¶šää¿H’´ H6‡CAñ_Y÷
¸‘ê•ã¡PW  S~Qt0
¬ ü€ÆÚEXå%‘š¬×±=¢°Øà  !@€ý§=+S—X¢2!ö|/ZŒ˜¥:URPB  –ïº3mÙùJ}]AÇ³(òÆ’³šŠÐ`pWŸ£¬@  cPT[ÎàëuŸ—RY ¹ÛZpÝïïšh¢5ù7\ „  „èOm˜,¾|ÃPÇ€&4xcšhü_	¡áê € ìËãgµzd¤	Úø%½Ç¼ý=`;œP³¹g   NgÖ H	%ýH9BTñòF ­'c“Èœåë’  B°WÍšÒ9õê¤[&%ûàIG~Bô#ØÀXæD   ~‰Œ¦}ŠRœÌmæ*¹ßozM©àÐAZaì   R¥5Ú2¸X=éq §¥3ãàÎ€ßo(  Ë7÷ÿÿÿ E±¹S              ŒŸ*Ý|mé]>§ðN …€î™…(  ×Õ¨€  ˆ¿Ãó¸î©©ŽÐuÇ  O¡Ðf†âÑÉ>âG  ‘Wfc…Ó`Bc¬‡Gµ[9l=Xú_äÌ±> € R_³r¿vœ ªycnWnªjY)àx¬5eDý  q¹zž«0<¦ZÀÎ#i«wÔÕwV+pyNÛÄ €-@}y§˜Ö™d¬ÓèTÇrN›(P  ñ}+ßZ›Ìm³ž«Ž×ZfÊwÊS`yÛ´E €¬kl:Åó#îß-ùÒ¢_|	–Ñpo?"™¹a€  oö8¿áçÖ”‚‚$<Z¬¸€‘O:Ý=¡)ZÈ  n,ó5H…­gý‚·OºnqÓŸÐ77|nž—^   Ô¸©tÐÔ» O‘äzœvñW%ˆ–ríÝ-˜  œlÃ°i±o9çTOZà›EÌý9ôt½ˆ.ÝÅ²  !ÀÉôÿƒ>Þ·ùrÙ/?ßóT+»EE!Ð5!  ­³í›K1/"ÃúZÈÖ¥.XWÝÙàØZ-ñ  ¢ZEô¨£šÎñq™C»Ü¶5ðk Ò÷;óK€  ˆ-uœECz;ÕerÚ PúçJZr’Ú^83M  #´Ó4þºÜ?Mo™2n|A¼÷*&Q…ÓeQ € (œu =Ï’´ ^L9}Œ’¬Å¹â5âBb \¡“  sÝÛ¦0%ÛÙPî!J¼Pôu¿ÉÆ#™å÷ ]&ø €@PKþºáþ¶È:-Âe¹šB~Î]÷GüÝP  |àØ–ÀeFÏ/l6‰÷3–ÞÖs· `QW( €Ä×Z¦šªåçáìžáûd×8æp+&Tý¦K€  9a–‰¦î×Ù" WÀüÌ
2€_jwïNÞ!Öö2m  vx •^P^XÂÕ²(¥ŠÇxªåA.Ð<s1V¢. € k«h±ÝrNC” ^ºà{g¥3ó·À8¡˜ÚÔŽ  è+¸°XßJÕR?Š¢¸;çìPÔàÖÓGV €GÀbeü¤íc.øÈg[›^h;eºOoiÐ  8c0b:w=É5ušµGâ…ðÖÑyz‘àÃÓk €ä·½»4-ëéMÑÝâ0ü²§2ðÀÑâÿ/”ì@  fâ$¤n	ÎÀ{—À`vÿ´êÞ Qúó*H{.o£%@Å „  ÐNJ€IthßåDFéÔì‘µ:q­ öµÊîÐ € ÕM¼Yòåî F²ä»ƒ69WþßoY·ßŒ  Iƒu¯•01	ÔBýZ#‹­¢ÄåˆÅtTGò/Q €@@?›k*™ŸNÿê¯ÔrçRöˆå'ékèW¸+P  :Ê<Ò­ä}Ï~ÛÇô*U|¼pèjíšòÜü`j§c  €úD-+ŸA…Vˆ%Š‡àÈð:­¥pV’àš õ~ë;¦ B  yüH<b›v¡zrì$>Á€¨Ü“94_ÌUûg   øÃøËU-ÂY›™¹zú­ï³ß“N[uþæ+ñc  B å»›e¹5 ]`}äŠ4[SUÎJÄÎ   Ï•°MyÓ.£Å.|€URàŠ{¥¤4½­Óô  BÀ¦@xHŸ`yòlì×nõûÉ—¤¬ipn–Ðþ®B   —Vž nï*Z¥ü$Ûé Æ$Â‡)­àæ§Ý7”   Ñ~7xY±ùï{}›J3QÊÌJð3¤Æƒ£o9Þ !  µÂð%´ç^Íôä·Ù RúÍQgÏ•‡ôEa¹ú  S´Ñ Û7"2SÂñ­ç#Ño±)=¢nÒõ¯‹è  " ´P/¼U…ò» ó/ñúÛ5Ÿ±ŸR­IØDËÚúÏ  @Í`y0/µà
9^5Á5àæŠFT¦ì§2é*¢@  „êùW€Ys“¯‚„ÄáÈ[ßÿµË!P"W„  @Äpeé´ #eÙäy:P/á1öß`V+wá@  £f5ö^X1Kšè_oe¢…p]øÞ$¤[” „  —-i«þ/V½‘Ê&A’€ŠáçWÓ½v­ì<ÑËvÑ @ I÷y|Õß”oFÅÝ\ÙàË‡ùÛõ¯KŸ¹†Ë  6e¥ˆ õØ}J?¶ØZoŠX€}§ŸLeŒ°Ü €‚°cäaÕ„>ÜFý“á´?Ì…ÁòuÛS7Œ¥À  …"ÑðeAoE®Ý¸:É9f£pëÏ¹ÐÁ £2 €¥1ºÊ6þŠV¹äSñã/<e°D&à|7<B4    3Ù2„cþ€Ý‹Œ iëðLGé:qS>•Ž3Ì  !}ù”i?îaÇ¶´Ê SúOIñ89ÿžyÔ‚FGxn € 1ÜÊ°qPEÃT³ÿ 9òº$Y:ÛÄÓ¿¸$  Ûmd³ tùáŽÉ—ªðZÄ4´ØPNü@?£Û7: €Ì0ýúÞ¤{ú­{áÞÍ†àPÒ¶•z@  Oãƒ×õÿwƒ²º‹¯Ç¯}<Ä”F¬¾>P²¹§ñ  €uÔKìÜ$p“¯î5èÿV`Ï¤ÓÚ"ìƒ B  ý\·ýÄCB):€¹œ>b p¢8Ë9s°û|ž¾(æó   ¥—Ä2(Šºƒ-`h€7xÑÎ@ºDŠ	ç<ó¾ 3  D C´Ï­Ëä1´àÆúG¨EÐI"'JT&oa‘ƒ#Ç•  @ q Lùêº9Ï®É˜[kõ¿hÚ#ñNü>¬°  „É;‰kþ‰Ä=>>Õâq€Ðî&	Çù$À¢Š @v:8Ý
…2²Ä)›ÿ”½Ú˜.CÐÕÐ;:/þ)I6 !  •¯—eFÁ¹ÊÕƒI-¨à%VÝ9²—FŠ$ë.   ÍÚ ŠR¤5$ðì)ÚjŒ%Íç	ƒxrT¢m  ! Sh„h| TúKw9)\CqÂ©7/w94¶=Ü   xa¹Ÿú¨ú9IaE›ôeæîÈyÛé¼  B ãmû‚àßÀ4‚M‰ˆ-5¶Â¬0yC„  @0Ú+æ\¬Et'bAvípÐµ.À†Ä@!<bR9ò@  ˜?•<¯^éïí¦~"±=¦hPZ³/²1î‹- „  zÈFÈ5Gÿ(ØÎi¨`ª‰"MwvÓÉ{+Ä/ü € ¡Ô³# ¨=S0p¼j(zR˜òTœÏm÷Ww]x  G}JVy€¾íóÚ+¹÷ç]_r‡@â±¹"Wà~6  !œ¹Ù-~µFYY§¤ªý·¶0ÆõhŠß JB  ÁPŸÚXZn‡yXõöŸÈ‰É‰‚’j¶ °ÉýìÅ   1ï‘ŸÇÉÌÓŒ_6>&û“¬À&`w‘Ihò2ý B  ÜÈâ\Få^$	7ŸW5üÐ!®¤¼šÕÏ§ Å¤!J @ É#€šõ'üà†Ð„
Þ;±X›$j—úÒ  P7ð>ìúZ|t7gu8ùÚÏ8à¹-ø>ä   UúäÚz¬?HˆÈ~=Å=ÙÕÍÿW{ù¿B   U‡:/ÔB²Ý#»:=,í~é›ðvLm  ÀÉÊYc   óÏBGf¡ÇÅ<Ì¢ß¸œ¯Ÿ°0wE<§e‡ B  ýq<øýl0«½Šºö0@'®•Á¨ÅèyÝ‹»« @ 8TTld™îK ÒIPg-žúGETÎ«Öäbh]tCÌ  „ Õaâj¤`ö ˜9ìÝZÿ{îÐ—ô’ô?ë•r  @Tpß¿-,î‡,£öë»…øÑ»˜o5úç€  ˆ™ÛÇº!Ž~Ð¸.[˜\f—ªå
h¨þé&‘» €9qƒ¥*øØüfÛ¹¤g7'§¨:ó ˆÈ:J £<K !  M~˜vô =p	ú4æèr°™AU9ã¤ú(ü—  7Tf>Œš3uÀˆV£‘Êªuè¯¶CiS0  ! ì´3fýzÐDrí:îv`ý—8ÃÙ”þ<D¯=¬  ·Áy;à©¥š*mD­ïEæ2Ýûß;2Ñ   !ð!M{`ñÒbEì_µ(ÆiîèMdK V ÿÿ …€øúÈX(          áW£#wÇùÛÏ§ôÔé@ÉŠ•'V …€¶ì&&!   (  T;„¶GêÊp,¨–Sríà™cJ ´Þ@  à.€rãó?Éœ«›u¬»E0@q\§š¥¡ !  {ŒÏ,ó©a‚Á¼ì%ë©@ù:.¼£·ëv  fˆ¾lÐ£+M®-<ŠP>ÿ:rô­¸Záxâž–  ! ¾Ó*\Ç38`is¶U›“dâHj§qƒ“&Ø¹Ã  ÷${¦pNoC{Õ–ÐAŠu^tõNÐ5A»2–  !€&sÌLeæäzt“Píÿà	â¤“!  -bíÎ
ž¨eDnäCŒZ”Hu?q¸ ~àŒ&  	“k jL+ÀúZ¸è:ób°Éµo) !  lŸ©ß.‹hšï±™uÀÐú³Â]þ!ô  eÝAÆkê²&¡ ÓtÐhiJB€jõ'cÃä„„  ! ‹Ž¸ÚØûÐ4à„€'ì¢ˆ†ãŽmDÔ~ÛIÌøœq  ¡ ]ÛðÊóm°ïù_L×þ˜ UÈ¨ÁÓeiºÅ•J € WÚõ~M)hB–GÄ£¾~uD0Sg=÷¥û  	%˜ËéI(ET¹#}<¨õHà ½Tü €Ÿ¡eÚo)p‡TsW[~©~°:z
30qv¨ºãÚ€  ~³\<nï”â‚ïbd‚ú|¸@‚á\É0±“V‰“›  é#OHz §§¾É®­pP6JóEo@®³âug € ÷N¾VË¼v`0Œ.Eˆ¡f„è"¯kÍyN’ó  žú.êpì° 2û¤sQ„­dèZ­+Ô¸C(> €ù€=´Õ‚ù¥´C1†~°ÆUáŸåcq  nTá·¯íx\T¾š‹	ËØá î» €ÑªŒØw×ýÆÚ®bØáþ6Nþs°a³[ÚÕ6O !  *=%É"0\¸=«àÀXkÀþ9ØŸÖïzaê  „Ì–sº.CKÂÐÙñ`œŒ’ïßˆrÆ'ê  ! Ç•®à?Â«^ö'FUÈ ÈÝgr(M¬«  ]§ÉðMqáUJW‰QøalÿT9TÉ) € Xúœ—›ø;^À.°f~Wµn;ôÅ}s}!  G¨(úÈÇnV]6žc›‰wYÙf‚ k I9  •ç£É¡¶˜UÎKÐMæg k¸Ÿ'0”Þï,#­ "  iAÅ¡[7n“:4B/a|å@(`÷z †0ï;õO €0 h¬ôÔ/Vý!ø*J…Ê%™ÊwñW±uüDÜò  6„tŸ``G³/%|")?¹@Éƒ¦s6W.À)  BpLbž:Ùˆo«}B‹NåZRJ’ÎîÖîU€Ý1‘„  @ÁMí¢Ì©@á<aÏÅc'³hšc=’(+8@  èû÷[¶Ð‰ÃÉâ@ö->Ð ÆöŠ¹xR†å „  Éü~°GÒÉælQ×’°Q \a¾Æq…àìÓ @ ÎDÉ›Ñ•†n5ÀÎ¹óljgöÞ^ZÃ©ÀJšJ4‡  „ ù€?êÎÄÐ$$Ëßúá÷À*¥ÖžO(¬B|æîê  @Aà4Õîº´ãÿœ´RÄ½d,Ûó_1-Úð  „brËñúR_&Äå?-ã22ª¬ä'zƒ Yúûâ&„  @\Ñï,g>©A§jñvÒ~´/wJaM?[$@  ³··?Íß›öP‡Æ€ Üú!ž-qjŸì „  ²éô4u*ÕÑ›[ÍÝ0jû;§9?ëšÐ4‚¸® @ Ê¶Ú¢úÞMj@æø·™d$µVÔŒIùþ©|  „ Åè!e“¤PßRÔÚ›Îv$Òùh¯êÜ+Ë¯Ûp €Êº`<DdzgTÛš~$.Á„¦»?§oš«ãbp  ã+29næ}¦“òÜR\>" Š=¢1b‡Ýÿ€«Vð¸ €ê¾|Ë€þ[üí
=ücö´þkåŒ™æé€  “*W‚ðBGŽ¡²ŒÎÞ¼/ ¬9¿p©Ð:t	†  Ò&ÛÐ%1°>\rKS$°¡Ä(~n¬$8Ý©ñ € žP\`‚"Àû;‘¤UTÄi™4E€6².é  D×DMÐÆ`XPZáY°*Ü–¨‘Éªß¹®g €‡à_1àŒH¢RVqØnÞ+ÚÕbDÅ¬([”ð  ¬—Ke‚’ÿ“;ÜçXVÆí±|~ß ZúX–5„  @ÂMUy—‡iÌ™n“”±Žê?<°£±±[ÍØ€  /#„­àÆìŸ$ÃƒÙ¿}­%W4 ÷çÚ-lŸ©  «|¡÷Ç…ŠLaü^0•‡9$ûÎyáøÁ•à‚Ö € ?É™ÚeÔ@º×&`y4å8®K@~ æ­#…z  ”®aÖPdâoŸ’»I5{_”çqêDVÃ€›}î €˜`–ÂÒ¬´ÁÓ÷6K÷ØxÚÃ‰«éßNp  =
 lŽ~N—uì«Á,ÿÊíHËÊ1e0à€Mÿˆ? €ŠIýî(øÂžÄ-ÑÙÑ>í¢-êŸÚ8£%Öx   ~êf¥…-ÊæŒmOI €î:›?-¥Æ^7  ’ÆA™¶¨~7q±°Š+ö9|/˜‘SéÞû‹™  " .ÂÜæÅÏ\ÀôÉ ä?a­Ù‘óÃÎèÿlÂ   &šNÐ‚¡z9û±é0×ŸE”*™÷…áÚìuƒL¦T  BàÌo'„q÷á[iÓÜ¯½ÇF”{4dM¿ð’´B  @dzLZóò™q)îb{˜¸Tº®GrÈSrò [úÍñÏ:A±@  Mx3v€Mâ©ª¨ÆU¼Q})GŸ‡áu•¼·t! „  |›º7¬<NLg„#2Ò ?.TÑ‰ðáè^uÇ @ Äî9'6!¶Ú00nHXzª%x˜ú€úO¹…«ï  f’#;@gš‰š)¼‹¡w$Ÿª,ÿŠ!¡óö?3£K  !P‰šä9©iu÷{1I²HËŠ¿)™•Í?/`ëB   ëƒ
’¾;«§p’äØpLe9(±\R `pO$ó9B   ž!Ù—ŽoêŽãv†«DU#€d-ÐºNÑÈÖ „  …çMF’FÐØsÇzŸÙK¥¥ñ>ˆ¤)”Ük# @ ‹ T~>é¤H A‘òÕ]«Î€ÕWkAo¨ê´  „ ¶$¬ÄJ°?Å¸•Z˜4ý–š¿ 0ÑÇf%ygi+ €lÀµ¥pkÒ‘=Ø"n!»oÓBèUËmvùzžÐ  ó*|—‡ËK?ê×¢±¤“6â8ÂåÄëà°#² €Id}b^)’äk".žpV-§yðA%ÞšV¹ cá€  -‹µOGà§œ‰‰ÇO \úÙ9Sÿ]x°y³  ƒÜ`ì‰–M/œ/ì„Ç²u:LjÛƒÃ©É|• € w†æ7ÊeÍ·< x›–
ßŒú± Oå“)™ËBé  „ ˜‰SÈÿ0\Z% ¾¾¡h™5è›ß U[Ì_ð÷gž  @ïÉ@U#5=ÅåyÔ#ç{ÃSSÒ ÓxÞP  ˆë»œz(ù‹@wöÁ jk.a`¾¨ÝÈ´ûÐ`Æ;hê €9ÄÜUÇµì.u§“~*§H<ezp|MTN¥®.   Ã–(Å(ò(üÄ OÚjŒ_Ý€küœúGÕ¥a£g„J   äÌ&žÌÜÝGm;‡Î:&M'qBuÌP~ÞNŒ  D f›¤¾( {Cša®R–WÜÛ~U[0‡®¤>ÎN @©°í§®ôzCw`¡öÔY'3#GÉr¢ˆ'fþÀ  Œ>Š˜“Xä… }“ý/#Hç™ŽæÐÞ$\  €:@ð÷šŠkm7,Ÿ®QÈàï³¥AUßœñ !  ´‚Õó’
áMKÕíã±XUð2g7ÏC]Tà}B  ÞÐ!ê2pÇØaÙ ]šJ%ZK¸êÂKô¸™aAê    X“ðd;½	‰I7(  %°}ža@°3DµŒÿÿ T¹ÎÔÒ ] …€     %eÒ5(  lY?Å+…;¤Ë¢Ô!ñéd0]  € …€K=‡Šø`M„|áfÀDª•ëf:Öå@  }Hæñ7jt°¨@Ð%ýžÈ%§¤ý“PÏE|ý €¹	›q…4™aNûÄfçµM`Úu`aÍ‡1	,ó€  ;šü}I®8˜ŸÂÏüäÄ!pÖ	ú*¤ÙDßÏü£  å¦Ä·lÁðPÜ®¸§€6TZå&1ömî @ S†U	.*u	]ºÃÃE4"I“ðÛdŸÐ?
×  „ Ûr8ðH ¡ÒÒK©=
^®ÅÑá» hk±ä1  @G°{ð{³g³Ëg.ÖÚÆær>‰½•¡óÀ  „¶;Þ¯Ò©!Òy<çðJE„Ð€W„  @L}ÉC¡—³1N—þR[Û&à‡«àèµuzjU€  O&<<—¯Lä¿÷´ÃëýDðMøM"ÛhöSÔ,E „  w1ŒF>¯V&Bï ^Ú:@Ó|¿y–2Â|ô/¶3 @ m—ÁO¡¼‚ì®Q¬9^>¢xêÀn’c|§  „ Sñ6XÁ íÛÞÊ€ya.P“{y…ÕŽ°  @à0u+Àvä¶ªh‡š»»uš4Ã•ÌŽ£¤úz@  „²ÏÝú:GKLž·èÐº·m8ðo™²…'«Pì'§n €‘ºÓ¹¼Pç›šÅ*oZyÐ¾5%`ŸleŒ¢¥Û€  ¼¥‡ž›Pò-ðd´íc¸ClkpQR±Óz5§Ýí  ¯°áÚ¿/Ð K7€GX‰äº®Ì&´Í¹Ö3…  ! n:g›TÎ˜ëŸ€;À2š•ÏL¯&Òñgfv  -y³! æ¿«/ ÍƒT¹ÖÐ9K–¹Ä--÷r7x  !°ô£tãZp µdåGÎ<OÈ5.<Ã“]†ÃÀäeB   ò™ºTuööVZŒ‹Œõ÷ Wbrw¶ÐÙ÷âî›   Ô^­ûV ©v¤„ê=Õºà1¢goÞg•B] B  ³ÕúyIxÃƒÌè¿ÍÓ9½ðæ7ÿfË"^Ç¢ö	s  ïzÞ´?	õcO _úƒ^-GŒhb )n[ýÜG  ! 4ëÙ“õãÓk®òŠeô²<xþ×V&üµ)›1ÛÍ  -÷úx ,m+š !k3·ÍŠfæ’ŽIPÍ¤lã  D0áñ@z
žÃ‚ÝÂFêot(<c	e Ð¸@FÐø„  @C9œÑ…ëŽn6Ò¥Õ¬ù4è·3SP€ÎÓóê@  œoæÇÄ"ZÿmèÛ;ãl!`qhï®Iá „  ¹~š£¨
OÂlWAp¼–ÇòVæ Ñy„ @ ó}Eñ$ñ'8$’€œõ†ÈQ½kåRÕ6$ ÀÕ™=f  „ s`ò¨¢Úˆž×#„;Gzˆ2KA¢¿2  @ñ’ HyZÖÛf:Ý1/¯ü)¡u+]+ƒ°  „¡Â¼Ì0Cá•hUU×fc`uïWºðÀ„p„  @!½‹²:¬#Æ•d˜Säí«ŸÒºÐZœ[O‰¢€  ™ñ|Î£¼ÏPY˜a¨‚-sûà1Zº!~æÖ*&Íl  ÐVœ$ÞUð[­s¦ÿð6:OX
ÇÐBaÝ”f­Ù € ¢#PÂ²FwÞ `úèÁTyÂÛîî‹©Û	ÛK  ›J½lÍÃc!Å*E‚WÒ§œ˜l§B9«™— €æ #	ÿáÑt“˜·ˆþ{v/0æ2×Ì;'0  ´l«°ç¦€”ÖC-O€N¥äB8ˆ@Àsú#  tÂððÄ7à;;ïúÃy£tËYÆP¬ë†9%] !  gfD€þ•-úf’[Ùž`+©£Z9ií¾õ/Æ‰ó    ÅšÆIÀÂLipÃæÎzÚ‡k¯ÇõA/Sà,  „ H„Ë&ˆ€ŸÖ›ŽàƒÊ"tA®%“rå($Õ  aÒø#ºJ _¨Ãì&Þ†?(Z™y±3%^³ W!  I7”ÌÆ2wuÍ¼}ó›.ý„7 Â.Ô°SXk@(  ÜÀæ«Djør—š»×{L˜À5¨ocW˜Cð« ˆ  5aJô1"yÔýE¤H6ÐF§PZ'NÚÉÁŸ‘úqG…– € D0ž7c²àxœ¢c9ÙîRø20›Ž–ìf­µ–ö  ,5º`¤ðÄù-ÇÌlÉÃ<ö(F¯n»£Pz  @+ a ™Dßpvº2Žh0&‚W¨75_=k$Í•  „i'+	9µH®Éž ÄöDc½˜NßD>JÇ R¸ò @zë$•Î^ 'ÀAŒÂg£qDú0ÏÝ#·é6k€  b‰:ˆE×6TåÀÈ­ @wÄ9®ª€ß—¶$  ×í“ÁšË9\{QçMP[¥ÚõR¥oQ/ªd‚è € ÑK\Œ®€…ÊÚ`‘3R~#šÄWz–!RmN™›$}  ;3‰ŠpN{2!Ä¦’û;¿zP5D,æU'ó €€äéK,•7ƒ‚÷Mü>µÚÂß}=ûÇZwÑ  	f<Ôn jºKëÒ˜ZB¶•xÉ„‰S C4y=  €º‡­·:Ú»Ñ_mÖhNžšjÅ“°ÓJMzýÃ$ B  “+cë9<‹ |åÁ1ÎÀR®çEú,¨­ïÚ™ @ ÔôëŠ»î)ÔšÐøÊ^jÄ%
DÙµÝ®Ñ“éW¶  „ Z"tO[à$¶ìtpp|ÒÚ+Åasv’	  @Pæð'ä;k½óŸPÕå>f<ºý¿ÙD¼&   Bbú…H´H– ‡ø£ÐEÀy$Ž˜a’~çéÊ„  @ÄRÊkÀÙ¢­y0é{Í‰ä¾mçW µD5Ò9 1@  {–6N‰åö\b…ïºzoþ0ZûÎY
õwí „  , üWI³RÐE@©ó-òžVz‹è¼¡o € PZø¬sö†™èP\9
z1ô,
j1óSî
 	
o—  z?`Žmú¶¿I !ªk„$z6žñ¸ðbÆ  !p-jP¤YÇl¸ßÜñ‡›UŠ-Qx4>±(žp€X!  ŸNðÐ%ªDb:üî–m8_>¿·ÖÊ†‘zU@  ÒÐ‹5u"šŸ‚£ t^Ï—ºÒjO {äW:|§qè$s „  pªwŸÒÊÐÐeB›b”Ð°º½àQ93?_„O öí @ û_È¶¦KóÊòÀ°zÌw 3\‰ãê»k`‘6]®Ç  „ ’:vHÄ+ÐÔ#}AìgéÕ†ªÖ™`ñÁh €ÄÓàÝ—æº!ñÜÑ˜¾“þ]Ñ%Ô­Kv¾ð  ›«±r9-4=Fß•ZP+ì²ÔÎözOâ c ù#¾£B   äû[¨¾ž×¿)ßÎJÊ|É‡³ÂZ¶ú¿@  v¨ÜfI‡ÓÁqí
.|¥ºR À‘Z0|åâJ‘  È÷¯^ù¡ÜV]KI0¶”:JZš¾(ÊåÐÈænÅk  ! N‚º¥5„¯@0Ž¾
¼Ü¥Å‰z)ZoU„ZUk   ¦”Pç»‰^—ýf»¦Zá|%2  B`rô	&Z“yÝçýÎB;gäÖµ;)‘Îpý ˆ  @”¾U™¿PXI¦T0¯‹NŽî $€ò¯L:Óú)€  ŠhãÓoÀìsÃáÿ‹Eäv¹+ñ$9`Âlº}+£  ‹EŒB$^ 	Öû¦Ç õv¢yN¬ñ@Ò<u € ñê’ÅK`wÓ0°èŠ?tË¤€3»GR`W5_ r  .½ç!æÀ¢»Y:òÖã–ørØkªZFJéÔàOl  !Ðâ‘q@9ûîÓ‡n(˜¼%ã*]s°•z,‚ûà;"  žx3ë©Ò¼os€h²øÜ³-Îës”ðªD#z»  ˆDbü	ç	%Òèðlî$½—þ dúoYGS9ý¯e "  øÞ˜ÏÑã;#Lµ€úíÞ¾$zUuG«]`?°   ÕvVòõ6ÜÎ‘Ð ÓL1(9˜)Ó· IÌY  @ §ŒŽ+#õ;0…ør(  Œt.‘Q}`Š;kD<¹@ÿÿÿÓä °³¦            @d …€nï†€(  ±*qkÕ“o$¨È„°] Å  ú­oP¤'3rœêîH9û‚0#<)I*ë´
òm
  !`‘wiÔ·‡	Vþ¦´’@u7Ùn½¹`ÐUp÷!  †Ìúª^MÁþßÆü-ü|FókKÓÎÕ€…oOë  ¾Ÿ±lëåø¶ú–y_±AÓ6ÈJ|WÛÁØ3° !  <U6´ªvLë/¯LZØ^£ ?‡þ{†ÌABÙ  JFb@‰K|L/µ°â5/e
P„9h¬Ê„1  ! Tõ5È¸ÃÀûy;\AÀN£ªxçIbµb¤Ž  Ó=­ÍÐÙu…Z¢22ZÐêÆ^Úšy=~%h.áL  !àÂÁË]ƒçèÂúQã¸ë<'£‡‹U/ûZêðk  ª¤i•ÊÊå®øAy_Á]1´ûÛnv– ez«lð˜ €¡%Z›[¢4\òGÕŽÑí-IK‡€  à˜Ÿ
)û©Nè€K“æÇ% [«³XÔ¤Í´h  –J*×šì
œœÔu04Ó»0Õkx^µ4ùßÓ € Z¯ýÈg÷@Í+ä2dëknS2Ef½¤]QÏJ  Ñ³[¼PÃ<‰n!;öž>"±Çñ[¶”M €L`QWßÇ[¯%®jäbºÅ‰BmJ.…ýp  ƒð²›íñ	Uj(<~¡
£‚"K\€u‘4š €‡q™P3šrJ\.l!‘“2¥NøÞ®Æ`ïà©€  æ<7êƒþó=ò>:…Ÿ5I Âýœ#¶Íê¬€>%  < `²zNNŸ!°çU@É*h)Cað3W°   Y"x²AÇMÀ†KzÆþ<k×”¡i%cò«õ  F­„RÐ˜}¼:9ý
Töðç·¾âúª·‚ùøJó  !àŒLÂêùî…)öÇ#%QzÅÅv•Û=9ð½  DJ‚V\P“—j¦ØFI-÷×ƒY×0F fúûŠ €É÷Ñ9À>ëó®€U€\˜Jf#AJB6‘€¶Y€  H8¦Â›\c"~·Å m£®üí•¬f  ìðwè‰‘1°:Ü¦™0¥ÔŽã<ô^ZÝ«ø € \BùIcÁ.¦Ú@%ÓS	Iø‚Â§ïöûúÔ¡™‰w  ëì-2¯Pª ºÏéÁbú˜`3Éö:Iï^’I¬A  !`íál¨l²i‹±GòFl¯£Î€Þ°p !  …B@•$nÙaÿÔãÄekA«ÿ1eF€{ÝŠÆ  +tšIÆË Ý]˜´,
éŽw¼Ê×;É !  Él/ö=[<!ùmN“Á ÷ULf(È†ƒÿ  P‡4‚`7š3l>%°“W¹QØ(%ŸÌ¤œÊd  ! CÌgÍˆzÀW^•:Ý³=˜ü*, g±È
–#Æ  
*Ðf .æö?ºXëÊÐ+·8—Ê˜ž?é {x™Þ  !àò79ygÞî|rH¸v3\
,ËÐÄ&ƒð  DVÿó&¶¤á²¦+~ÈGbÁ4Uµ´• g Y÷Àh„  @óŽªiŠÄÂ4ŒWDùbð»¤S¥¨™Y'‘*@  }	ù71¶¸èEó¶»÷Âš '»3™¨`¶7 ˆ  à2àÂ-º¬ª#&|À‘0wiÚ+Ý•Š0zS‘ € Häo‰*jDE@pç×9˜3<Íý{”¼±ò?  m“¥øPu¤tz«WN+9àº¬cf˜{Á9¿‹–  !`ŠLÜ9’;;Y—åd¨É3Qlj~úÜùêÇp:B   ¸/š AÓ&Œ-"o·Ýµ<³¡†0™Ñ€Y 9†   f«›œ¤Åb«‚é<×]•ü‰\Êw¤;Ã¡ B  ‡j	¼Ó¥”L‘©kFq2i -2ˆ·:1±
Ó 3fä @ íÔ\‰Aö3ç¦ý°ÒªÁíø MªÝ3xÛXNÝ  ˆ Ö…ytl{ÀxÈP:8Ö+LL3e}½ãð²6 yMI €õÐÈðÚ!{¸µÐdN2\³ã–ÊŒ~Îà×!  o'Cck{^¢‚oô•nß=®ƒ
öë°ðÞ¦  ôµòyL.c£( Fgìé¯+YÐ¯ hú	bFë‚•€  Éz¾°ÌÙøßAdñ¡…3 />tÒ{i¸&Oº“  Èqá½ÁtÐúC	› ÓîZa8EdüK–Ÿ € Ì:ùA†z0­G²Ì.W4‰·¥´­=i\  OÄ@gæÌz(
Oü
LQ(i+b†œ°Ü]håô  "PÈ+RÚ"Ýš¯Ó‰SlèÓÃz­ØAåœMõ`~ÿB   ØäY­r°ôOeÐ¶çQ&']*–¾ÌRp›•°ùR   	Üšãlæ|¾äpöÜ@|úºUô€‚æ¼š2Üö½± „  ÂR@	•› <DJ‰z2¥4)6ã“¿?š @ ‰ÝáC/&¤y* Ë‘p?¹Á•ôÊOnµ˜çC~  „ ìu!HÖ+°$ÃwŒÞ!9h¢þÈ_‰’¿Cô\  @™uÀŒ™OºCd÷‡Ê{?‰[Ã‡ÈQŽvÙ:¢TÐ  ˆ±”.=«XøÁï e)¶˜ A6_[K
àÈ™º  +¾gšÞ¿]:lÁ=uéïÏ<ðËŽ'Yšr€  ÀU¿Ý7±CØ¢¼W©xÂ‡Õ iúõçëŒ®QŸy˜  ë•B›yw:lèúr.Ô„qgPÛ JŸ!/b™=' € öÜÃ;Ú ° sä/aDâ×­pëÓnk0N¬ô  âÏÔ\0H‹ï>Þ(p‡	zp ºàQ% €~@ÅL•¨;â‹§‡,ýL¼:tý¶ E‰/P  öU¿bå)±uT‡6º¸KµZz•òÞõŽ`ÈMå €Z>e±"oÝSè¸‡–m|ÙP¼WpH±’Nâº€ !  ”Gp”ébò7›O%Êù61€èž«º*n²5.+§šV   Žc³®Tz|EYðæN])„’½Ø¥œ%HN¶‰  D “€xø·(  Sú#ù,Ãò!&¤ç.ŸÁcóÆe  @Ïx°'°óË9Ø9îßI×}°2¶úlšŠ¬üÀ  „-‹#üì½¢ø92†k—PÏá"5kzáŸÐ!½~„  @ê Ï9î¶ûv_x/Ÿ,€‘©?Õàµ0d”@  Î Œh]jÐMl=²=J‡Üað`e€hzU9*e !  %Ž‡WwK›¥Vì¡ì[ j …xg4Žæ=U4å,  ¯¶Þÿ ®,&ËOÎ€#zMÚ"_B¹¬zæ¡vÎz­  D h†‚¤rÕ ƒ_{š)GpóÆÇ^™j¸9K Äé’š  @ˆW0ˆÃ¯s9ÒÒ§ßmÿGW¨¥\°ûÛU@  „/.rŸ÷ùCeYP™j=¦Üú­ŸÌPë{Õ„  @Ÿ­,}L¼e7Ú"n]*l›{ƒ"`>öÌ}@  0á)§W»X‹®ñf¬†¥p¹YÏÔ²¸À Ç „  AËºU©ùfcÇºm€,š}j°ü¯§ÑÌ  € Ó½Ãóí!<À2‰Úó¦ËN¥eeBÿ#Úd  p…Î) É5ÏÇ9slàÔ±ï•¨ÃÁÕi£©³Ñé €„°f\Æ¿ÿÏóË_4)™tNÜI3úÀ!  BÒëFºNãá¾ã¦õÊ
ŸØ±P?©j†Ð ;mz^   …qÙ71»}å2ˆÝ>½6Û;àÐÇõK+ÒWµ B  8ü¹RÐNeþÄTQÝqõ¿ðë/€‚½œØ÷kÇyX  ý1AâÞâX«–‘ê kú“wRJá;ø$çuŠC„5  " )Û¾váÔlÀƒ¸úqÃU½ZÂ$—ì,îÐgîé¢I   ÖÊ %Êô9vüßûÄ~·#ä[ã”Û×ß›%Â  B0>akÅzLU(sœ1ÜÞcÔ/ÐCòcË¦A@ÐÝ  @=ºoQë¬ÒJ¬©´iIZÒ7˜ã#PÜy(  ÿÿ \£t»±IH½       ä&h@óS`k …€^D(  ê4à±äç<.  ÝÌÊŽô¯Û±ìµpÔ°û°²^%ìãHÓY_$‹  ! ˆ¿ù}›€‡Vƒ$0¸Y#7x €˜¹s  ù­ãÛÆyzêDÌ°“Ðk¾ùŒmg©§IJÚCÐ  ! …ì¾:7j[A2Lœªó©ì:ÃelûŸPÀ°!  DTë+¡C5|d¯Þþ"¼.×ÉŒ&›ÀH8V   ò‘Å¤HnÍPžý¢Ö­mUÐM™4*Ÿçéú B  11Nz‚Æ]&‘‘·X¦±à	='×9”‚dM€´·   œyŒX<Ù,øÙSð*³ÜEú±É/(L0 € <×jM¨ÕP l 9+Š¨e½N¼Zša nN¿?!>M  œD¯âØÈ˜r·+ ƒj¯ØÑx½”¡,/ ûøW €€ µÕ&:ÄïZ„q8‚xÆ <ÅÕq‹½®3ð0  Œ¸óÛ”þW;rf¾šlûÅ99ƒ½@ˆG:  =ø°ŽûµÁ^ç-‡Ý¹Ÿ}Â­wPÔI¾Ô9‘±Ø !  Té=c¾>ò’Šl€ñig6`£÷ZUÈô4â|™   ÊðÌZsÇ…z²plÿ^Ð+|4TTéþi6Ð!Ü  B D²YH‡Ã€A2JØÕ'ÁŠÅ‘Ø¼/x‘Q97Sl   awîÖ¬;M¶\=Ï™qÖw–åMNE®#’h×  B È¡>ÇÆ52Æw¶À•Û¹ö\£,‘4©Õ°ÊB   ¦¶}U#NävÆ(ì «|óÀí”W   Ýp9 ò/SGî#š²•¸Ðü u]:„¶ B  áp~ß¯~®7úåzK|÷6à]¥°í‰òÝ!»f¹7-   ¬EzÍB®°iRð‡³’LN¡†\83¥¾þº  ! õÊ#Î mú¿Ï†kpà t¸/”—‘7/aVKU=  ¿È¸&­€qËzÃµP¶5KËGdžõ¨ž¬~0õ=  B 4ÁF|úJwrÕÏZ.Fu‹@L[Ê68+07&„  @êÁÚ …Œœêd‡À(/[[1@]Ë…¨Ì€  ¡AQ¾<@BÝX[1MêqgáP^;#¢ÐœÌñ  8+½§‡ÚI©ã×`Ä.‹Qj°»V°ºÐ`F
$ € N Y1¾†`švpôÑ˜—DÉJÀE4³¡‰bøýÕ  Xî„E­€¤Kh]"®«`Õ-9¾NSfÑ›÷xXœ €ã¸gÝï|Ç0m°½ËÆ'!7M@¡”×¥•Ó   Ÿž©ªÎ2ééd|ÙÏ¤ š¥ÓÅLn¢Ï€°ÀÎé  €Éý4ª—ÉÌ%‚xÍý‰”øY+%ÀwÂÃ¯tk€  ×€¼“Y.L*2[øÍ¬;ÂÐHëÛ˜Û­5¡ß—¼  õ)§ÍH€7’<ê¢à r¥dø‘!ÈIe¿Z € >–#ÆbfÎ9³ðHLœwÐÚå%|ÀÒTÆ{‘·…²x  „ RlþA núéæ©J)êßŸL¦‡Ž€äMõ§,nD/Ø @–´I»GTš Ýá©D	K!âJ ra:ðË
.(   R¯¥@V	Qìþ3SVt^yT 8=0Öj¶Ä €«(zuŒ³²P«1‹‚G#§ëÚ„@Jòé_)—   `ó²0x]G—ÚqF*bIPTcþº”Elk–} ¡  ŸF…eåôá:ë(yk`pšž59üË‡Z>÷©  ! &k}îºõ0ÀpK»ƒNÚ"¹#þB0Ži
oÂ	‡   µám€9‚lùþ‰M€*PŠ5ù¼|a|I  B3µ¥rXžÜü_ê¥f$ý7£÷ôúìÄº  DiD   3ÅõÉ¤C[’g£UBÑƒši{d° Ö0z¸@  ÛpÅ'4¯¡¸÷c³À÷ÕàÐ9T ¯Ø–™ „  ZþO€è¬Çº1F¼\G†ÐF#õF.K © ‚ ÕD4 @ œ:r3I¦·àŽ³ê<Ö,¶ SGÎ´Ù„äf  ”¢VÏð¬cm¹áÈîèY·íØ”Y@>Ñ  @ oú[QØ68õ‹ôL€m'O&ÊþÏãº	È  „Vg†»Kµä?YÝœ#ô¸Ý#KÚ;1ô ²¯Ò €Ú71}Æ˜:×É®”CjýO¾0+à:€zm»” "  =K¥#/ÿT¥>Œ B%@ØiYÚ`,þ¡nx§4   \Áƒ>­ÖÖ2¤õP4^±9-t±=´ÜQð’yàÝ2  B $˜°ü½å`*ð4Ö›KÌ‡¿èãl…âo?   Ò2p­|[Ké\XõÉAsEÚØŽM™Ž<WF¬  B€a¸BØC¾}|ø‰1“š…ÀÇ“
¢3­%D   |šÑ†øêDãÎ‚iQžË3µl~À ƒÜïz:ó@  YÔEÃoç[H·él1bŒ°	ºz9 õÁîÞ „  eŒáÌrµ†´¯æ·Þ¶ÀTŠ’Ú­57èÏ @ Ä3C[=¢»îNÐtji¿îÙ"ùŠeç=RÀ*˜Ø  „ #ÃeÈç„àiÒ›œ¡šYé fŽ( ð‚ºí  €oð ÃJ:&}šDŒPnÍÝm»z²>?p„ p  „ú£âÆ©9Â9²(ÝÜjŽ=zL¼Äx4;iHÿ•eþ„  @»äx¬7PíÏ€û¼
zàòW%—ß 2p€þGr@  ¸¹êž\qZì¿-<åœ3ÂUA0¢ØÌº(‹ý›ç „  ‚*¬ŽÙÅŒK0kÃÏ@euápqjƒ1=$~k @ `yxG^ºïPÇ¦Ú„ØªOVºuäMz¬–  „ Ž'Í^`59‚
<ðFåxZºî>X©“?*Â  @9pnVê ¤.9ÑðC3ïç[þ†ÈÁ€  „^ãc_âÔ>î*¾¤‡ÁÖ¼µlx¨¬´S„  @•¦ðHsŽ»êìQôõvŸíjÀpÔ €¬Ð’Z9—+€  ‹uúÙc­nBÉ©Hþ§Í÷°¥ÇKÃûóÛ½[¬  >Ä´˜Gefu8ß`ÀŸIùÅ˜÷ Ó5ÑÞ`®~   !ûç=ó?ÝïêÐ¼.Õ:&þlQàÐ6Ê­n&ª®ò   iK"Sà:a9:WÄ«êÇ³éÉáz%Í†^d‰-Ý  Bð’­Y³Vqún=ö‰°¬Ûµ,¥Úâ€š qú"„  ¢+ iåÌð%ú@íŒ|˜›ª³éºŽv:æ a  (Ž`±ºí*%¤Ôœ‚ïüäøG ¡hiKœ‹*b  ¤
5:£÷8 0#fŒóŸk¬Ëñ¦Ål  ! î÷[bíÐÓ@Eè%ŠùðFŸ—\Ã?Æ|Q‡Þ  S6dP³A<ÊzUãgÓ€íœèWÔd1•ÖõØd  B`#ç$¡Ã&ºíëýÇï yö‰›X¯³L‘ÖprZ @#:AksglêÌnÔ¨F`õË ó‚Üq€¥‰B¤Ú+æ±U !  ÿ:†üa8ÏýIYé[•üÜç—;ð°¸|¯ÜBª  þª¬nb"u^Lì/ D§óÃw›l¶oÍP   " P7‡áÞKU°÷ºÐí%kÿr5º,…(ÆCîHü   ©ÉÀÅâ!9†ð_Uæs\¿ÕŽXB@#a  BÐIæ‘¦Ú=5?8æ¸ÏÄËíç”°Ñ»#ê›IøG<è½R€0  »µ­btç6Áêýä·PpÝ¨øk_·mòBâ0Õ5 ˆ  ð^Â«ÇŸÛ1×*T rúÎ>:šŽQì²‡Ý³    c¬
é©IYößÃšhÈ¡¿ñO5\;„OINf   •Øéµ èwçÚsÕ`=Â»W*kìTúOe™ý4á  B0gâæy¥ Ÿw¹Í %T¡wÇ@{¦B   =ôËy¯XÖ¨¨ÚwaÏ²Ì.ZF{P‚Y‘—%§ a  ”Vfõ}¹$`t<	ñÛ$»¯ø}å®­UÕ£–¬¢    õþ1Ñ)¢¹]80pr …€Öz‚(  |K5Õÿÿÿÿ               )ÛP€“·z^GƒÜ{Åe€r …€×ÚL(    ÕiöÕæiŒúôÂ×è‰#¸ûØLr¾¢#:’€  ûþØ_–¬¿CÊÊ\Ò~©Øf »ówbßcxi¯"Ö  1´'cˆ0Ä8à_9b°žyÍ¯h"³ñíl•g¶ïn € –^ú®užj©úÀOæ­Þ=ïzWé(/Þ uç  SîK=œÐŒà³p®žS.²àÈµ®Yr,Bÿ›  cà ˆŸºGŒÖßš j¦‚ÿ!›ê¼y.xPS˜ði  3å	9um¦f›j÷Œ7›j„pÀ6`ÂçE sÚ^ðíH €¥uðÐ·ø’\ýëë¸)§ªäx5/<­õ“S˜I€  &?)ÜíŠg^jôŸW³v Uúgòý²wb  ¼.Ê`ý2)"j\ú°v0F½¡å“e\EI ¿+» € áðƒšÿ*[à@Êˆ
&kÁReäŒõ®» tm  81CáPÕØ@²¶}èd™VÚ¦±*sî ‰‰ €¹`y!Â¾¯*µ©å1ÚÁø‡ïeAúº‘xŽôp  kFÛC¯^×àü‚,Èlço&ÇÉƒ €	AÆ‰ €	*ßužê÷tèR³ÇêL5)„˜,å€  U2²ó®<>·Ær´g: ¥J‹ÇÙWþ’	a*  ÄøBU.ˆ‹†û<ß°¢÷k=˜cçŒ˜QeÞ € £eÄ¯­x}ü!Àijl®æ0qý[ðhµªIï£  zäÀl•ÐÛ» Õ|ŠY°Aå;b`]¶&Oç €¯à¬>üá·bª¯ù«ª'†Zq†–$šð  !¹gÅ÷l]eÿ°à+~¤þE¦5BF\ÈÅ túE)I„  @\~3aÞ±k
uy÷O¶[£ÖÐVˆmì^2ûk@  ’èæJy•*<dLv×¼?[Ó ÀEºSJ™EeV „  ¿<S¦ËA^¿§¾'0€’gp–*Q[9ÕÂT @ àiºÆ¶ÔÅS³@¹C¢ñ‚ÐÃÔtþäVcêmâ  „ ¥âÂñ>P®}ïšÈó„8¥ZmeÐ‡:ç„¾Ä›ï €`u›r’]‡²')¢â¾û»6¤^,É/÷Dp  ¾ºÜ™¹Û jMv?ÐKÐ•êÂ7âu€ ™Ù:  .–ØÝáÜß±,NþŠN¢þ ÓZÙ’9{ál !  v§¶C†ßGŠJr"òFk iï:u„·1,XCx  H›è> ÏF:°†üöð¶ö˜æÏ‘tÀâ¯·  ! ý \ Õ¯ÀXÈo˜‰7¹Ï0Óœ 7OkþµÅ  vÔ)Ð-¯á5‰šßuJ|ƒÝ”‘÷|–zï  !à®BÅÇØFà¾Ô³ŽÏIõÀnµâxq,-TðÌ  ªH$Â%©š=+Hd7‘œ¤êÂhà uú €0òçåÑ#à"úâ@äÌ´Ž'Öa¿y€  Ó_,7^4]ìŸh0(eRóª n²¸1þœ‘f~9¢  …ùþJTfmJAŒ/ê0£Z¾×®'Tt×E{ € ÇÍ1}†ŒÐü×@ˆT-ËÍ~ç^ —^pˆý4çD  f	„ç9Pîò.”œFí=äu(¯“M
BâŽ €Æ`ÁíiæŽ›Ý*=Âñþ~›0–Œñmp  ¬ÎmÉv[`É
 ŸØ8ÐdV‘$¸€:ý–ÿ €áV6sˆé”øø93Þ*¾ôP—Ù[>8€  Æ Þ´|HÐ§fYûŽBE É6Ü·yMlö/ÎÐ  K-}Ãk¬…\…œ¯°õ¾úz(ö|Ú"U|¬bˆ  " Xê¸,S¶ôÀ±#$€Zfñ×QZÞß6´Ï}™ÿ   ?ºÐÄfYïÏÌF²Õ§+òCúD@ÖBü¸  BàõGÙ‡Zˆt—‚’U²pôëþ†Õ”®aËð‚ûˆ  @%úïùñ¢}T2ðtÞˆÆ7 8 vúšÇš)5g	€  Ÿ0Ú Sd~J)VY‰uš,rºR9eáM]S"L  †íKß˜#ÚcF¼Â¤ —¢Ù?%Ã0÷îâ%Þ  " Cû/ÇÏ»Ài0¢Àüz´B'ô¥]hÉùw]G-‘‹C   ×ä3@:8©-9g{“	L«5œq‘µ^t[†5  BPž|KoZJ½\€§eÖ!0>¤6ÈR`—¬„   <QzŽ,£ûtó®ã‹©4HG~êNzpoÇÙªfA@  æ–çx1¿5ÞB}}ñ¨fI€0a]|o@* „  u;5s~ç¸ÔÔmŠÀ-®Êpô½æø0ÿ @ áh„œ£Ítš´ ¡À•ëBŸ¤”\kÓ=|›æŒÿ  ˆ šº‹ûW°Ïkz±ÍJÌN˜3ì}5Nei ×µQ‚ €ÏÀk M9)õ1N¬£ž-Â1ÏUè6TdK>Ð  4Í‹G,j¸#Ò¶c"àÑ•7Š$),äài€Ð €öÞd¦’íÃw„%Öç”<¹óð‰]°¼¸Þ@  J÷ÃêÿõgE•Ú®R’M@ wúrÈˆ½Ã—3ã „  êÞDã“‡30Ò6 7¸ðDz(¢¯1ëèöŽ€1 € ÆSó«Ÿ!×#Ò 5á¦ e/G«6}M@é(  ðäÔË*0eÛÂŸÞ˜&v‚æ#…êáæ$ZÉ– €º@šÂ£¡îNT4¼ïc­u¦Ãb‘‹¾20P  ¥ïÚ¤×Âs€`Q./pg?þ\2ç§È`{‘ˆ” €ÄKð‡
eåLÍViG¶ÅŒJk˜p;O¬XÂÊ€  ÍWŠ¡(äüâ‘¥ºý€ULN]9u¤]Ûã³  ƒÕ8Y#ÓÊ‹~.k®ò“. ²iÜÂ»gãyœ9  ! ¿¼Ö#y®Ü =æoÎ9ˆ×Ûß–À2ÕGAxÔƒx   ÕèÏž°7u ú,¡%ëiKcÃ^2%—×»iQy  BÀ¨W³9¦xïÅf¡nê>¯ÚAœ‚›éÐ§,„   8Z¤É
Ñù’Ð L %B\à—çêJø€  !ZIÒW§øQIB‰ß+‹FðÊñz¤oÀÏçýv B  ö€‚^#Âºo² x ùb¼x&…9ŽQ2°³ôaÜ   Ål‰½±˜ÑÑw¿RÙ›¡¿óªèÎmå  „ Sói ±÷ô ºWbÄ@lá¤ø•áÀOÉT’æë6ø €;0SŸø+žÑµ™BÍáI±YbØ5òM¶øJH@  Oyc0d0O¶Þ2|FìÏ¾®`Ðu#®PÓ–“± €šÀ%ŽÆÉÆªjÝ0¾sü\0Í`9l=ú*:Ú“ B  /OýoÜ¦ä5•ÈÖIùp^ù¶`.·¥Òª	êšû÷ @ ¶ÎÆÜWYž	sÍ€‘hš€;Á*k	1D£nP<:  „ ™ KË¢Ð&»åÓ¦`>žoÖÃ$VŠ_  @A üüRé6:>À><¹Ó|¹ZÌ/ÞÒ~Î°  „©ñ‘üºCä£Ìq(QEÑÆ¯‡ò¹KÀ¿ ® €ú#vnÑ ŸœÇ%ù*dyC‰Oë‡Ð`Râ	š)eÓM` B  H†É^5m!ïV\*Oàl;Z:n
Ø&ß¸•1… @ «5ÙÜòl Ú™ðêIÃ]² [qé$:ÀT’ÎÂ  D n…`Kï‹ yú6fò:t{È;ŒÈŸí4[ÁF=¨I  @f‹Y>‚9\lON6àHîŒ´êGéY¥J#Ÿµ   „Ÿ.–½béac´0†"vDÞeÇVõù0§â @øZK9[Í|A©èÕ€B†BGP‘Î@'z¶¨#€  5èÒú°¸Ql%%œ8O^PN­÷l4UÜ‚€¢  ˆÎ²ÇçïE¸=AkU`ëvåóAwˆàÇ@Æ € IÒlê‹ú„phdrú>ÜwÀ7ÿŠlâz™9]Zh¿  7‚ô€øèÚºi±vSnÜÝgQ]8L»š1ýÿÿ y …€ÐÕy         (  ®h³ŸÄàgž¨$9ØÌ?³Dr y …€  Fòvó¿×Óv¸È`è’;œ±cTæ°.xÈ €ÁçïvÌV¯E‘X‹½m)ÆZ4¦Àæ™x¯`€  ýÃ@²ÐÓ¡fñ<0éÐpzëÑ£í»w$2  L3@€gåäóÖÜù0ÈàRÆÒüöiAí6¥.ÄQç €  íléê«‘bbð—ØŸ$Y3§âI<®´L·  „ $ÉÉMk zºÇ?Ù/15YoQup‘€a-PÆµÅ   @Þõ*u
Àý„ÞµBF¬ý‚[ôãÆ©_Yd   „ˆ™éK–în«¥·r®ÒÏÜ¿´5è/0ùò„  @@Šp2Ò´›ºçc;%+3§ë'ÜÁ¿@z¾r)R@  ¹äïÆÊt¾réZbÝP¨QÑ"‘±TW¸Ù „  ”«Ðú/àët˜`±.Y#ñëL¤v›ÅÉ2 @ ßÙdNšWS‡-pàó¿ÖõÕ©‰4†±€‰S0  „ *ï;ò´°€Ýš°=Aø^»–S™¼~‚r' @´Ša5'„
å·Äøûì^éL2¿ñHVsB&   É^Syd²÷MúîÄÎT£sÓd¥Ø®G§õ°’»	· €^Æ$¥™uµvnEµOt3ø5DEÀFæØÚÜ€  ¿Å!sºQC\™Ðe/ÝtÈÐ€à	¨;!žF  ã„ÈI´-Õe6&Ïà­g¥GÅ£÷©Óœ¥ÅCW  ! 7}_ºUs8€ð“/yY9GX––œQö|EÃõ£Ó	  Ð;-b {úž¿Ëm$çÆ"®:†(íj-7QÕ	}m €­Ây†òýeýü¤<Ëè6÷+O¸Ìt©áö   Ö-Gq÷VŸgÏ²- _Œ]Š	tqº0Ì©¥0 €hÙÚðP&‡ÅJ·-´š,Ø–Sn@>qÒ‡L½§€  '"µÿŒ½‡ßì»2mkYPþ)€W}Y××±,i  3&a³ìÍ¥æ¯Ê…`^ÿBgÔEUOJŽàÖûÿ € J|IŸµA®Óp¦c`44n:I½º°A{<ävÅW  NFÂz+€Æ›ò²½8Ø%!ƒ?SÒ¦$q)n €s<ò´‘>Ú¾]W6X†p«Äãƒ`PrgIn   ÃvúÜÕšoöÙ¡Î5ôDW]m’¤‹®±°!Çô €öóMkÙµ`¯¢·Ö4å_Ù¹Ñ¤?Àz«´žo!€  gÀ^÷R¯’lôE7ñ¿Ð’¨,ûÕ¦ØFŽ  kîŸÀòä‹fdŠàmÁŸúzöf}Ïj3lðte  ! ¼äG·ž+žðAÇÐ¼&=¿_æãüÂÍÎ‰Ç    øÁ‚ä |úðtî_Î,+Âq–LAñ$DÖêÏ·œ© €u—œ—´×ö/u±^*¨5šÒA»Á»­2‡   ¯²›û"U‹×€ã²pÌEª›æß0 AÄú,  „²¾Í„r¹‰TFÁPq&ŠŠ@ŸS.Gš^YSP B  0>S.TxÝÃ|„£¯,P®üÜgêß:ž”Oð @ üÌ#=Y/5`áµèº$cQCÇ,CÌT×­ÌL  „ ±CÏp#–¨9éìø³µã3Yq/Ã˜A*  @ËO€Im¦ÞL8¡¡i ^ÙsoIˆúíc)‚€  „éµ7*$ dç^§‚I!„¨¥ „• €M |:¼6B   ?}5“Zü}í?Ií«êg6X–Êñv9U°äV©P   ÛRÈ|ˆ'5ê;åþ«Í@ó>ØÀúìo¼7çð B  rŽäœÞÈp¸"”:5ØÐiæ†Ç‚­;šË£I   ¡nînŒaûGÜà3% ‡Oó"Oð*DZ\kR  B r®"üÖsFð(´¯½š’ûE)ÐlIÇ*PÒ¼Õ   Fr } …€N_uvš2,ÉS\:FOm4QºB¼<   †…Ùó¹náÞ6%ôÁÝž’ßÁ·ÁßkvgŒµ  D ù¶zºÂ !iÍ*°ÞÄÁTk6‚0™£Æ„  @e9íWöâ@%ˆhÑÿÑ¯1Ò0@úh©jÎ§@  ›Î2R˜
eæ‹8£®RKÞ›ªPiaÞ"Æk»} „  ¤w†Ä&q Ëç¥…0Í`v[“z1S¬)­Ú6Úl € \‰\GW…pt½àtÄéT¶Šž L×¬Ÿ&š  |ð,7‹€× b³‹2Ãþ	g”EÍ4¤Ïªkˆµ €õêê‚¦¹vq!|m¨l*Ÿ æµr}q{+ !  ¿Vsš)#„WH·­éË¼7âé—ù%°¾Ø‰]9   l|ƒÕhµù¨=\›­YTDˆæ
"À\ä[º<Ý³ÊN© D  î‡ö…*VÝ-ö¾qÔõ•ÐIÐ9@!Ú6¬Ôön @ ~©½oaþý÷4Ñà4¼îÎz1&nEz±×`º+'G  «L…Â³ð5ÚÞŒ¨q_Nš›&¾I˜eC©ºÕ·×Ô   ( ~ ù™ÇkFä§¯òsÇ‰’ˆmUž=¼#  BÇš5	A­Þü”[ä†£Î4#‰”1Ã7 ž\B   )fì\RDÝÕ3ZN#ªOÞà‚Pñ,«0ZîÖPc@  ÍOqHÔûBrE½`•MÝfäT@x±›ºû.v´} ˆ  {#]r…¹&F¨%«PJY0ZKNözÔX&	^òóK € i™;}“9G“`àÓRY!«t«äb³äd½e0zJ6  •œÕžpÀõR3¿W¡‚Ï/í±ÈÛµd €€¾ø¶~=Þ—á—®åZDaCzÅ ×¨!  …zµÚ£(Ò²UÏî‡´Ñºp±û”%™ë =.òåºE   ­÷¾ Ïÿž
Ët/€9Æöoa°F^íÝÒ¢ÿ!= D  Æ¾àøÆ¶¡¼š†4ÏÀ¶DÊš âéÓŒ^Óu? @ ;ïÖlháxÐå&9a>»ÑpR°ozuX  „ +ÎÝcñàZÂSgúY®4ô$V(ÄQåîüìúº©‘ž €ðçP…:‰†w2Í'™€§©fÇÞª ú  án@BÖ;®XcV×½·KŠ 1ÊÏ—bN €¡5aÉ€lGí};TÃmÒA#eÇ3Â Ò*~ú¥á¢s "  ˜šñ­¼åÙ7%Ë
L9
u0b¥Oº°Üû£–‹>[_ €0 ¾IO ©Ÿ×‡¬ø#Áx4|Y“øËXøžtI™ÒÒ­¥h  þ{PÂ4>Tú’ÁÞc]HÚùÁÞmDëõ”¡  !`Õ<AÒá­ÍpØß»÷?LÜñYÁVPpyB  3åð:/jzù¼áfîÑÒçWã?!ý€˜‹Ð€    à)äºŸ ÃQ½~U7øð¨-õã8»ßFS¾Ò¦) D  ŽòÒÊ[“{óo~¦>x_z „ZöÅ#QYCjÀU¨ @ n[X~Œˆž w°PÓ!q9Í&#½ÞÐžÆaOBCb  „ 2ÍN—ÝÔÀ]ûÇÊŠ›ùR%†²Æ"øN…6}²  @eûÐ žÊÜY-Ÿ3Øýèæâ>O„À:v·ê:à  „ytãú5kË’ôkÚ”y.1¼CÊWvôuÂŽð°Ýºi  Úÿ„L•®¯ÑjÍÜó‚ÑŸÇ¶Ë €úŸþ–z« !  9¿k>ùhð)e‹ÐPâöÂ¸½ YÀäSÑ£m(  ð°Àµ³LRˆGÖ Ub(:¯ì‹ü•‰ôE½c  B 8¬îZ9Æ0»<ö¸zggØÔf} Z LJ>M‰çq  @õ¶@!ôi‹Ô …M@.
‰å'¤&ûŽœP  „^1ðx¡¥IÚ€o?†Âß4]…ôÉBw`9sí €Z0²¹Ð!snÉ=LˆÙœn¾ª6àpe’¬7Ž†ã !  ¨‚Rk½F2v(ø²4­€¼ÛùÕYqºoFnoZ  æúÒŽbÔç­“V
w½:JÖ‹I!&¼l,(ôL  @ «Â(ƒe D€c(  ØØX_ÖCÈ Ë¥Íÿÿ? Ìz%ÊÏS°€           …€m#ãÛ(  ¾_Á@VIîWuçI˜·snàƒªŠ  @À€ À†•²ØˆT†ð¹Ï$îˆÓžrtqÐ  „ìù¿þ¾¸¬ìÁàãµU/? äfñàP«Q„  @[< ƒ
¼Ef¿¿ÏV2íÖûŒð´ˆ€ëø   ;çŒ`…O“ìˆØ¡Úb˜K zü)´ÀªÈ B  ïág*Kú—»bë{I7ÌÒŸZ×äÄË`(¢Ñ   ¼J¬—‹ÖÀ´l Ü¦í¢@Cô†ÉüÍNgŒ  B 1£o–š”­0ú}bð¾eÄ‰XÉ™(ê}ªÍÿi   ‚@Î
…{ºlŸ«šý¨å"q@¯Áºœ ï  BP¦¼©zšyqŽÙ2cü¾ãúéxÌ¾
`ç¶K„  @†ÐaFlàÚÖá!ƒ¥· \ ±•pá{±;ö@  )¸Æ4V«K¯]fú—Ì+ð-€6uµŸÒÉåÿ8 „  BdŽ¿ˆàB”ãu,~FüìÂ'®aSW   ñ8OÌ¡¬Ô>· :RÓFºh“%ƒÝjI‹ÄŠ¯ûÕ  B ó—¤¥€V°4úÕt
·<“&¦&¼£«’ÿ  @ÌÊÀ›Ä€/]oåqœ(ÃÅÉ6q[È­8’Ð  „Ún:Ž‰	ÛB0ÑjÖ Þ)KÏÑ¡Šbà‘¼È„  @1'êmU½TðMÏDÊpŠ5¸ÃªN‡ðì_!¬n¹   \ü0“ºÏê2ÇbDñvÞ.ŸÉ¶ ‚ºo\Û	¨˜ B  %@§ûÇ>Q(]ÄÔ¿¤ì`ôÎïð+>‘¿f   v»RÐ.?ê4^ µµK_I
´_Ò!lÎ£Î·ß  B ð8údÙB¥0%ìÏþ¹s‡ ®9ÉØšSð±wà\   ãÊ6@¯F„—µ}æEà3ñÝôíL_Å;l$ŸÒ  BPK÷cˆ1â¿†ÙVæÝR¢_â‰„÷`7YB   Î…3ÈýÎE¥é[6Ó§û“ý{7ßkp¼Çø–@  †Và¿üÙ\À€%ë¶£‡ô~ñ€½@‘zi6ýò© ˆ  •ü;¹)9íÌ%S›õºÚ-º
16r­éµžq‰_ € ²{HAw( íØ	#Y½²®ƒ@ø	?Ã“[°  _åÆZ3°ÍÃ­ÜeÌoeçëî:¡41üwEþb €ÌÀ*tõÍWäwýŽOÐ×ÇXÌqÕ€l]3ÀUÐ  ¾¢ûÒdÃÿÎÑÅn]tÜÆÑ¹ªË^SiàcÕ €­ñ,J¢Œ^}´¸&ðZNo7¢õ…@  ŠÄ<š.õF’Å¿®‡Ù ƒújd €
¬Hþ1ì „  Ç½õîw.FT1Á÷þ"®¡üµTü†œ @  !ëpß°† † ŸU@GÚV _Ó  „ ÂRë6Éœ0cv£xYVÂ3Và(›çÃÇ>Á;‘  @H;@^Ã‚q¶	eØêâ 7‚½®_îÕP  „	Ýù/Å*{äáh4²¯®â*ôˆ ø_`²¦¶„  @ð“Ï¿a®,áÇèu _lÏ;Ê"p+~e´¯@  |óÇ¡Ü÷¸`JïÒÍ@6ÿNE€zÖÙ4fuŒy „  ·,ª]EçàÜi:„¨j³Úðþ…è¤Â¹y­ € _ö*.· ;£‰Swo^
3©’æ¯ô0½Û  E9è°Ëi$V7‘E,
QÍÎõø‘ûûí3=Ù €^ÀQDÔæ‘¥ŒBVâ?\ç¶®Î<Ð  Z·ð8Ú„)êH·GBéÉF*¨Û\î î”àÊ”õ< €Ú9!v¤”Ð†ó†î!®ÏcðƒÚ?&Å^œ+Ø@  ýTûíã‘^ÄdW×^Èû¶è „·ô]×~MÉ±Ï+ „  ×øR¤H*ð$C]³ŽeOE¿rÑÛÆz<5ñ @ ­­Ö¢jˆ1î` <Yó;°ÆYŽg/ŽÑã§,  „ P=Õ9øÅ0ÇDý¶öÒñPGYÛatúÍŒø  @‚ @›ÊÔ°Û9ë ^þY›"‰«Þô}J‘íÛdP  „ùT˜ñ*Uä\ŸèÚ|OÞqD»ì`
¡„  @kÄËžnâìy‹c³ŸÌâ¸aU„p3eaZBjÙ€  ¡«X;ÈÉO³ðìËe½ÖB‡€g€FÛ¦ÊG¼PÉA  £Œ²uUêf˜>Ö‘>Ÿ'b;&|ÍgA§±  B ¥,C+ƒM ®9äÎm,^Ènì÷5]”òêHl   DëX°èÎÅAåó«Ð¼Y"(îçªÏ§ÄùÕ%w  BÀdZåî±Wÿ^51ìW®“€p4˜,âÙûMÐÏõ  ´ô¼ÅGT]°®%ß?Âßiøþ;¾ø#>¥J:ŒÞ× !  ¤žÐ,:(Paøfïè€-ð_"Ý9—q<”GÖµ  m×tóPºùæ4²Ÿ^ …ú»-CJÒývs$%³Ø € +CÆð6Ù¢û/ûÉ­ÚüA©ü¶íý·½  S»~W{ ÁG>ºNÇ Â"Ò›€PQŠ=Ï¾…  "0.ì<Z,ü¦…:÷£móø« Vu{ù–4Ù@$B   õ?Y &›9DAª
×àŠ„ÌÇ†<€PÿÁÝ   W¸sùIy™tqŒ
÷ýås9/?`Ó®°9àœÿ B  Ô§-Ü…Zú(Ce	…æÚp5¸W£zC]Ev‹•,é’ã @ Íðþ$ººµ5¾€Þœ.Œ7YññlŽú|$˜Nø  „ |ôcBN³ÂXÕ]VKêy˜Ç$T¦lµ¡W„+Îº €d7 E-Óz14Þ‘râbžÜÑïAŒQ ê©;Áæ°  0·›%9àKñ°^Kn=~GG|d¿ãGÀF\ÏP €f7­håbÚ¹Ù.7LDæ7LÐ·­:•H€  HhÒïEäïœ¥¡ÆÃ,Ýà1øË6ZB\BúfGë-  \E~33¬íÍräð\]?h€&N@`HÚc   ƒ;{´?‚ †ú«dÒZW¨´ob/#·z›—¤g  ›©xÅ9kµ[ú–\É»C@øÅ1Ô†+  ! £(2Ìß *­ÁNB·õ®š'Ã¥‰L(M0í"  à@¤¾Òìå¶eè™GbmÏÃe}ÓP@ùCÂó@  ¿bØþ ]’5©d
lbcÝi,P÷|]º!Fþß „  žH•O^äòU
ûÔO`•†êY‚Ý?[)ðÎs @ ß;š™Ç8ùÎØpkprV¢
ƒÔ~¬'þlÜžv  „ 3a› ®€